[
    {
        "content": "<p>I think I'm going to be rebooting this project. I haven't really touched it since shortly after I left Khan Academy, but it's still an interesting project and needs to be updated to ensure it works with the latest wasmtime-go and fastly compute host.</p>\n<p>There was an interview about Zig on the Fastly blog where the interviewee mentions jedisct1's zigly project (zig guest bindings for fastly compute), which he built using fastlike as the test environment, which got me thinking about it again.</p>",
        "id": 238634959,
        "sender_full_name": "Alex Vidal",
        "timestamp": 1620918779
    },
    {
        "content": "<p>One thing I'd like to do is update the test suite so it can be used as a test harness for third party guest language implementations. Effectively, splitting the test suite between testing fastlike itself and testing things like zigly. So someone making their own language binding could run, eg, <code>fastlike-test -no-geo ./my.wasm</code> where <code>-no-geo</code> is a switch to disable a particular set of tests (geo lookups)</p>",
        "id": 238637244,
        "sender_full_name": "Alex Vidal",
        "timestamp": 1620919698
    },
    {
        "content": "<p>Oh wait I already had that idea, and it involved having the guest wasm return a specific http response for any feature that hasn't been implemented yet: <a href=\"https://github.com/avidal/fastlike/issues/7\">https://github.com/avidal/fastlike/issues/7</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/avidal/fastlike/issues/7\" style=\"background-image: url(https://opengraph.githubassets.com/d25897c414f3f86ebae6f1ad1dbbfd74c097d4834b889571b8281f25700d5ddf/avidal/fastlike/issues/7)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/avidal/fastlike/issues/7\" title=\"Create a &quot;spec&quot; test suite that can run against arbitrary guest implementations 路 Issue #7 路 avidal/fastlike\">Create a \"spec\" test suite that can run against arbitrary guest implementations 路 Issue #7 路 avidal/fastlike</a></div><div class=\"message_embed_description\">Fastly has official support for Rust, and beta support for AssemblyScript. I think it&#39;d be interesting to have a spec test which can run against wasm binaries produced by both source languages....</div></div></div>",
        "id": 238637390,
        "sender_full_name": "Alex Vidal",
        "timestamp": 1620919777
    }
]