[
    {
        "content": "<p>Hi! </p>\n<p>I've been looking into wasmtime / wasm and am very very new to wasmtime / wasm. I'm just wondering if people could clear up some confusion I have regarding two things. </p>\n<p>1) I've been looking all over and can't seem to find a definitive answer on this, but where is dynamic memory located? Is it put in the module's linear memory space or somewhere else in limbo? Also does linear memory use guard pages or bounds checking (I guess this is a question of how large dynamic memory can actually become? </p>\n<p>2) What are the spectre defenses deployed on x86 - specifically on bounds checking (dynamic memory)? It seems to be a <code>cmov</code> instruction? And is this done for every load that occurs? </p>\n<p>Thanks!</p>",
        "id": 417365786,
        "sender_full_name": "Alan Wang",
        "timestamp": 1705982117
    },
    {
        "content": "<p>Typo on 1) should be \"Also does <strong>dynamic</strong> memory use guard pages or bounds checking (I guess this is a question of how large dynamic memory can actually become?)\"</p>",
        "id": 417367042,
        "sender_full_name": "Alan Wang",
        "timestamp": 1705982898
    },
    {
        "content": "<blockquote>\n<p>where is dynamic memory located?</p>\n</blockquote>\n<p>One question first: what do you mean by \"dynamic memory\"? There are at least two plausible interpretations in Wasmtime lexicon -- memory allocated by <code>malloc</code> in a Wasm guest, or a particular implementation style of a Wasm linear memory (with dynamic checks).</p>\n<p>I'll take \"dynamic memory\" to mean \"memory allocated by <code>malloc</code>\"; if so, e.g. in a C program compiled to WASI, then yes, dynamic memory allocations are allocated in linear memory. The C (or Rust or ...) notion of \"one large address space\" with pointers is mapped to Wasm linear memory 0, typically, and a malloc implementation is linked into the Wasm module.</p>\n<blockquote>\n<p>Also does linear memory use guard pages or bounds checking</p>\n</blockquote>\n<p>Both or one or the other, depending on configuration! <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/cranelift/wasm/src/code_translator/bounds_checks.rs\">This file</a> implements the Wasm-to-IR translation that includes the necessary checks, and describes all the cases. For performance typically we want to use guard pages (which implies a 4GiB + guard virtual-memory region, for 32-bit wasm pointers) so we don't have the overhead of explicit bounds-checks.</p>\n<p>We generally call a memory sized and configured such that no dynamic bounds-checks are required a \"static memory\", and a memory where runtime checks are required a \"dynamic memory\", though semantically they are both exactly the same thing (a linear memory) from the Wasm guest's point of view. Both can grow in size; in the \"static\" case this involves page permissions (updating the guard region).</p>\n<blockquote>\n<p>What are the spectre defenses deployed on x86</p>\n</blockquote>\n<p>We use a <code>cmov</code> to shunt the pointer to null on the misspeculated path of any bounds-checks, yes. For guard page-based (\"static\") memories, there is no need for that because even a misspeculated 32-bit offset will always land in the guard. </p>\n<p>There are some more details <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/docs/security.md\">here</a> including what we do for a few other instructions (e.g., indirect branches). You'll probably want to read that whole file actually as it describes our security posture and techniques in a lot of depth.</p>",
        "id": 417367962,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1705983569
    },
    {
        "content": "<p>Thanks for you response! </p>\n<p>For dynamic memory I think both interpretations are of interest to me, but your response clears up any confusion that I had. </p>\n<p>Thanks again!</p>",
        "id": 417370006,
        "sender_full_name": "Alan Wang",
        "timestamp": 1705985004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"685313\">Alan Wang</span> has marked this topic as resolved.</p>",
        "id": 417370009,
        "sender_full_name": "Notification Bot",
        "timestamp": 1705985007
    }
]