[
    {
        "content": "<p>Hi all, I'm trying to better understand the component model and how it relates to \"modules\". I have some questions:</p>\n<ol>\n<li>The docs sometimes talk about \"webassembly core modules\". Does this refer to \"modules as described in the webassembly core specification\"?</li>\n<li>Will components typically have multiple modules inside of them; or do you expect all composition to happen on the component level instead of on the module level in the future? </li>\n</ol>\n<p>I'm a bit confused by the statement of \"modules are shared libraries, components are executables\". Do we expect some runtimes to provide some shared functionality using modules, like how shared libraries work on Linux? Or do we expect them to only provide such functionality using components?</p>",
        "id": 384008173,
        "sender_full_name": "Merlijn Sebrechts",
        "timestamp": 1691767504
    },
    {
        "content": "<p>(moving to wasi stream)</p>",
        "id": 384012093,
        "sender_full_name": "Merlijn Sebrechts",
        "timestamp": 1691768108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"639836\">Merlijn Sebrechts</span> has marked this topic as resolved.</p>",
        "id": 384012109,
        "sender_full_name": "Notification Bot",
        "timestamp": 1691768110
    },
    {
        "content": "<p>Hi. <span class=\"user-mention\" data-user-id=\"639836\">@Merlijn Sebrechts</span>.</p>\n<ol>\n<li>Yes, that's exactly what is meant by \"wasm core module\".</li>\n<li>There's nothing prohibiting having a \"standalone\" (my term meaning not composed with other components) component that is comprised of multiple modules, only that generally the language-specific tooling produces a single implementation module and thus is \"componentized\" with that single module. Technically, even these components have more than one module defined in them, but the extra modules are tooling-created to facilitate in the lowering of imports and contain no executable functions. But that's different from having multiple implementation modules.</li>\n</ol>",
        "id": 384012326,
        "sender_full_name": "Peter Huene",
        "timestamp": 1691768152
    },
    {
        "content": "<p>I'll copy my answer to the other thread and continue this there.</p>",
        "id": 384012631,
        "sender_full_name": "Peter Huene",
        "timestamp": 1691768191
    }
]