[
    {
        "content": "<p>Hello folks,</p>\n<p>I am working on a POC of a system (wasmtime backed GitHub actions) that involves downloading files and setting them up on the host. </p>\n<p>The idea is to have a wasmtime(or Spin) based runtime that runs wasm guest components as CLI commands, which perform some of the GitHub action steps. e.g., fetching token from Vault/Tailscale, downloading tools, etc. The advantage is that we can statically define (and audit) the permissions (e.g., outbound hosts, filesystem paths, etc) GitHub actions have, which helps to make them secure. </p>\n<p>While implementing the POC, I was able to download the file, but I couldn't find a function to change that to executable in wasip2. Is that something considered and rejected or something we can discuss and see the viability of adding it to the filesystem WIT in a future release?</p>\n<p>(Also happy to discuss if folks think this is a bad idea).</p>",
        "id": 449816965,
        "sender_full_name": "Rajat Jindal",
        "timestamp": 1720430211
    },
    {
        "content": "<p>Execute permissions aren't universal, e.g. Windows doesn't have an exact equivalent afaik</p>",
        "id": 449858158,
        "sender_full_name": "Lann Martin",
        "timestamp": 1720442646
    },
    {
        "content": "<p>in that case maybe we can just ignore this for windows, and implement for other platform which support it? what would be the right way to collect feedback on such a proposal?</p>",
        "id": 449916925,
        "sender_full_name": "Rajat Jindal",
        "timestamp": 1720455058
    },
    {
        "content": "<p>I think that might be somewhat at odds with the design philosophy of wasi-filesystem, though <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> would be the one to speak to that. In the near term I would suggest adding your own host import, which could be relatively high-level like <code>make-executable</code>.</p>",
        "id": 449917979,
        "sender_full_name": "Lann Martin",
        "timestamp": 1720455324
    },
    {
        "content": "<p>What would be the point of being able to make a file executable from wasi considering that wasi doesn't allow spawning subprocesses anyway?</p>",
        "id": 449937227,
        "sender_full_name": "bjorn3",
        "timestamp": 1720460117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> presumably this would be one step in a CI pipeline where later steps wouldn't (necessarily) use WASI</p>",
        "id": 449938154,
        "sender_full_name": "Lann Martin",
        "timestamp": 1720460448
    },
    {
        "content": "<p>yeah, the use case is to implement secure CI actions, where author of actions specify required permissions, and the runtime enforces those permissions.  With that we can have the required permissions more visible and auditable.</p>",
        "id": 449948127,
        "sender_full_name": "Rajat Jindal",
        "timestamp": 1720462843
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"646597\">Rajat Jindal</span> has marked this topic as resolved.</p>",
        "id": 450079879,
        "sender_full_name": "Notification Bot",
        "timestamp": 1720508213
    }
]