[
    {
        "content": "<p>Has something already documented how the WIT specification will be evolved and versioned?</p>\n<p>I understand wasi wit files tend to have a 0.2.0 version number for now. That's good for their files but I don't know what version of the WIT specification they are built with. What if one wants to document the version of the WIT specification that something is being built against? Do we use a git hash against the WebAssembly/component-model repo? Or maybe a commit hash where the repo's design/mvp/WIT.md was actually updated?</p>\n<p>Is a breaking change ever going to be allowed in the specification's evolution?</p>",
        "id": 436581780,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1714602040
    },
    {
        "content": "<p>Hey, you can find some information regarding WIT versioning <a href=\"https://github.com/WebAssembly/WASI/blob/main/Proposals.md#versioning\">here</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/WASI/blob/main/Proposals.md#versioning\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/06980b9ac8e9da784db653d150720a273e65dbba/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f336639376234306565623961373832623661373661633963393132623362636664653835623934346362306264643238653733616364613636323563316633612f576562417373656d626c792f57415349&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/WASI/blob/main/Proposals.md#versioning\" title=\"WASI/Proposals.md at main · WebAssembly/WASI\">WASI/Proposals.md at main · WebAssembly/WASI</a></div><div class=\"message_embed_description\">WebAssembly System Interface. Contribute to WebAssembly/WASI development by creating an account on GitHub.</div></div></div>",
        "id": 436659582,
        "sender_full_name": "Friedrich Vandenberghe",
        "timestamp": 1714644628
    },
    {
        "content": "<p>Maybe that is specific to the WASI features? The ones that are defined with WIT files? But about the WIT definition itself, I can't find examples of tools or documents that say what version of the WIT spec they are based on. WIT is still being modified I think? Like what are its reserved words, what are the semantics of those reserved words, what are the rules for building one WIT object from other WIT objects in the same or different files and directories.</p>",
        "id": 436663271,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1714646135
    },
    {
        "content": "<p>Currently WIT does not itself have an official version. WASI files are likely going to keep up with the current documentation in the component-model repo, such as using <code>@since</code> and <code>@unstable</code> when they're implemented. It's so early in WIT's lifetime it's pretty doubtful that any guarantee along the lines of \"until the end of time this is frozen\". That being said given the usage of WIT now any breaking change would be accompanied with a transitionary period at the very least.</p>",
        "id": 436674554,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1714650296
    },
    {
        "content": "<p>Thank you for that response. I wish there were a name you and the primary stack holders were comfortable using for the current WIT but I will just go with using the repo name and the date. (I'm sorry if my question seemed to imply I was looking for things to be frozen. I know there is a lot of thought and work going into this area and things will change; that's why I was looking for a versioning or naming convention.)</p>\n<p>Aside from keywords, I'm interested in how a larger project could organize its \".wit\" files and the \"deps\" directories and wasn't sure if the \"deps\" use was part of the WIT specification or just what the tools had come up  with so far to handle type reuse.</p>\n<p>Thanks again.</p>",
        "id": 436678377,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1714651597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"704709\">Frank Rehwinkel</span> has marked this topic as resolved.</p>",
        "id": 436678389,
        "sender_full_name": "Notification Bot",
        "timestamp": 1714651602
    },
    {
        "content": "<p>Oh the frozen bits was referring to your question of if there were going to be breaking changes. Nothing major planned right now, but I can't speak for us-in-six-months.</p>\n<p>For organization the <code>deps</code> folder is pseudo-official sorta. Not fully specified but implemented in wit-parser which many parser pieces use</p>",
        "id": 436682554,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1714653046
    }
]