[
    {
        "content": "<p>Given I want to implement a multi-threaded application in Rust, e.g. with Tokio, where the application is designed to execute functions from stateless (!) Webassembly (WASM) libraries. </p>\n<p>When I have an instance of a WASM library and a first thread which is in train to use it for the execution of a long running function. In this point in time a second thread tries to use the same WASM library's instance. Is that possible and ok or should the instance be protected (locked) in order to ensure single thread access?</p>",
        "id": 412283056,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1704957637
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"595146\">Christoph Brewing</span> has marked this topic as resolved.</p>",
        "id": 412322187,
        "sender_full_name": "Notification Bot",
        "timestamp": 1704972498
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"595146\">Christoph Brewing</span> <a href=\"#narrow/stream/206238-general/topic/.E2.9C.94.20Concurrent.20access.20of.20WASM.20modules.2Fcomponents/near/412283056\">said</a>:</p>\n<blockquote>\n<p>Given I want to implement a multi-threaded application in Rust, e.g. with Tokio, where the application is designed to execute functions from stateless (!) Webassembly (WASM) libraries. </p>\n<p>When I have an instance of a WASM library and a first thread which is in train to use it for the execution of a long running function. In this point in time a second thread tries to use the same WASM library's instance. Is that possible and ok or should the instance be protected (locked) in order to ensure single thread access?</p>\n</blockquote>\n<p>Could you elaborate on this one a little bit more? How did you solve this? I have a similar use-case: my application has a list of files to download and the downloader is written in WASI. I want to make it parallel. Since WASI has no threading yet, I was thinking about running multiple threads in tokio, each using the instantiated module to create a running http request. </p>\n<p>I would have the same problem as you: simultaneous access to the WASM library</p>",
        "id": 416564372,
        "sender_full_name": "mainrs",
        "timestamp": 1705582136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"681848\">@mainrs</span> Sorry for the delay. Here is my reasoning: </p>\n<p>The first thing I noticed was that in order to call any function from a WASM component (I have components, not modules, but should not make any difference) or to even instantiate a WASM component, I need a mutable <strong>Store</strong> (<code>&amp;mut store</code>). My conclusion was that in order to use that in a multi-threaded environment, I would have <strong>one store per WASM component instance</strong> and I would protect both of them, store and corresponding instance, together. In my case, I use a Mutex for protecting both of them as an ensemble.</p>\n<p>This kind of ensemble, Store and component instance, I have it multiple times in my application - as many times as I have worker threads. </p>\n<p>In contrast to this, I just have one <strong>Engine</strong>, one <strong>Config</strong> and one <strong>Linker</strong> in the entire application. </p>\n<p>There was one interesting <strong>\"EUREKA\"</strong> moment during development: In my application, new WASM component instances are created on demand. Thus, it may be the case that multiple instances have to be created at the same time. Due to logical complexity, the instantiation of any of my WASM component takes a few seconds (lots of state being initialized in that time). The first design of the multi-threaded application called <code>Component.from_file()</code> followed by <code>instantiate()</code> each time I needed a new instance. With multiple threads calling for an instantiation at the same time, it took the system quiiiiiite long to handle these calls. I still do not understand the root cause for that. However, at a certain point I started to cache the <code>Component</code> which is returned by <code>Component.from_file()</code> such that each physical .wasm would  have to be compiled once and really only once. The instantiation (<code>instantiate()</code>) itself is quite fast. This change improved the overall system a lot.</p>\n<p>Does this answer help you?</p>",
        "id": 417311604,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1705956045
    },
    {
        "content": "<blockquote>\n<p>With multiple threads calling for an instantiation at the same time, it took the system quiiiiiite long to handle these calls. I still do not understand the root cause for that.</p>\n</blockquote>\n<p>This is almost certainly cranelift compiling your wasm (in <code>Component::from_file</code>). It is quite CPU-intensive so many compilations at once would be quite slow.</p>",
        "id": 417448279,
        "sender_full_name": "Lann Martin",
        "timestamp": 1706017497
    },
    {
        "content": "<p>Agreed, my observation was that the cpu was 100% busy. What surprised me, however, was that each thread returned only after ALL instances were ready. </p>\n<p>For example, compilation + instantiation take 5 s for one instance. When I tried to compile and instantiate 3 instances at the same time, each being processed by a (different) blocking thread on my 4 core machine, each thread returned only after rougly 15 s where I can see absolutely no reason for them to have \"waited\" for one another.</p>",
        "id": 417449197,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1706017756
    },
    {
        "content": "<p><del>Is <a href=\"https://docs.rs/wasmtime/16.0.0/wasmtime/struct.Config.html#method.cache_config_load_default\">caching</a> enabled for your engine?</del></p>\n<p>Actually, maybe this is simpler: cranelift itself uses multiple threads by default, so you would expect 3 identical compilations to complete roughly 3x later than 1 (subject to your OS's scheduler).</p>",
        "id": 417449664,
        "sender_full_name": "Lann Martin",
        "timestamp": 1706017902
    },
    {
        "content": "<p>nope, and I am (was) not aware of its existence. Do you expect this to change things a lot? </p>\n<p>I kind of implemented my own caching, in that is to say, I currently cache compiled components in a separate data structure (map).</p>\n<p>From the short description, I am not sure what it does ..</p>",
        "id": 417450344,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1706018096
    },
    {
        "content": "<p><strong>AHA, your last explanation actually explains what I have observed.</strong><br>\nI did not know that, thank you!</p>",
        "id": 417450487,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1706018144
    },
    {
        "content": "<p><a href=\"https://docs.rs/wasmtime/16.0.0/wasmtime/struct.Config.html#method.parallel_compilation\">https://docs.rs/wasmtime/16.0.0/wasmtime/struct.Config.html#method.parallel_compilation</a></p>",
        "id": 417450692,
        "sender_full_name": "Lann Martin",
        "timestamp": 1706018197
    },
    {
        "content": "<p>Thanks, anyway a great takeaway for any application design with tight timining constraints, I think. To resume this discussion:</p>\n<p>\"Compilation of WASM modules/components takes time and cpu cycles, so one better takes care for it if speed matters\".</p>",
        "id": 417451189,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1706018335
    },
    {
        "content": "<p>Another option you have (which is what wasmtime's caching feature uses internally) is to <a href=\"https://docs.rs/wasmtime/16.0.0/wasmtime/struct.Engine.html#method.precompile_component\">precompile</a> wasm for the target machine. This is significantly harder to orchestrate than <code>from_file</code> but gives you control over exactly when and where compilation happens.</p>",
        "id": 417454139,
        "sender_full_name": "Lann Martin",
        "timestamp": 1706019186
    },
    {
        "content": "<p>That is an interesting point. Well, I would not consider it for the moment since I kind of \"sell\" infrastructure to my company internal customers with rather limited understanding/influence where it might run.</p>\n<p>However, yes, as a general feature, very interesting indeed.</p>",
        "id": 417454451,
        "sender_full_name": "Christoph Brewing",
        "timestamp": 1706019289
    }
]