[
    {
        "content": "<p>I'm working on getting a c# <a href=\"http://lib.rs\">lib.rs</a> for witx-bindgen.  Just started really and have a question about how to use the <code>self.locals</code> .  In lowering I create a local that I need to \"free\" after the call, in the lifting.  I guess I want to use <code>self.locals.insert(\"pinnedArray\");</code> to create the local but how do I get a reference to that in <code>Instruction::ListCanonLift</code> ?</p>",
        "id": 260515333,
        "sender_full_name": "Scott Waye",
        "timestamp": 1636207394
    },
    {
        "content": "<p>I should add that I'm starting with the C implementation, so <code>locals</code> is <code>locals: Ns,</code> in its <code>struct FunctionBindgen&lt;'a&gt; </code> .  I'm new to Rust in general, so not sure what I should be looking for.  I mean some of this code is specific to the C implementation, but the general idea of wanting to use a local in the lowering and lifting I would think is universal.</p>",
        "id": 260515664,
        "sender_full_name": "Scott Waye",
        "timestamp": 1636207785
    },
    {
        "content": "<p>I've just put stuff on <code>self</code> I guess thats ok if there is a new <code>self</code> for every function?</p>",
        "id": 260521510,
        "sender_full_name": "Scott Waye",
        "timestamp": 1636214814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395878\">@Scott Waye</span> I don't think there's much too strict about this, the <code>locals</code> idea was just me trying to make it easier to generate temporary names for variables for languages like C where everything needs to be unique. That's not necessarily required of all generators and it largely depends otherwise on the shape of the code that you're generating and the lanugage that you're generating for (I don't know enough about C# to say anything myself)</p>",
        "id": 260674324,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1636386214
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395878\">Scott Waye</span> has marked this topic as resolved.</p>",
        "id": 260674581,
        "sender_full_name": "Notification Bot",
        "timestamp": 1636386314
    }
]