[
    {
        "content": "<p>It seems that there is often a need to allocate memory in a module from the host environment and then write to that memory.<br>\nHowever, the module can have its own allocator in use and we cannot really make assumptions of how the allocator works.<br>\nIs there a way to allocate memory from host, for example by growing the memory of the module, without messing with a potential allocator?</p>\n<p>The only way at the moment that I can think of is to export the allocator function and call it from the host. Growing the memory could be possible, but that makes the assumption that the wasm allocator will not use the memory that host allocates by growing.<br>\nMaybe in the future multiple memories or similar proposals solve this problem. Hmm.</p>",
        "id": 205962738,
        "sender_full_name": "Risto",
        "timestamp": 1596576254
    },
    {
        "content": "<p>Right now, the best thing to do is to export malloc/free functions. This is the kind of  thing that <a href=\"https://github.com/WebAssembly/interface-types/blob/linking-rebase/proposals/interface-types/Explainer.md\">interface types</a> is being designed to handle well, without making the malloc/free generally visible.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/interface-types/blob/linking-rebase/proposals/interface-types/Explainer.md\" style=\"background-image: url(https://avatars3.githubusercontent.com/u/11578470?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/interface-types/blob/linking-rebase/proposals/interface-types/Explainer.md\" title=\"WebAssembly/interface-types\">WebAssembly/interface-types</a></div><div class=\"message_embed_description\">Contribute to WebAssembly/interface-types development by creating an account on GitHub.</div></div></div>",
        "id": 205962967,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1596576388
    },
    {
        "content": "<p>The way I do it is by exposing wasm_alloc / wasm_free from the VM and calling those from the Host VM.</p>",
        "id": 205962978,
        "sender_full_name": "Alexandru Ene",
        "timestamp": 1596576396
    },
    {
        "content": "<p>Ah, yes. The interface types will probably require that functionality in order to achieve the copying/moving of data from one module to another in the shared-nothing linking case.<br>\nThanks for clearing the way to go at the moment and thanks for referring to the proposal.</p>",
        "id": 205963696,
        "sender_full_name": "Risto",
        "timestamp": 1596576866
    }
]