[
    {
        "content": "<p>How do I get a exported function by name? Rust's got get_typed_func, but I can't find anything similar in the C API. Most of the C examples get externs funcs by index.</p>",
        "id": 237160042,
        "sender_full_name": "MarkJG",
        "timestamp": 1620048401
    },
    {
        "content": "<p>Currently we don't have an equivalent in the C API</p>",
        "id": 237166117,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1620050966
    },
    {
        "content": "<p>one of the main reasons is that we're not ready to commit yet to a stable ABI for functions, so there's no great way to expose this in C right now (that we know of)</p>",
        "id": 237166162,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1620050993
    },
    {
        "content": "<p>Thanks for the response, it's quite alright. I've managed to work around it with wasm_module_exports, just by mapping the externtype names to extern indices. It's a glued on solution but seems to work well enough for now.</p>",
        "id": 237187784,
        "sender_full_name": "MarkJG",
        "timestamp": 1620058824
    },
    {
        "content": "<p>It is actually not a workaround. That's how you need to do it.</p>",
        "id": 237193442,
        "sender_full_name": "Yury Delendik",
        "timestamp": 1620061354
    },
    {
        "content": "<p>Hi Yury. What do you mean?</p>",
        "id": 237211230,
        "sender_full_name": "MarkJG",
        "timestamp": 1620068304
    },
    {
        "content": "<p>I'm not interested in the function's signature if that's what you meant.</p>",
        "id": 237211426,
        "sender_full_name": "MarkJG",
        "timestamp": 1620068381
    },
    {
        "content": "<p>In most of the cases binding by name is inefficient or tricky at runtime.  The C api \"suggest\" that all inefficient stuff will be accomplish during initial linking and indexes are used instead of names later during runtime.</p>",
        "id": 237213049,
        "sender_full_name": "Yury Delendik",
        "timestamp": 1620069094
    },
    {
        "content": "<p>That's what I'm doing. I'm building up a map of name's to extern indices after I load the module binary.</p>",
        "id": 237215888,
        "sender_full_name": "MarkJG",
        "timestamp": 1620070383
    }
]