[
    {
        "content": "<p>In wasmer I can compile a wasm file's bytes and save them to a file. This means I can get super fast startup times after the initial compile on the first run. Is there something similar in wasmtime or does the wasm file need to be compiled each time? Based on the rust docs it doesn't seem like it, but maybe I'm misreading. Thanks!</p>",
        "id": 198981542,
        "sender_full_name": "David Sherret",
        "timestamp": 1590639846
    },
    {
        "content": "<p>In wasmtime you can enable compilation caching by calling <a href=\"https://docs.rs/wasmtime/0.16.0/wasmtime/struct.Config.html#method.cache_config_load_default\">Config::cache_config_load_default</a>.</p>",
        "id": 198981817,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1590640398
    },
    {
        "content": "<p>In the CLI, caching is enabled by default</p>",
        "id": 198981821,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1590640421
    },
    {
        "content": "<p>Oh, I see. Thanks! So this is the config for the engine that's used to create the store and then the module. So I think that means I have to keep around the original .wasm file bytes and let this do the caching for me?</p>",
        "id": 198981958,
        "sender_full_name": "David Sherret",
        "timestamp": 1590640626
    },
    {
        "content": "<p>What would be nice is if I only had to cache and keep around the compiled bytes and throw away the wasm file's bytes. I would like to just say \"here's the compiled bytes... use them\" and do my own caching. If I'm correct that this isn't possible then I think I'll open an issue because I don't see one</p>",
        "id": 198982016,
        "sender_full_name": "David Sherret",
        "timestamp": 1590640742
    },
    {
        "content": "<p>This is something we want to support, yes. We'd like to completely separate compiling and execution in the runtime in such a way that the execution part doesn't have to know where the compiled code comes from.</p>\n<p>There are some open questions around how best to expose this. E.g., should we generate full proper .so files like lucetc does, or something else? And how would we expose this in a way that'd enable the use case you describe, while making the more common case work transparently?</p>",
        "id": 199004320,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1590661057
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1779\">https://github.com/bytecodealliance/wasmtime/issues/1779</a> with an example of how wasmer does it</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/issues/1779\" style=\"background-image: url(https://avatars0.githubusercontent.com/u/54038801?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/issues/1779\" title=\"Ability to get and load compilation result bytes 路 Issue #1779 路 bytecodealliance/wasmtime\">Ability to get and load compilation result bytes 路 Issue #1779 路 bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Feature It would be useful to be able to get the bytes from a compilation result and additionally take bytes from a previous compilation and load them into a module. Benefit This would allow me to ...</div></div></div>",
        "id": 199027222,
        "sender_full_name": "David Sherret",
        "timestamp": 1590675076
    }
]