[
    {
        "content": "<p>I think a typical way for host to pass data into guest is first call an exported <code>alloc</code> to alloc some memory in guest, then copy the data into guest as input. After the host calling some other exported functions to do computations over the input, we can call an exported <code>dealloc</code> to free the input in the guest memory.</p>\n<p>My question is, is it ok that the host does not call the exported <code>dealloc</code>.  Instead, the functions doing those computations take the \"ownership\" of that input in the guest memory (e.g., unsafely wrap those bytes into Vec) to decide free or not. I tried this approach but it seems the guest memory got messed up and errors occurred.</p>\n<p>The reason behind this demand is that those \"computation functions\" may or may not zero-copy the input to output (output still lives in the guest memory). So the host blindly freeing the input memory causes bug.</p>\n<p>The above are under the context of wasmtime Rust API.</p>",
        "id": 490483929,
        "sender_full_name": "Xinyu Zeng",
        "timestamp": 1734946280
    },
    {
        "content": "<p>The details will depend on the guest language but in general it should be fine to pass responsibility for deallocation to the guest.</p>",
        "id": 490531360,
        "sender_full_name": "Lann Martin",
        "timestamp": 1734965300
    },
    {
        "content": "<p>Note that any time the guest executes a <code>memory.grow</code> instruction and grows memory, any pointers the host might have to guest memory might become invalid.  Also, it's quite dangerous to use e.g. <code>Vec::from_raw_parts</code> in the host using a pointer to guest memory; not only can <code>memory.grow</code> invalidate that pointer, but if the <code>Vec</code> is dropped, the host will try to deallocate memory as if it had been allocated by the Rust allocator in the host, which is certainly not the case.</p>\n<p>As others have mentioned elsewhere, it is much better for the host to hold on to the offset into guest memory rather than a pointer.  The host can then turn that offset into a pointer by adding it to the current guest memory base immediately prior to dereferencing it, which avoids the above issues.</p>",
        "id": 490545312,
        "sender_full_name": "Joel Dice",
        "timestamp": 1734970971
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> .  I understand the case. My trick to solve this is first use static strategy to mmap a large enough VM for the instance so the base address does not change. Second, the <code>Vec</code> has a customized allocator which contains an Arc&lt;Instance&gt; and the offset of the data in the guest address space. Upon drop the Vec, it will call an exported func to drop the memory in guest. I feel this is kind of hacky, but it works when I want to use <code>Vec</code> in host to wrap up underlining data zero copied from guest.</p>",
        "id": 490549181,
        "sender_full_name": "Xinyu Zeng",
        "timestamp": 1734972471
    },
    {
        "content": "<p>My take is that Just use offset and call .data[offset] is definitely safe and correct. But it needs some other data structure (a new struct) to wrap up and cannot interoperate with the ordinary Vec well. (i am actually not using Vec but Arrow Buffer, sth like bytes:Bytes)</p>",
        "id": 490550777,
        "sender_full_name": "Xinyu Zeng",
        "timestamp": 1734973124
    }
]