[
    {
        "content": "<p>How should one approach building <a href=\"https://groups.google.com/g/google-guice/c/aDI1lHjUT28\">\"robot legs\"</a>, i.e., multiple instances of the same interface, with the component model? Is it like the aliases in the composed component like in the <a href=\"https://github.com/bytecodealliance/wasm-tools/blob/97b226fb425efd11354b7ec492d0b334a05196b8/crates/wasm-compose/tests/compositions/complex-import/composed.wat\">complex-import example</a>? Or should component developers essentially be building a record factory like <a href=\"https://github.com/WebAssembly/wasi-sql/blob/fd9aa22be6ffe7f99d4f5e4d5cfbe4626305b032/wit/types.wit#L37\">open_connection</a> in wasi-sql... and then the controller of the runtime/linker then have a proxy component that manages connections and forwards requests to various host implementations?</p>",
        "id": 420143142,
        "sender_full_name": "Kristopher Wuollett",
        "timestamp": 1707256707
    },
    {
        "content": "<p>If the interface cannot be statically enumerated then putting the interface behind a <code>resource</code> might be a way to go. That way you'd have a dynamic \"load the interface\" function.</p>\n<p>If you can statically enumerate the interfaces then that's not super well supported right now in the sense that you can't import a WIT interface under multiple names (you'd have to duplicate the interface). That may make sense to use a <code>reosurce</code> and then have static functions returning the resource perhaps</p>",
        "id": 420166574,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1707270596
    },
    {
        "content": "<p>Cool, thanks! I'm catching up again with components, I guess I didn't see <code>resource</code> before. I also somehow just misread that the <code>open_connection</code> returned a <code>connection</code> which is a <code>resource</code> type, and not <code>record</code>.</p>",
        "id": 420169349,
        "sender_full_name": "Kristopher Wuollett",
        "timestamp": 1707272592
    },
    {
        "content": "<p>Are there standard interfaces or patterns for dynamic instantiation of components implementing a specific interface?</p>\n<p>For example (sorry, this is maybe silly) consider a secret store that manages CRUD over secrets, but users upload each \"secret\" as a WASM component that exposes functions like \"getName\" and \"sign(payload)\". This store wants to instantiate each component that's currently stored. Are there standard interfaces for performing this kind of dynamic instantiation from within a wasm component?</p>",
        "id": 429280230,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1711338012
    },
    {
        "content": "<p>Currently components themselves cannot model dynamic instantiation, so in some sense this is a feature not specified in the component model. That being said it's always possible for embedders to have extra support on the host itself to do things like this, so there's nothing precluding it in that respect. It'd be a host convention though as opposed to something codified in a component itself.</p>",
        "id": 429429513,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1711378680
    },
    {
        "content": "<blockquote>\n<p>It'd be a host convention though as opposed to something codified in a component itself.</p>\n</blockquote>\n<p>OK, thanks! I'd imagine there might (someday) be interest in standardizing what this interface looks like (similar to filesystem access -- so a host has to participate, but the interface is consistent across components) But in the near term can explore supporting this ad-hoc.</p>",
        "id": 429494527,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1711395415
    }
]