[
    {
        "content": "<p>In the component model, am I right in understanding that a host's <code>world</code> only needs to expose a superset of the <code>import</code>s of a guest component? Is there any enforcement that a <code>world</code>'s imports also be satisfied by guest components' exports?</p>",
        "id": 418709310,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706558043
    },
    {
        "content": "<p>you're correct in that a host needs to have at least the guests imports but is allowed to have more (it can have a superset)</p>\n<p>There's no relation to a world's imports/exports in the sense that the guests exports are what's available for the embedding to call. The guest is allowed to export more than the host wants, however</p>",
        "id": 418711778,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706559055
    },
    {
        "content": "<p>(sorry not sure if that answers your question)</p>",
        "id": 418711792,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706559061
    },
    {
        "content": "<p>I think it's mostly clear. What I want to make sure to clear up is what the relationship is between a host's imports and a guest's exports.</p>\n<p>Is there any strict requirement to have some form of overlap here?</p>",
        "id": 418711935,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706559139
    },
    {
        "content": "<p>If a host world has an import of <code>imported: func();</code> and the guest has an export of <code>exported: func();</code> these two don't line up.</p>\n<p>It's clear to me that the <code>exported</code> guest export can go unconsumed without issue.</p>\n<p>What's not clear is whether the host's <code>imported</code> import must be fulfilled by the component.</p>",
        "id": 418712340,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706559319
    },
    {
        "content": "<p>No overlap is needed for imports/exports, no. The guest can do whatever it likes with the imports and the host can do whatever it wants with the exports, no need for either to be related</p>",
        "id": 418712635,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706559403
    },
    {
        "content": "<p>the host imports provided to the component may or may not be called if that's what you're asking though, just because a component imports something doesn't mean its needed for any particular export</p>",
        "id": 418712742,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706559443
    },
    {
        "content": "<p>Can the host enforce that a guest component provide a specific export statically in the <code>.wit</code> definition?</p>",
        "id": 418713131,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706559546
    },
    {
        "content": "<p>Yes that's the purpose of the exports of a world, e.g.:</p>\n<div class=\"codehilite\" data-code-language=\"wit\"><pre><span></span><code>world my-world {\n    export foo: func();\n}\n</code></pre></div>\n<p>if a host runs with that world then components must export a function called <code>foo</code> to be loaded correctly</p>",
        "id": 418713539,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706559701
    },
    {
        "content": "<p>OK, that makes a ton of sense. I had a difficult time discovering that when reading <code>WIT.md</code> <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>.</p>",
        "id": 418713866,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706559800
    },
    {
        "content": "<p>I think what I've been finding difficult to internalize with the <code>world</code> concept is that it seems to be trying to describe two contracts in a single paradigm.</p>\n<ol>\n<li>It is trying to describe the host's contract to which guests must adhere if they want to visit that world.</li>\n<li>It is trying to describe the interface for a single WASM Component's imports and exports.</li>\n</ol>",
        "id": 418714634,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560044
    },
    {
        "content": "<p>It seems more like the <code>world</code> is more in tune with the <code>host --&gt; guest</code> relationship; it describes the 'world' in which guests must operate.</p>\n<p>On the other hand, it seems like a Component is really the set of imports it requires and the set of exports it provides.</p>",
        "id": 418715103,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560215
    },
    {
        "content": "<p>indeed! A <code>world</code> itself can be viewed from both the perspective of the guest and the host as well. A host is \"this is what you gotta support\" and a guest is \"this is what you can use\", but it's definitely a bit of a mind-bender</p>",
        "id": 418715123,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706560227
    },
    {
        "content": "<p>I understand that some Components might be designed to act as sorts of proxies (ie: <code>wasm-virt</code>) so perhaps that's where the 'bi-directional' nature of the <code>world</code> comes in...</p>",
        "id": 418715384,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560314
    },
    {
        "content": "<p>But it seems like a proxy component might want to define itself more in terms of two contracts: 1) the host side; and 2) the guest side.</p>\n<p>It seems like the current <code>wit</code> spec tries to lump those into the same definition.</p>",
        "id": 418715614,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560394
    },
    {
        "content": "<p>Definitely feel free to open issues on the component-model repo, in addition to improving the current documentation I'm sure there's changes we could consider at a deeper level too</p>",
        "id": 418715837,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706560467
    },
    {
        "content": "<p>On it.</p>",
        "id": 418715902,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560495
    },
    {
        "content": "<p>Do you think this intuition about the host vs guest side contract makes any sense? I'm very new to this whole world and don't want to derail conversations with uninformed takes.</p>",
        "id": 418716005,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706560537
    },
    {
        "content": "<p>Heh to some degree first impressions always make sense to me, but in general it's definitely something we've struggled with in the past. There's a lot of different users viewing WIT from different angles and it's been tough to balance all the concerns. In that sense it's probably not a silver bullet of how to rewrite everything but at the same time I think it's important feedback of how to shape documentation. Much of it has been written by folks who have their own perspectives that don't match everyone else's, so I think it's valuable to shape it to be better understandable to newcomers</p>",
        "id": 418716488,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706560738
    },
    {
        "content": "<p>Is it fair to say that a host Runtime might specify one or more worlds describing it's capabilities? I think it's intuitive to make sense of what a host _offers_ to guest components.</p>\n<p>On the topic of a Runtime <code>imports</code>, I think _every_ component operating in that world must fulfill these, right? It is not enough for one guest Component among many to satisfy the runtime <code>imports</code>, is it?</p>",
        "id": 418718712,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706561728
    },
    {
        "content": "<p>I'm trying to write down my thoughts and in doing so keep discovering gaps in my understanding. I really appreciate your help filling in these gaps synchronously like this! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 418718883,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706561801
    },
    {
        "content": "<p>You can sort of talk about what a host supports in two ways. One way is that it has multiple possible worlds it support, but you could also union all those worlds together and say that the host supports that one world. I suspect it's more common to say that hosts support multiple worlds, however. For example the <code>wasmtime</code> CLI supports the <code>wasi:cli/command</code> world via <code>wasmtime run</code> and the <code>wasi:http/proxy</code> world via <code>wasmtime serve</code>.</p>\n<blockquote>\n<p>I think _every_ component operating in that world must fulfill these, right?</p>\n</blockquote>\n<p>I think the answer your question is \"no\", but I'm going to say more words here as my understanding may be flawed. For the imports of a world those are items that are provided by the host. Components may or may not use those imports but components don't satisfy the imports by default. You can, however, link components together (e.g. via <code>wasm-tools compose</code>) in which case you would have to satisfy the imports, but that operation is more like connecting the exports of one component into the imports of another.</p>",
        "id": 418719634,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706562099
    },
    {
        "content": "<blockquote>\n<p>For the imports of a world those are items that are provided by the host. Components may or may not use those imports but components don't satisfy the imports by default.</p>\n</blockquote>\n<p>I think I got this backwards <span aria-label=\"man facepalming\" class=\"emoji emoji-1f926-200d-2642\" role=\"img\" title=\"man facepalming\">:man_facepalming:</span> so let me rephrase: \"Is each guest Component that operates in a given <code>world</code> required to provide the <code>exports</code> defined by the union of the Runtime's worlds?</p>",
        "id": 418720121,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562297
    },
    {
        "content": "<p>I was writing out an example with <code>wasi-http</code> and realize that I probably have another gap in understanding. Does a component statically declare the worlds it targets? In other words, a component designed to handle http requests would say, \"I target wasi:http\" and therefore the runtime could then compare its expectations for such components agains the component's _actual_ exports?</p>",
        "id": 418721112,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562629
    },
    {
        "content": "<p>So failing to export a <code>handle()</code> function in the <code>incoming-handler</code> interface would be a link-time error.</p>",
        "id": 418721249,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562691
    },
    {
        "content": "<p>That suggests that runtimes would need _a priori_ knowledge of the worlds that guest components might say they target.</p>",
        "id": 418721383,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562740
    },
    {
        "content": "<p>Or have a mechanism for dynamically dereferencing a world name to that world's definition.</p>",
        "id": 418721474,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562792
    },
    {
        "content": "<p>If all that is true, it makes me think that the world names are significant. I thought it was their _shape_ that is significant but perhaps there is a sort of 'tagged identify' carried by interfaces and functions. Is that true?</p>",
        "id": 418721671,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562871
    },
    {
        "content": "<p>How to packages fit into this whole dynamic? Haha, this is really difficult to wrap my head around.</p>",
        "id": 418721947,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706562971
    },
    {
        "content": "<p>(sorry for the semi-essay)</p>\n<blockquote>\n<p>Is each guest Component that operates in a given world required to provide the exports defined by the union of the Runtime's worlds?</p>\n</blockquote>\n<p>You were right until the word \"union\". For example <code>wasi:http/proxy</code> and <code>wasi:cli/command</code> have different exports. A command is a main function and a proxy is a per-http-request function. Wasmtime supports both so you could technically union the worlds together, but they're for different purposes so a component doesn't actually have to support both to run in wasmtime.</p>\n<p>So I would rephrase what you said as something along the lines of: A component must provide all exports a host requires for a <code>world</code> that it's running. That way a host gets to define which world, if many are supported, is being used (e.g. <code>run</code> vs <code>serve</code>)</p>\n<blockquote>\n<p>Does a component statically declare the worlds it targets?</p>\n</blockquote>\n<p>Sort of and sort of not. When you build a component all current build tooling works by you specify a world in the WIT format and then bindings are generated. The final component, however, does not have WIT embedded. Instead the final component simply has imports, exports, and the types of those imports/exports. This means that a component is self-describing in what it needs and provides (imports and exports) and that may not correspond to any precise world. For example components running in <code>wasi:cli/command</code> may not import all that it has to offer.</p>\n<p>You can see the exact shape of a component in the WIT format with <code>wasm-tools component wit ./my-component.wasm</code>. That will print a WIT rendering of what a component requires. This is given a default name \"root\" but that doesn't actually correspond to what the component was generated with. That's also because as part of the build process worlds might be unioned (e.g. your app might use deps A and B both of which were built with slightly different worlds so your total app is the union of the two, e.g. the union of all that's imported).</p>\n<blockquote>\n<p>So failing to export a handle() function in the incoming-handler interface would be a link-time error.</p>\n</blockquote>\n<p>This is the theory, yes. Component runtimes can statically inspect a component binary and say \"nope I can't run that\". A runtime doesn't have to instantiate the component to make this decision, only parse it. In practice I don't think Wasmtime does this yet with its <code>bindgen!</code> macro, but we should probably add something for that. (it's just an oversight, no fundamental reason for this)</p>\n<blockquote>\n<p>That suggests that runtimes would need _a priori_ knowledge of the worlds that guest components might say they target.</p>\n</blockquote>\n<p>This is again, sort of correct and sort of not. It depends! How fancy is your runtime? Practically, however, you are correct. The <code>wasmtime::component::bindgen!</code> macro for example takes a WIT world as input, which is the a-priori knowledge of what it's targetting. </p>\n<p>I say sort of though because this is not necessarily required. You can technically load a component, reflect on its imports/exports, and then play around with the component anyway. That's more of a debugging-style situation or something like that, but it's not necessarily required. Not statically knowing the world, though, will result in a perf hit.</p>\n<blockquote>\n<p>If all that is true, it makes me think that the world names are significant. I thought it was their _shape_ that is significant but perhaps there is a sort of 'tagged identify' carried by interfaces and functions. Is that true?</p>\n</blockquote>\n<p>This I can safely say is incorrect, or at least in theory. A world's name should not matter, only its shape. This goes back to how components are self-describing in the types of their imports/exports but there's no name corresopnding to the world. We give worlds names to refer to them in bindings generators but that's basically a WIT-level phenomenon which is not reflected into component binaries.</p>\n<blockquote>\n<p>How to packages fit into this whole dynamic?</p>\n</blockquote>\n<p>WIT packages are units of distribution for managing a collection of WIT files. WIT is sort of a layer as a whole DSL in working with components in that sense. Components themselves simply are and there's no concept of a package for components (yet at least). WIT packages are a collection of <code>interface</code>s and <code>world</code>s which are given a name. </p>\n<p>Basically a fancy way of saying that it's just a WIT-level construct to help manage the developer workflow of dealing with WIT dependencies, WIT interfaces, etc.</p>",
        "id": 418722973,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706563405
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span>, that was super helpful. Restating my understanding:</p>\n<p>So the package and world name is only significant at build time as a way of expressing a _target_ for a component or a sort of 'use-case' for a runtime. The target 'world' is a host-specific bit of business logic. For example, in the wasmtime CLI, the command you use comes with an implicit 'world'; the <code>serve</code> command implies the <code>wasm:http</code> reactor world.</p>",
        "id": 418725155,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706564172
    },
    {
        "content": "<p>I've seen quite a few examples of vertical composition between components, where a wrapper or adapter component changes the surface area of a wrapped component. This allows a guest component to potentially operate in a very different world than the one that its own interface suggests.</p>\n<p>But I wonder if there are other kinds of composition being pursued where a single component has different parts of its host expectations fulfilled by distinct host components.</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"n\">Runtime</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"n\">Provider</span><span class=\"w\"> </span><span class=\"mi\">1</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"n\">Guest</span><span class=\"w\"> </span><span class=\"o\">|</span>\n<span class=\"o\">|</span><span class=\"w\">         </span><span class=\"o\">|------------|</span><span class=\"w\">       </span><span class=\"o\">|</span>\n<span class=\"o\">|</span><span class=\"w\">         </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"n\">Provider</span><span class=\"w\"> </span><span class=\"mi\">2</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\">       </span><span class=\"o\">|</span>\n</code></pre></div>",
        "id": 418726199,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706564609
    },
    {
        "content": "<p>Anyway big thanks Alex. I'm going to digest all this and write down my understanding on GitHub.</p>",
        "id": 418728088,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706565385
    },
    {
        "content": "<p>Hey sorry back from a dog walk now!</p>\n<blockquote>\n<p>Restating my understanding:</p>\n</blockquote>\n<p>Looks all correct to me!</p>\n<blockquote>\n<p>This allows a guest component to potentially operate in a very different world than the one that its own interface suggests.</p>\n</blockquote>\n<p>Indeed! One example here would be that you could implement the <code>wasi:http/proxy</code> world in terms of <code>wasi:cli/command</code> technically (aka you write the http server yourself). You'd then take a <code>serve</code>-targetting-component and wrap it and become a <code>command</code>-targetting-component.</p>\n<blockquote>\n<p>But I wonder if there are other kinds of composition being pursued where a single component has different parts of its host expectations fulfilled by distinct host components.</p>\n</blockquote>\n<p>An interesting idea! While I believe the component model affords for this I don't think it's been explored all that much in tooling/runtimes yet. Could be a neat idea though!</p>",
        "id": 418728353,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706565517
    },
    {
        "content": "<p>Hi folks, I've taken a stab at describing the WASM Component / Runtime composition model and how it aligns to the WIT IDL. I intend to post this to the <a href=\"https://github.com/WebAssembly/component-model/issues/274\">discussion on GitHub</a> about renaming the <code>world</code> paradigm but would really appreciate a pre-read.</p>\n<p>I hope to get feedback about whether I'm making false assumptions or other factual inaccuracies. Opinions are of course my own and are _definitely_ coming from the noob perspective.</p>\n<hr>\n<div class=\"codehilite\" data-code-language=\"Markdown\"><pre><span></span><code><span class=\"gh\"># The world of WIT</span>\n\nAs a newcomer to WASM Components and the WIT IDL, I'm trying to understand how I\nshould be using <span class=\"sb\">`.wit`</span> files. Without touching on how these are expressed in\nWIT, I can think of several use-cases listed below. I'm trying to approach this\nfrom a composition perspective.\n\n<span class=\"k\">1.</span> As a host, what capabilities do I offer to guests?\n<span class=\"k\">2.</span> As a host, what requirements do I impose on guests?\n<span class=\"k\">3.</span> As a guest, what requirements must my host fulfill?\n<span class=\"k\">4.</span> As a guest, what capabilities do I expose to the host (and possibly to other\n   guests)?\n\nNow, you'll note that I didn't mention Component or Runtime above. It's my\nunderstanding that a Runtime will <span class=\"ge\">_always_</span> be acting as a host and will <span class=\"ge\">_never_</span>\nbe a guest. On the other hand, Components <span class=\"ge\">_may_</span> act as a host, but will <span class=\"ge\">_always_</span>\nbe guests.\n\nI also didn't mention any particular syntactical constructs. I'm trying to\nunderstand the use-cases in the abstract before looking at how they're expressed\nin the WIT IDL.\n\n<span class=\"gu\">## Component composition and ecosystems</span>\n\nGiven what we've explored above, I think it is helpful to see that a Runtime\nmust express a <span class=\"gs\">**Host Contract**</span> and that a Component must express a **Guest\nContract** as well as an optional <span class=\"gs\">**Host Contract**</span>. These are described below.\n\nBut while the Host Contract and Guest Contract help organize our thoughts about\nvertical composition, I think they are missing the ecosystem angle. What I think\nwe're still missing is (4) from the original list: <span class=\"ge\">_Guest Capabilities_</span>.\n\nI think it's reasonable to expect folks to start building out an ecosystem of\nre-usable WASM Components that fulfill specific needs. In that way, we can think\nof such Components as traditional libraries / modules / packages / etc. These\nComponents encapsulate some logic and expose that through their API as _Guest\nCapabilities_. This is functionality that is being put out there for anyone to\nconsume, if they so chose. There is <span class=\"ge\">_no requirement_</span> made about how it is used.\nThey are provided as is and it is up to consumers to decide how they should be\nwired up.\n\nSo with that, I think we've got our third required concept, bringing us to the\nfollowing:\n\n<span class=\"k\">-</span><span class=\"w\"> </span><span class=\"gs\">**Host Contract**</span> The minimum set of exported capabilities that a host\n  enforces upon its guests. In <span class=\"sb\">`wasi:http`</span>, this would be\n  <span class=\"sb\">`incoming-handler.handle()`</span>. In <span class=\"sb\">`wasi:cli`</span>, this would be <span class=\"sb\">`run.run()`</span>. In the\n  former case, <span class=\"sb\">`wasmtime serve`</span> requires a guest Component to provide the\n  <span class=\"sb\">`handle()`</span> method. In the latter case, <span class=\"sb\">`wasmtime run`</span> requires a guest\n  Component to provide the <span class=\"sb\">`run()`</span> method.\n<span class=\"k\">-</span><span class=\"w\"> </span><span class=\"gs\">**Guest Contract**</span> The minimum set of importable capabilities that a guest\n  requires from its host. In other words, a guest Component that needs to\n  perform file I/O will require capabilities from its host or it just can't do\n  its job.\n<span class=\"k\">-</span><span class=\"w\"> </span><span class=\"gs\">**Guest Capabilities**</span> The set of capabilities a Component offers to consumers\n  with no assertions made about how they are used. An example of this might be a\n  pseudo-random number generator Component. It might expose a <span class=\"sb\">`seed()`</span> method\n  that may (or may not) be called and a <span class=\"sb\">`random()`</span> method to get the next\n  pseudo-random number.\n\n<span class=\"gu\">## Wrap up</span>\n\nSo with that huge wall of text out of the way, what does this say about the\ncurrent WIT IDL? I think my main take-away is that the <span class=\"sb\">`world`</span> paradigm is\ntrying to express all three of the above concepts simultaneously and ends up not\nquite nailing it on any of them.\n</code></pre></div>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/component-model/issues/274\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/904dd126387d79880c85cbe58d748951962c5fbd\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f316134333736326230343664623330363463326132353232636162306437396236346630323131306365393235643266333433343632376530303861313539342f576562417373656d626c792f636f6d706f6e656e742d6d6f64656c2f6973737565732f323734)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/component-model/issues/274\" title=\"Consider renaming `world` to `component` · Issue #274 · WebAssembly/component-model\">Consider renaming `world` to `component` · Issue #274 · WebAssembly/component-model</a></div><div class=\"message_embed_description\">In Wit, a \"world\" corresponds to a component. This took me too long to grasp, because \"world\" is a strange word for it. \"World\" has a notion of expanse, plurality, whole. Intuitively, it doesn't re...</div></div></div>",
        "id": 418873179,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706631358
    },
    {
        "content": "<p>Tweaked and shared here: <a href=\"https://github.com/WebAssembly/component-model/issues/274#issuecomment-1917583732\">https://github.com/WebAssembly/component-model/issues/274#issuecomment-1917583732</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/component-model/issues/274#issuecomment-1917583732\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/8b412c04db8dce3f0988367afc789b59e33744b8\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f376337656464346661666162393166626264356366366163653131323865396431633562613565303332663332366663373563633038353334613631343263622f576562417373656d626c792f636f6d706f6e656e742d6d6f64656c2f6973737565732f323734)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/component-model/issues/274#issuecomment-1917583732\" title=\"Consider renaming `world` to `component` · Issue #274 · WebAssembly/component-model\">Consider renaming `world` to `component` · Issue #274 · WebAssembly/component-model</a></div><div class=\"message_embed_description\">In Wit, a \"world\" corresponds to a component. This took me too long to grasp, because \"world\" is a strange word for it. \"World\" has a notion of expanse, plurality, whole. Intuitively, it doesn't re...</div></div></div>",
        "id": 418891419,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1706637229
    },
    {
        "content": "<p>Thanks for writing up your thoughts on this!</p>",
        "id": 418905155,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706642621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"680230\">@Geoff Goodman</span> this is wonderful (also with Alex and everyone). I also can't make any sense of it, so I'll pick up the thread. The reason? \"world\" already makes sense to me, so likely I'm missing something.</p>",
        "id": 419004060,
        "sender_full_name": "Ralph",
        "timestamp": 1706695228
    }
]