[
    {
        "content": "<p>Is there a table/quick-reference of what component model type corresponds to what core wasm type? I'm finding it difficult to navigate the ABI <a href=\"https://github.com/WebAssembly/component-model/blob/main/design/mvp/Explainer.md#canonical-abi\">explainer</a> and <a href=\"https://github.com/WebAssembly/component-model/blob/main/design/mvp/CanonicalABI.md\">reference</a> for that info.</p>",
        "id": 419764453,
        "sender_full_name": "IFcoltransG",
        "timestamp": 1707108643
    },
    {
        "content": "<p>For example, I know strings can be taken as input with <code>[i32 i32] -&gt; ...</code> (pointer and length respectively) with a <code>realloc</code> and <code>memory</code>, but when a string is returned as output, it seems to validate it as <code>... -&gt; [i32]</code> which confused me.</p>",
        "id": 419764658,
        "sender_full_name": "IFcoltransG",
        "timestamp": 1707108838
    },
    {
        "content": "<p>The <code>CanonicalABI.md</code> reference is the source of truth which is where you'll be able to primarily resolve these sorts of questions (I don't disagree it's difficult to parse, however).  You can explore lowerings from concrete signatures to wasm signatures with <code>wasm-tools component embed --dummy ./foo.wit -t</code> where you'll model the component model signature in <code>foo.wit</code> and then the output core wasm will have the signatures per function. This doesn't explain the meaning of each signature, however.</p>\n<p>One option would also be to use a bindings generator to study the output code. For example <code>wit-bindgen rust ./foo.wit</code> will generate code for component model signatures modelled as WIT and you might be able to discover more of what each parameter means that way.</p>",
        "id": 419854877,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1707144202
    },
    {
        "content": "<p>Thank you for those suggestions, I'll look into the tools and try to put together a resource that works better for me (and share it if possible).</p>",
        "id": 419920944,
        "sender_full_name": "IFcoltransG",
        "timestamp": 1707164262
    }
]