[
    {
        "content": "<p>Is there any documentation giving details about how the actual epoch injection takes place? IE at what stages and how?</p>\n<p>Thanks!</p>",
        "id": 490247092,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734739125
    },
    {
        "content": "<p>This method is the only one that updates the epoch: <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Engine.html#method.increment_epoch\">https://docs.rs/wasmtime/latest/wasmtime/struct.Engine.html#method.increment_epoch</a></p>",
        "id": 490248522,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734740088
    },
    {
        "content": "<p>that links to the docs on the config option, which covers the whole flow of methods to call and what happens when</p>",
        "id": 490248572,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734740126
    },
    {
        "content": "<p>I meant how is the code instrumented. I'm under the impression that code to \"check\" the epoch is added? How does that process work? The API documentation is quite good I'm just trying to understand whats going on under the hood.</p>",
        "id": 490248699,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734740211
    },
    {
        "content": "<p>Yes, that's right, we insert checks -- they happen at loop backedges and at function entry</p>",
        "id": 490248745,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734740262
    },
    {
        "content": "<p>we don't document the \"how\" in the public docs because it's an internal implementation detail, but basically: we load the current epoch and the deadline from memory and compare, branching to a call back into the runtime (that subsequently traps or async-yields) if the deadline's exceeded</p>",
        "id": 490248829,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734740313
    },
    {
        "content": "<p>current epoch is an atomic <code>u64</code>; and <code>increment_epoch</code> is an atomic increment, nothing more, which is how we made it signal-safe and thread-safe</p>",
        "id": 490248864,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734740352
    },
    {
        "content": "<p>Okay thanks!</p>\n<p>At what point are the checks injected? At compile time?</p>",
        "id": 490249373,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734740761
    },
    {
        "content": "<p>Yes; there would be no way to inject them later, as we don't do runtime code patching</p>",
        "id": 490249783,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734741088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> do you think it makes sense to add this documentation to the <code>increment_epoch()</code> or maybe <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Config.html#method.epoch_interruption\"><code>Config::epoch_interruption</code></a> might be the better place since there's a decent chunk of documenation there.</p>\n<p>If so, <span class=\"user-mention\" data-user-id=\"730457\">@Nicholas Renner</span> would you mind adding the documentation you would have <em>wanted to see</em> to <code>wasmtime</code>?</p>",
        "id": 490260309,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1734750450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"598440\">@Victor Adossi</span> I don't think it really makes sense to put in the public API documentation -- the question was \"how did we implement it\" and we generally don't put implementation details in public docs (as it's irrelevant to the audience that only wants to use wasmtime). Perhaps in the architecture doc somewhere (<code>docs/contributing-architecture.md</code>)?</p>",
        "id": 490273778,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734763692
    },
    {
        "content": "<p>I had some more specific questions, still trying to understand some of this:</p>\n<ol>\n<li>does the code injection happens at wasm level (i.e. injected as wasm byte code), or at native code level (injected as native instruction on cwasm)?</li>\n<li>which approach is used to transfer the control to runtime? Using a function call (i.e. if check passed, just do a normal function callback)? Or raising a trap and let trap handler to handle it?</li>\n<li>If the code injection happens at wasm level, is there way to output the epoch transformed wasm file?</li>\n</ol>",
        "id": 490336045,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734820494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"730457\">@Nicholas Renner</span> have you looked into the implementation? It might be more efficient to read the code if you have specific questions about how this works. Grep for <code>epoch_interruption</code> and go from there; <code>crates/cranelift/</code> contains the Wasm-to-CLIF translator. (It would also help us to know whether you have already read the code and are still unsure, or if these questions are your starting point, to calibrate level of detail.)</p>\n<p>It would also help to know to what end these questions are directed -- are you trying to build a feature that integrates with this? Understand performance implications? Other?</p>\n<p>That said: injection is not exactly either of your options -- we do not inject Wasm bytecode, and we do not edit the cwasm or operate after the compiler. Rather we inject compiler IR when we translate the Wasm to CLIF. Control is passed to the runtime via a Wasm-to-host call; yielding occurs via our async mechanism that does stack switching (see the \"fiber\" crate).</p>",
        "id": 490337147,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734821571
    },
    {
        "content": "<p>might be worth adding <span class=\"user-mention\" data-user-id=\"730457\">@Nicholas Renner</span> that - while you cannot output the WASM with epoch instrumentation as WASM - you <em>can</em> output the clif IR <a href=\"https://docs.wasmtime.dev/api/wasmtime/struct.Config.html#method.emit_clif\">https://docs.wasmtime.dev/api/wasmtime/struct.Config.html#method.emit_clif</a> in case you want to just look at it or study its impact on code behavior or something</p>",
        "id": 490415770,
        "sender_full_name": "Jonas Kruckenberg",
        "timestamp": 1734898625
    },
    {
        "content": "<p>Thanks all,</p>\n<p>Yeah, I'm still coming in somewhat blind. I mostly wanted to be pointed to the sections in the implementation to start looking at so thanks for that. I'm building something that uses asyncify with wasmtime for our project's use, I know thats pretty out of scope for wasmtime in general, but was trying to find some information to see how epochs would interact with the asyncify mechanisms.</p>",
        "id": 490420902,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734903738
    },
    {
        "content": "<p>Ah! That's a much more specific and easily-answerable question: epoch interruption should not interfere with Wasm semantics at all, including Wasm semantics utilized by asyncify. It operates one level down, invisible to the Wasm execution: we basically split the execution into pieces each of which runs in one future-poll invocation in the Wasmtime host-side async interface.</p>\n<p>Integration between what guest code calls \"async\" and what host code calls \"async\" is a much deeper question, and one that is unrelated to epoch interruption: that veers into WASI 0.3 and async work around component interfaces (talk to <span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> about that one)</p>",
        "id": 490423167,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734905968
    },
    {
        "content": "<p>(said more briefly: if what you're looking for is to reflect async details in the guest into the host side, epoch interruption is not what you want -- it serves a different purpose)</p>",
        "id": 490423264,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1734906040
    },
    {
        "content": "<p>Great, thank you very much for the responses. Going to take some time to look this over and may have some more questions, but this was super helpful!</p>",
        "id": 490436354,
        "sender_full_name": "Nicholas Renner",
        "timestamp": 1734918452
    }
]