[
    {
        "content": "<p>Hi, sorry if this is off-topic.</p>\n<p>Will the ByteCode Alliance be taking part in Google Summer of Code 2024? I would love to get involved in the WebAssembly community and start contributing. I also like the idea of a committed mentee-mentorship partnership aiming to complete a project, which is provided by the GSoC framework.</p>\n<p>Kind Regards, Max :)</p>",
        "id": 407805903,
        "sender_full_name": "Max Coetzee",
        "timestamp": 1702499933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"421591\">@Bailey Hayes</span> this sounds like a great place to appear</p>",
        "id": 408680650,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1702930222
    },
    {
        "content": "<p>That would be really wonderful. We'd need a volunteer to head this up. I believe it involves applying as an org first and then we would also need a group willing to mentor and sponsor a project.</p>",
        "id": 409453953,
        "sender_full_name": "Bailey Hayes",
        "timestamp": 1703187649
    },
    {
        "content": "<p>FWIW, in spring 2021 I put together an application for GSoC on behalf of BA; unfortunately we were not selected, but I can say at least that the effort on our end was ~1 working day to collect ideas and write up the application.</p>\n<p>There's still an old issue with a few project ideas for Wasmtime, some of which may still be relevant (and I'd have to imagine a bunch of project ideas now exist with the component-model work): <a href=\"https://github.com/bytecodealliance/wasmtime/issues/2667\">https://github.com/bytecodealliance/wasmtime/issues/2667</a></p>\n<p>I'm on parental leave now so I can't lead any 2024 application but personally I think it could be worthwhile re-applying, perhaps taking a bit more time to understand what they're looking for; unfortunately there was no feedback on the rejection before</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/issues/2667\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/32cf24613ada1ba5db1d45bda0a7cf2fbca56256\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f343039366161336436353238333234653461656232346435306439343433306236616164626332653962636630373635393565373130386332353833663363622f62797465636f6465616c6c69616e63652f7761736d74696d652f6973737565732f32363637)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/issues/2667\" title=\"Meta-issue: GSoC project ideas 路 Issue #2667 路 bytecodealliance/wasmtime\">Meta-issue: GSoC project ideas 路 Issue #2667 路 bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">We are planning to apply to Google Summer of Code; let's brainstorm projects that might be interesting! I'll start with a few and can update as ideas come in: Language bindings for Wasmtime engine:...</div></div></div>",
        "id": 409497197,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1703209236
    },
    {
        "content": "<p>Hello,</p>\n<p>This is follow up  question based on above discussion. I am trying to build a project that aims to use Wasmtime and Cranelift as dependencies. I would like to contribute more to these projects in order to understand things in deeper levels. If Bytecode Alliance is participating in GSoC 2024 then I would love to contribute and develop a healthy mentee-mentorship partnership. Is there any update regarding this? </p>\n<p>Thank you,<br>\nRiya</p>",
        "id": 412128215,
        "sender_full_name": "Riya Bisht",
        "timestamp": 1704888800
    }
]