[
    {
        "content": "<p>I see that with WAC you can compose two WASM components together into a single binary. But what if for example, I'm creating a sandboxed scripting engine for game where user-created scripts? In this case, I don't necessarily want the user to have the main game binary or more importantly, have to pack it into their binary and include the entire game when it's executed at runtime where the main game WASM should already be there and it should be interacting with the memory space of the main game module, and perhaps don't even have access to system calls / io? </p>\n<p>I see that you can define imports for wasm components using Wasmtime in Rust (<a href=\"https://docs.wasmtime.dev/api/wasmtime/component/bindgen_examples/index.html\">https://docs.wasmtime.dev/api/wasmtime/component/bindgen_examples/index.html</a>), but that seems to require manually defining import bindings and calling the other module, essentially having to link it myself manually through bindings in code. Is there some way to link at runtime with Wasmtime? How do I automatically link the two and allow it to say, access resources and records from the other WASM module at runtime?</p>",
        "id": 470993258,
        "sender_full_name": "Troy Edwards",
        "timestamp": 1726582106
    },
    {
        "content": "<p>It's perhaps worth noting that wasm components represent a sealed boudary between each other. A component can't tamper with the memory space of any other component, so if two components are composed together with <code>wac</code> then the two components can't tamper with each other as they're constrained by the component model APIs they're using to communicate with each other. In that sense you wouldn't have to worry about a user script interfering with another component.</p>\n<p>When working with imports/components at runtime you don't have prior static information about you'll want to use the \"untyped\" APIs. This will involve some reflection on the component at hande and using APIs such as <a href=\"https://docs.rs/wasmtime/latest/wasmtime/component/struct.LinkerInstance.html#method.func_new\"><code>Linker::func_new</code></a> and <a href=\"https://docs.rs/wasmtime/latest/wasmtime/component/struct.Func.html#method.call\"><code>Func::call</code></a></p>",
        "id": 471008507,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1726585375
    },
    {
        "content": "<p>I wonder if WASI is capable to support true plugin-at-runtime. That is I want to allow each user to choose different set of plugins at runtime, download them from OCI at runtime and instantiate them. Multiple instances, which implement the same WASI interface. All of that as guest component, not by wrapping (wasmtime) host.</p>\n<p>So I guess we need <br>\n1) host API which would do the instantiation<br>\n2) some way how to dispatch otherwise \"static\" method call to different component instance. Maybe some component virtualization.</p>",
        "id": 471180459,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1726641616
    },
    {
        "content": "<p>I believe that comes with preview 3, but I defer to those who have actual knowledge instead of pretend knowledge.</p>",
        "id": 471200469,
        "sender_full_name": "Ralph",
        "timestamp": 1726648184
    },
    {
        "content": "<p>AFAIK, there are no concrete plans to support runtime code loading in an official way (neither in preview 3 nor beyond), although you can always do it in a custom host embedding.  For example, <a href=\"https://github.com/rylev/wepl\">https://github.com/rylev/wepl</a> demonstrates loading a component dynamically and invoking its exports.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/rylev/wepl\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/f666ddcff78f8b4c9a65b32d45dd1c6b722ae975/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f636662383832326439396535326334623532363463323639653230656235393262373232663432643733386230343437653537343139643363366238396434632f72796c65762f7765706c&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/rylev/wepl\" title=\"GitHub - rylev/wepl: A repl for WebAssembly Components\">GitHub - rylev/wepl: A repl for WebAssembly Components</a></div><div class=\"message_embed_description\">A repl for WebAssembly Components. Contribute to rylev/wepl development by creating an account on GitHub.</div></div></div>",
        "id": 471260052,
        "sender_full_name": "Joel Dice",
        "timestamp": 1726666221
    },
    {
        "content": "<p>Ralph might be thinking of Luke Wagner's suggestion in the WASI/database pooling thread of looking at runtime module instantiation between Preview 3 and the first WASI release candidate. I imagine loading new code at runtime would have extra challenges on top of that.</p>",
        "id": 471347011,
        "sender_full_name": "IFcoltransG",
        "timestamp": 1726692968
    },
    {
        "content": "<p>Yeah, the \"runtime instantiation\" feature Luke was talking about would only allow instantiating statically-known components AFAIK.  It wouldn't necessarily allow a guest to e.g. download a component on the fly and instantiate it.</p>",
        "id": 471348924,
        "sender_full_name": "Joel Dice",
        "timestamp": 1726693754
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"509936\">Joel Dice</span> <a href=\"#narrow/stream/206238-general/topic/recvmmsg.20.2F.20sendmmsg/near/471348924\">said</a>:</p>\n<blockquote>\n<p>Yeah, the \"runtime instantiation\" feature Luke was talking about would only allow instantiating statically-known components AFAIK.  It wouldn't necessarily allow a guest to e.g. download a component on the fly and instantiate it.</p>\n</blockquote>\n<p>I think you might be in the wrong thread :)</p>",
        "id": 471349882,
        "sender_full_name": "Colin Marc",
        "timestamp": 1726694197
    },
    {
        "content": "<p>2 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"206238\" href=\"/#narrow/stream/206238-general/topic/recvmmsg.20.2F.20sendmmsg\">#general &gt; recvmmsg / sendmmsg</a> by <span class=\"user-mention silent\" data-user-id=\"509936\">Joel Dice</span>.</p>",
        "id": 471350353,
        "sender_full_name": "Notification Bot",
        "timestamp": 1726694447
    }
]