[
    {
        "content": "<p>Recently I've been playing around with Interface Types using wit-bindgen and this already works pretty well with a Rust host and Rust module. However, it seems like wit-bindgen does not support assemblyscript as an output option.</p>\n<p>Looking through GitHub, I found <a href=\"https://github.com/jedisct1/witx-codegen\">https://github.com/jedisct1/witx-codegen</a>, which seems to attempt to generate Interface Type compatible assemblyscript from witx description files, but that didn't seem particularly helpful to me since it doesn't provide bindings like <code>canonical_abi_realloc</code> and thus the generated files only help with the type conversion.</p>\n<p>So I'm curious if anyone has experience and maybe shareable examples of how Interface Types can be used in assemblyscripts today. Is the best practice to use witx-bindgen to generate the conversion code? If so, where do people get the other functionality from (<code>canonical_abi_*</code>), do I have to write this myself?</p>\n<p>I have no problem with converting pointers to Assemblyscript types by hand, like witx-bindgen tries to do for some types already. But I struggle with implementing the surrounding infrastructure like <code>canonical_abi_*</code> stuff since documentation for this seems sparse.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/jedisct1/witx-codegen\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/c7b34966a1e5a5f97524530b9a95df2a3d6c2295\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f636363336464343936303666303431643164616164333831633561303662613864623737393366323836316465306238613636343739646664653565306362362f6a656469736374312f776974782d636f646567656e)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/jedisct1/witx-codegen\" title=\"GitHub - jedisct1/witx-codegen: WITX code and documentation generator for AssemblyScript, Zig, Rust and more.\">GitHub - jedisct1/witx-codegen: WITX code and documentation generator for AssemblyScript, Zig, Rust and more.</a></div><div class=\"message_embed_description\">WITX code and documentation generator for AssemblyScript, Zig, Rust and more.  - GitHub - jedisct1/witx-codegen: WITX code and documentation generator for AssemblyScript, Zig, Rust and more.</div></div></div>",
        "id": 281683206,
        "sender_full_name": "Christian Dürr",
        "timestamp": 1652102560
    }
]