[
    {
        "content": "<p>Howdy, folks! I figured the easiest way to disseminate this information broadly would be to post about it here in Zulip.</p>\n<p>On April 19th, I'll be leaving Fastly to pursue another opportunity that is outside of the WebAssembly ecosystem; I'll be joining a research hospital to work on a new genomics platform implemented in Rust. As such, I'll be winding down my involvement in BA repositories.</p>\n<p>I'll ensure as much of a smooth transition as possible for repos like <code>cargo-component</code>, <code>wac</code> (which will hopefully move to the BA before then), <code>wasmtime-dotnet</code>, etc. I'll still be on Zulip and generally around to impart knowledge (and perhaps fix a bug on occasion <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span>), but my day-to-day will be spent elsewhere.</p>\n<p>I want to thank everyone that's been involved with the BA and contributed to the growth of wasm over these past few years; it's been my distinct honor to work on such an important technology with some of the most talented (and without a doubt the most genuinely awesome) human beings around.</p>\n<p>Outside of Zulip, you'll be able to reach me at <a href=\"mailto:peter@huene.dev\">peter@huene.dev</a>. Thanks!</p>",
        "id": 430630554,
        "sender_full_name": "Peter Huene",
        "timestamp": 1711991244
    },
    {
        "content": "<p><em>looks at calendar</em> oh right, perhaps not the right day for an announcement</p>",
        "id": 430630741,
        "sender_full_name": "Peter Huene",
        "timestamp": 1711991304
    },
    {
        "content": "<p>Thanks for all of your outstanding work, Peter! It was really fun to work with you, and you should be very proud of your success here. All the best in your new pursuit!</p>",
        "id": 430636316,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1711993605
    },
    {
        "content": "<p>I'm really sad to hear of your leaving, but excited for you and your future work! It sounds like a really great next adventure. You will certainly be missed.</p>\n<p>I'm wondering what your thoughts are on how to transition further development of the projects you've been stewarding. It seems that getting folks to take over bug fixing responsibilities shouldn't be too difficult. However, transferring an understanding of a roadmap or vision for where the projects should go in the medium and long term sounds much more difficult. Not to mention that there are parts of some codebases (e.g., <code>wac-resolver</code>) that are certainly not trivial to get into.</p>\n<p>In short, I'm happy to help however I can!</p>",
        "id": 430739820,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1712047134
    },
    {
        "content": "<p>Thanks, Ryan. I will be available to pair to walkthrough the source, if you like. I'll also tag you on big internals change for <code>wac</code> that I'll have a PR up shortly.</p>",
        "id": 430850534,
        "sender_full_name": "Peter Huene",
        "timestamp": 1712082797
    }
]