[
    {
        "content": "<p>Hi all -- a few of us were discussing how we might improve on our current state, where we put meeting agendas and minutes in the <code>meetings/</code> subdirectory of the wasmtime repo.</p>\n<p>The issue that came up is that as we were discussing various CI gating mechanisms, it became increasingly clear that (i) we don't want to waste CI time on a <code>meetings</code>-only change, but (ii) it is hard or impossible to special case subdirectories with many gating mechanisms.</p>\n<p>The cleanest solution is probably to separate out the <code>meetings/</code> subdirectory into a <code>meetings</code> repo in the BA GitHub org. This keeps separate things separate, which makes policy simpler.</p>\n<p>Does anyone have any objections to this, or other suggestions?</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span></p>",
        "id": 288584086,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1657050723
    },
    {
        "content": "<p>So I've discovered that I can't create a repo named <code>meetings</code> under the BA org (presumably already exists and is private); anyone have better suggestions for name? <code>project-meetings</code> maybe?</p>",
        "id": 288591331,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1657054753
    },
    {
        "content": "<p>I can see the <code>meetings</code> repo and it's quite small with just 5 commits and no recent activity, so I'll see if it can be renamed</p>",
        "id": 288591494,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1657054850
    },
    {
        "content": "<p>checking with the owners I guess? thanks!</p>",
        "id": 288591561,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1657054888
    },
    {
        "content": "<p>ok the <code>meetings</code> name should now be open if you'd like to try again <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span></p>",
        "id": 288591904,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1657055060
    },
    {
        "content": "<p>OK, repo now exists, and by the magic of <code>git filter-repo --subdirectory</code>, it contains the full commit history of <code>meetings/</code></p>",
        "id": 288592083,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1657055165
    },
    {
        "content": "<p>I'll do a PR to delete that from <code>wasmtime</code> now</p>",
        "id": 288592106,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1657055181
    }
]