[
    {
        "content": "<p>is the JIT memory-safe?</p>",
        "id": 485730711,
        "sender_full_name": "Soni L.",
        "timestamp": 1733185149
    },
    {
        "content": "<p>Can you clarify what you mean? Memory-safe with respect to what API or action?</p>",
        "id": 485734198,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733187572
    },
    {
        "content": "<p>In general, you can JIT-compile code that loads or stores to any memory address, so if you <em>invoke</em> that code, the answer is necessarily \"no\". However the invocation itself is unsafe; if you consider the compiler itself as some abstract function from IR to machine-code bytes, <em>that</em> API is fully safe; it's \"just\" a computation.</p>",
        "id": 485734308,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733187626
    },
    {
        "content": "<p>so why not maintain memory safety all the way from the frontend down to the assembler. in particular, applying optimizations while maintaining memory safety.</p>",
        "id": 485734673,
        "sender_full_name": "Soni L.",
        "timestamp": 1733187889
    },
    {
        "content": "<p>(like yeah you can't maintain memory safety in the machine code layer, but you should be able to in every other layer above that including the assembler)</p>",
        "id": 485734835,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188005
    },
    {
        "content": "<p>(tho, using this definition of memory safety, we can say that there are no memory-safe programming languages today)</p>",
        "id": 485734882,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188043
    },
    {
        "content": "<p>I'm not really sure what you mean. I've worked on formal verification of Cranelift; are you talking about translation validation? Are you talking about memory safety of the compilation process itself? It would be useful to understand what you are thinking when you say \"memory safety\"; it's not just a buzzword, it is a nuanced term that can mean different things in different contexts.</p>",
        "id": 485735330,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733188387
    },
    {
        "content": "<p>well, ultimately memory safety comes from typing and constraint checking. so, we should maintain full typing all the way from the frontend down to the assembler. no compiler we know of does this today.</p>",
        "id": 485735457,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188484
    },
    {
        "content": "<p>ofc, it may be necessary to peel layers off types while dealing with some of those lower-level constructs, but the relevant passes, the assembler, etc should still be able to constraint check the entire thing.</p>",
        "id": 485735560,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188559
    },
    {
        "content": "<p>OK, you're talking about type-preserving compilation. Yes, that'd be really neat. As I'm sure you're aware, it's a research challenge, especially if you want a formal proof (even in a translation-validation sense, i.e., a witness object for one compilation as opposed to a forall-proof ahead of time) of the correspondence.</p>",
        "id": 485735665,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733188619
    },
    {
        "content": "<p>You'd also probably want something like dependent typing, or at least refinement typing, to encode invariants that JIT producers routinely make use of -- once you lock the hatches and say everything must be typesafe, you need a way to put all the system invariants in the types</p>",
        "id": 485735717,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733188662
    },
    {
        "content": "<p>I'd welcome you to study this, produce a set of solutions, and write the three PhD theses that would result from all of the ideas necessary to make it practical :-)</p>",
        "id": 485735792,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1733188691
    },
    {
        "content": "<p>peeling the type layers is usually done with <code>unsafe</code> in rust, where you translate (e.g. transmute) one set of types into a different set of types, each enforcing the constraints in different ways (this is often done with e.g. lifetimes)</p>",
        "id": 485735859,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188775
    },
    {
        "content": "<p>but yes we understand that's an escape hatch</p>",
        "id": 485735947,
        "sender_full_name": "Soni L.",
        "timestamp": 1733188817
    }
]