[
    {
        "content": "<p>Wasmtime and some other runtimes support multiple memories, but it seems that there are limited ways to utilize them.<br>\nIn C some systems seem to support the use of address_space attribute to indicate in which memory buffers of memory exist in, however that is not supported by clang for wasm yet at least. Such would enable to indicate directly in C code how to operate with the memories.</p>\n<p>Are there currently some higher-level languages or other ways to use multiple memories that someone knows?<br>\nThe only approaches I have seen so far have been programming WAT or WASM directly.</p>",
        "id": 228765049,
        "sender_full_name": "Risto",
        "timestamp": 1614861789
    },
    {
        "content": "<p>Hmm. Actually, it seems that I cannot even find ways to generate a WASM file from a WAT as wat2wasm does not support multiple memories yet.<br>\nIs there some tool or way to generate Wasm modules that use the multi-memory instructions?</p>",
        "id": 229617240,
        "sender_full_name": "Risto",
        "timestamp": 1615363287
    },
    {
        "content": "<p>wasmtime supports running wat files directly, so that should work, I think. I appreciate that that isn't ideal, of course, and we should have better tooling. Maybe <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> or <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> know of any?</p>",
        "id": 229639166,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1615374761
    },
    {
        "content": "<p>That is good to know. For now just a way to create and execute such code / modules is enough. That allows experimenting with the feature.</p>",
        "id": 229649447,
        "sender_full_name": "Risto",
        "timestamp": 1615379906
    },
    {
        "content": "<p>Wasmtime should have runtime support for multi-module and the <code>wasm-tools</code>repo should have support for the text/binary format as well. I don't personally know of any toolchains which support using or emitting multi-memory at this time. I'm not sure if LLVM has plans to add support for it in the future either.</p>",
        "id": 229676913,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1615389054
    }
]