[
    {
        "content": "<p>Are any other platforms (Node etc.) working towards nanoprocesses to fully isolate imported modules?</p>",
        "id": 218387672,
        "sender_full_name": "Matias Funder",
        "timestamp": 1606807833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"365931\">@Matias Funder</span>  Not sure if you know about this, but while Node.js doesn't have the concept of a nanoprocess, you can start an isolated WASI instance (the API is experimental, and follows the current WASI spec - <a href=\"https://nodejs.org/api/wasi.html\">https://nodejs.org/api/wasi.html</a>)</p>",
        "id": 218456693,
        "sender_full_name": "Radu Matei",
        "timestamp": 1606844612
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"269505\">Radu M</span> <a href=\"#narrow/stream/206238-general/topic/new.20streams/near/218456693\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"365931\">Matias Funder</span>  Not sure if you know about this but while Node.js doesn't have the concept of a nanoprocess, you can start an isolated WASI instance (the API is experimental, and follows the current WASI spec - <a href=\"https://nodejs.org/api/wasi.html\">https://nodejs.org/api/wasi.html</a>)</p>\n</blockquote>\n<p>I'm familiar with V8 isolates and Node Worker Threads, but it is not clear to  me whether Node makes any effort to enable the isolated importation of modules (i.e. npm modules). It is possible to run code in isolation, but it does not appear to be designed or intended for being used to import or working with modules. The challenge is obviously how to interface \"nanoprocess\" modules when they share nothing, and I was wondering if there were any examples of platforms working towards such ideas? <span class=\"user-mention\" data-user-id=\"254124\">@Lin Clark</span></p>",
        "id": 218457734,
        "sender_full_name": "Matias Funder",
        "timestamp": 1606845171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"365931\">@Matias Funder</span> It's a bit premature for the Node community to dive into that because there are a few pieces that need to be in place for the nanoprocess model to work—module linking, interface types, and WASI.</p>\n<p>For IT and module linking, it makes the most sense to have the support in the engine. V8 is actively working on interface types, so Node will get that support once they're done. I don't know what their current plans are around module linking, but I could see them potentially tackling that work on the same timeline. </p>\n<p>Once all that is in place, there are quite a few people in the Node community who I know are excited to start applying the model</p>",
        "id": 218465392,
        "sender_full_name": "Lin Clark",
        "timestamp": 1606848846
    },
    {
        "content": "<p>Is that V8 support for interface types across JS instances (JS-JS), or specifically for JS-Wasm, Wasm-Wasm, or all of them? Where can I read more about their work and intentions?<br>\nIs the nanoprocess model an industry adopted term? Are there any other terms I might search for in my literature review?</p>",
        "id": 218478670,
        "sender_full_name": "Matias Funder",
        "timestamp": 1606855437
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254124\">@Lin Clark</span></p>",
        "id": 218502878,
        "sender_full_name": "Matias Funder",
        "timestamp": 1606870308
    }
]