[
    {
        "content": "<p>I see in <code>walrus</code> I can use <a href=\"https://docs.rs/walrus/0.20.3/walrus/struct.Module.html#method.replace_imported_func\"><code>replace_imported_func</code></a> to polyfill some imports.</p>\n<p>So my question is, is it possible for the <a href=\"https://docs.rs/walrus/0.20.3/walrus/struct.InstrSeqBuilder.html\"><code>InstrSeqBuilder</code></a> to use an existing set of instructions from a loaded function? Feels like it should be possible but I'm not seeing any way to copy existing instructions from a compiled polyfill function <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 412386656,
        "sender_full_name": "James Mart",
        "timestamp": 1704992934
    },
    {
        "content": "<p>Looks like there was some discussion about <a href=\"https://github.com/rustwasm/walrus/pull/250#issuecomment-1767403749\">this topic</a>.  CC <span class=\"user-mention\" data-user-id=\"598440\">@Victor Adossi</span> - I guess there's still no straightforward way to do that then?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/rustwasm/walrus/pull/250#issuecomment-1767403749\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/c195192685cb18b6d94b4ecc00af03c8e801e795\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f343861353538353766343439393932333537643566323532633832623362373766313434373035303931353333353835373739656330346635386666653565652f727573747761736d2f77616c7275732f70756c6c2f323530)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/rustwasm/walrus/pull/250#issuecomment-1767403749\" title=\"refactor: improve ergonomics of fn replace by vados-cosmonic 路 Pull Request #250 路 rustwasm/walrus\">refactor: improve ergonomics of fn replace by vados-cosmonic 路 Pull Request #250 路 rustwasm/walrus</a></div><div class=\"message_embed_description\">After trialing replace_(imported|exported)_func in WASI-Virt, it's clear that the ergonomics around the builder function need to be improved. FunctionBuilder (particularly FunctionBuilder::new()) i...</div></div></div>",
        "id": 412411072,
        "sender_full_name": "James Mart",
        "timestamp": 1705002887
    },
    {
        "content": "<p>Sorry I'm not sure exactly how you'd do that, but what about dealing with the function object itself? You might be able to manipulate/replace at the function rather than the instruction level?</p>",
        "id": 412498377,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1705048330
    },
    {
        "content": "<p>Also what about using <code>instrs</code> to copy and extract all the instructions for the function?</p>",
        "id": 412498818,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1705048539
    },
    {
        "content": "<blockquote>\n<p>what about dealing with the function object itself</p>\n</blockquote>\n<p>I'm thinking I'd need to work at the instruction level so I can detect if there's a call or indirect call in the copied function that the function index gets corrected when the instruction is copied into the new module.</p>\n<blockquote>\n<p>what about using instrs to copy and extract all the instructions for the function?</p>\n</blockquote>\n<p>Oh, okay this looks promising. So if I'm understanding correctly I should be able to extract the <code>instrs</code> from a compiled function and check the type with something like <code>if let walrus::ir::Instr::Call(call) = &amp;instr { ... }</code>... I'll give this a try!</p>",
        "id": 413017866,
        "sender_full_name": "James Mart",
        "timestamp": 1705346687
    },
    {
        "content": "<p>You're right about the instructions -- if you need to inspect them to figure out the direct/indirect calls -- I thought you might have been just trying to stub stuff out/duplicate a function without peering inside it!</p>\n<p>Excited to see where you land on the <code>instrs</code> usage! Not sure if it will work but <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span></p>",
        "id": 413079275,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1705379877
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"648387\">@James Mart</span></p>\n<p>What's your ultimate goal?  I found myself needing to polyfill a bunch of WASI Snapshot Preview 1 imports (convoluted story) and the least painful solution I found was to write some tooling to swap in a home-rolled VFS implementation, etc.</p>\n<p>My process is to include all of the polyfill functions as exports in the module (this lets, e.g., the module-internal memory allocator be dealt with at compile time instead of having to somehow be patched at rewrite or only allow non-allocating replacements) and then do a Walrus-based rewrite that replaces the imports with my exports.</p>\n<p>Would it be helpful to you if I open sourced my rewriting tool?  It's fairly general already, taking a mapping between function symbols to rewrite.</p>",
        "id": 413232466,
        "sender_full_name": "akesling",
        "timestamp": 1705436348
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"491664\">@akesling</span>  I'm writing a cargo extension that can be used to build wasm modules that are deployed in a certain environment, and in order to run in this environment all the wasi imports must be polyfilled with some custom implementations.</p>\n<p>If I'm understanding your design right, it sounds like you may have done something pretty close to what I'm doing. I'm currently compiling a polyfill wasm from rust, and then extracting the exports from that polyfill module (various wasi functions) and using them to replace all the wasi imports in the target module using walrus.</p>\n<blockquote>\n<p>Would it be helpful to you if I open sourced my rewriting tool?</p>\n</blockquote>\n<p>I mean, if you wouldn't mind, I'd happily take a look at your prior work and see if it suits my needs or helps expedite my efforts!</p>",
        "id": 413241624,
        "sender_full_name": "James Mart",
        "timestamp": 1705440371
    }
]