[
    {
        "content": "<p>Dear Zulip Community,</p>\n<p>We have a general question regarding WebAssembly (Wasm) header files. When we compile a program into Wasm, which header files are used? I understand that some come from <code>wasi-libc</code>, but does WebAssembly itself generate any header files?</p>\n<p>Best,<br>\nDennis</p>",
        "id": 471359356,
        "sender_full_name": "Dennis Zhang",
        "timestamp": 1726698610
    },
    {
        "content": "<p>WebAssembly is an ISA and does not generate its own header files, in the same way that x86 or aarch64 do not generate header files.</p>\n<p>I feel like there is perhaps an X-Y problem here: what are you trying to do?</p>",
        "id": 471359517,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1726698700
    },
    {
        "content": "<p>Hi fitzgen! Thanks for answering our question! So we were trying to compile a simple \"cat\" from coreutils, but it indicates that we are missing some header files.</p>",
        "id": 471502787,
        "sender_full_name": "Dennis Zhang",
        "timestamp": 1726757036
    },
    {
        "content": "<p>Are you using wasi-sdk to compile it? Which header files are missing?</p>",
        "id": 471504242,
        "sender_full_name": "bjorn3",
        "timestamp": 1726757481
    },
    {
        "content": "<p>We are actually using clang with glibc to compile it, not wasi-sdk.</p>",
        "id": 471512417,
        "sender_full_name": "Dennis Zhang",
        "timestamp": 1726759922
    },
    {
        "content": "<p>Glibc doesn't support wasm. You need to use the wasi-libc that is part of wasi-sdk if you want to compile C or C++ code for wasi.</p>",
        "id": 471512859,
        "sender_full_name": "bjorn3",
        "timestamp": 1726760049
    },
    {
        "content": "<p>Wasi-sdk is a bundle of wasi-libc together with clang and a bunch of other tools that are frequently necessary for building C and C++ code.</p>",
        "id": 471513130,
        "sender_full_name": "bjorn3",
        "timestamp": 1726760146
    },
    {
        "content": "<p>Hi bjorn3! Thanks for providing these information! Yeah, we are currently trying to modify glibc to support wasm.</p>",
        "id": 471514842,
        "sender_full_name": "Dennis Zhang",
        "timestamp": 1726760659
    },
    {
        "content": "<p>ah, in that case, the missing header files are part of that task -- headers are provided by the libc you're using</p>",
        "id": 471514962,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1726760696
    }
]