[
    {
        "content": "<p>Hi all, new here, excited to be in the community.</p>\n<p>I have a Rust lib crate which is sometimes used as a wasm component (run via wasmtime) and sometimes used as a regular Rust crate dependency when compiling for x86. Some of the exported types in this Rust lib are composed of types imported from bindings generated from a <code>.wit</code> file.</p>\n<p>I would like to use this same Rust crate in a third scenario, a web app (leptos). I've tried a couple things to make this happen, and I have a couple more ideas, but I was wondering if anyone had any insight for this setup?</p>",
        "id": 412611058,
        "sender_full_name": "Carson Rajcan",
        "timestamp": 1705089305
    },
    {
        "content": "<p>I would personally suggest splitting your project into multiple crates:</p>\n<ul>\n<li>the core library, exposing the best, most idiomatic Rust API it can</li>\n<li>a component crate, that implements the WIT interface in terms of the core library<ul>\n<li>you can use this component on the web via <code>jco</code>, so you don't need the last option most likely unless you want really tight integration with the DOM and all that</li>\n</ul>\n</li>\n<li>optionally a Web crate, that provides tight integration with the Web and DOM APIs via <code>wasm-bindgen</code></li>\n<li>you could also have a CLI crate, if you wanted, etc...</li>\n</ul>",
        "id": 412612873,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1705090038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> thanks for the reply. This is similar to what I was thinking I would have to do, it will just take a little work.</p>",
        "id": 412617407,
        "sender_full_name": "Carson Rajcan",
        "timestamp": 1705092177
    },
    {
        "content": "<p>yeah it is usually easier when you design things that way from the start, but that also means that switching now is better than putting it off because it only gets harder as you add API surface and features</p>",
        "id": 412621116,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1705093857
    },
    {
        "content": "<p>If you want to load and run a wit component on the web in Rust, you can use <a href=\"https://github.com/kajacx/wasm-bridge\">wasm-bridge</a> or <a href=\"https://docs.rs/wasm_component_layer/latest/wasm_component_layer/\">wasm_component_layer</a>.</p>\n<p>Although since you have your crate as a normal Rust crate as well, you would probably be better off just including that as a normal dependency instead of loading it as a wit component.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/kajacx/wasm-bridge\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/f8a281a034ba2d3b842a83ba24bd277df9fab11b\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f663034306430643732393035333538393632323734383263646163373839383031303165346561636330643339653466386534343862393464633864356665332f6b616a6163782f7761736d2d627269646765)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/kajacx/wasm-bridge\" title=\"GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys.\">GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys.</a></div><div class=\"message_embed_description\">Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys. - GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the ...</div></div></div>",
        "id": 412801109,
        "sender_full_name": "Karel Hrkal (kajacx)",
        "timestamp": 1705226461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"621586\">@Karel Hrkal (kajacx)</span>  <code>wasm-bridge</code> is really cool. I'll likely need to use it soon. Nice documentation!</p>",
        "id": 415386948,
        "sender_full_name": "Carson Rajcan",
        "timestamp": 1705449239
    }
]