[
    {
        "content": "<p>hello. i stumbled across WASM but never found it more useful than GPU.js due to lack of Browser API or NodeJS interfacing. Javy by Bytecodealliance unfortunately was just QuickJS. </p>\n<p>Either way, wasmtime and the code generator seem top nodge, and even Go bindings look super easy. </p>\n<p>Ethereum, the cryptocurrency network, once had a design draft to replace their virtual machine, EVM, with WASM, but abandoned it.</p>\n<p>i'd like to leverage the Go bindings of wasmtime, rely on the harsh security measures for a moment, and just feed a modified Ethereum Geth client with wasmtime bindings to execute and/or deploy hexadecimally encoded WebAssembly bytecode blobs as Serverless functions. The hex with prepending 0x is just Ethereum convention.</p>\n<p>Is there any obstacles or major hickups I'm just not seeing? <br>\nThanks!</p>",
        "id": 435089723,
        "sender_full_name": "a_less_apathetic",
        "timestamp": 1713920485
    },
    {
        "content": "<p>Based on your description that seems reasonable</p>",
        "id": 435183971,
        "sender_full_name": "Lann Martin",
        "timestamp": 1713963654
    },
    {
        "content": "<p>Thank you. Since you all seem very fine people at BCA (Spoke to a Javy maintainer too), I would like to express my gratitude for review and mention a request.  Ethereum PoC of Serverless I think I can handle. </p>\n<p>JSLinux to WASM (runtime package, if we're being honest it is not a Compiler per se. In security we call it a Packer) seems impossible right now.</p>\n<p>The impact of exploring a path to make it happen, leading to futuristic realities of Cloud Computing in a decentralized fashion becoming real, is profound. </p>\n<p>Is this something you can even possibly see on the Horizon?</p>",
        "id": 435186065,
        "sender_full_name": "a_less_apathetic",
        "timestamp": 1713964287
    },
    {
        "content": "<p>I don't think you'll find a whole lot of interest in that specific project from the active contributors here. This community is more focused on Wasmtime, the Wasm component model (and core), and WASI. You would probably find more interest within a blockchain-focused group.</p>",
        "id": 435188194,
        "sender_full_name": "Lann Martin",
        "timestamp": 1713964887
    }
]