[
    {
        "content": "<p>Hi folks. We've a framework we created for building and testing multiple non-web based WASM engines, it gathers informaiton on jitter, latency, and compares various algortthms between the differning engines and against native speed too. We shared our results initial at the WASM Research event last year.  It's taken a while, but we've got the necessary internal approval to share this framework and the tests as an Apache2 licensed open source contribution.</p>\n<p>I know there are al whole bunch of folks doing performance testing. We're hoping this would help toward to wider community goal of having a shared set of tests and a framework to run time. It was originally created by us at Siemens as a home grown way to provide some repeatable, cross engine performance tests. To allow us to better understand the timing, jitter, and potential real time use cases for WASM and the various runtimes. The framework accounts for the different engines and all the possible ways in which they could be configured, for for WAMR - it covers AoT, JIT, Fast Interpreter, and Standard Interpreter.</p>\n<p>I've a question for the community, should we share this inital contribution of a framework as a Bytecode Alliance project, or just share on GitHub ?</p>\n<p>As I see this contribution merging into a the wider effort of a cross engine performance testing framework. Is this something we in the Bytecode Alliance would like to have? </p>\n<p>Are there any other efforts within the alliance to create this type of cross-enginer performance analysis? -- I know the WAMR team have thier own inhouse analysis, and I'd guess that our colleagues in Wasmtime have something similar...</p>",
        "id": 329272334,
        "sender_full_name": "Chris Woods",
        "timestamp": 1677007185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"435699\">@Chris Woods</span> -- as a first question, how does it compare to Sightglass? This is our performance-testing framework for Wasmtime/Cranelift and some folks have worked on runners for other engines as well</p>",
        "id": 329272734,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677007302
    },
    {
        "content": "<p>I'll link to <a href=\"#narrow/stream/223391-wasm/topic/Benchmarking.20runtime.20performance\">this thread</a> from last week as well, discussing our thoughts on cross-engine comparisons in general</p>",
        "id": 329272910,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677007346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span>  - good question, the honest answer is that I don't know....  We didn't look at sightglass. Our goal was to create the scaffolding to download and build multiple engines, with multiple build configurations, then run a test of tests on each, gather the results. The repeat multiple times, a current test run gathers upwards of 50k data points. The framework of course comes with tests we've written which represent some of the types of algorithms we'd see used in our products today, but that are not limited, new test cases can of course be added.</p>\n<p>Our inital thought was perhaps the framework and scaffolding would be of more initial use than the test cases themselves.... </p>\n<p>To be fair, I'm not sure of sightglasses capabilities, so I'd need to learn, and I'm happy too. Perhaps this is already covered? </p>\n<p>Thanks for the link, I missed it, so I'll check it out.</p>",
        "id": 329273968,
        "sender_full_name": "Chris Woods",
        "timestamp": 1677007684
    },
    {
        "content": "<p>That would be the place to start at least, if the question is \"would the BA like this\", because that's our existing benchmarking answer :-)</p>\n<p>I do think there's possibly lots of value in what you have, at least in the benchmarks -- we can always use more relevant use-cases. That's speaking just for myself though, I don't represent BA interests as a whole!</p>",
        "id": 329274537,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677007864
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> , I'll repost my question over there on <a href=\"#narrow/stream/223391-wasm/topic/Benchmarking.20runtime.20performance\">that thread...</a> .. </p>\n<p>Dear future reader, if you get this far, click the link.... and chat to you there... ;p</p>",
        "id": 329276056,
        "sender_full_name": "Chris Woods",
        "timestamp": 1677008376
    }
]