[
    {
        "content": "<p>Hi :) </p>\n<p>I am exploring how a module could make use of threads on the host side and was thinking of the following scenario:</p>\n<ul>\n<li>the host offers a function to the module which the module can execute</li>\n<li>when the module calls the function, the host<ul>\n<li>creates a new instance of the calling module (the new instance and the \"main\" module calling the host functions should be in the same store and share memory)</li>\n<li>starts a new thread</li>\n<li>within that thread, calls a predefined function of the new module instance </li>\n</ul>\n</li>\n</ul>\n<p>Is something like this possible in general? </p>\n<p>I have been trying to implement something into this direction, but could not quite get it to work so far. I have so far been defining host functions via <code>linker.func_wrap(...)</code> and accessing anything I needed via the  <code>Caller</code> available within the host function and have difficulties figuring out how I would configure the linker and start up the different module instances. </p>\n<p>If this the above scenario is doable, could you please give me some advice of how I would configure the linker for this and how the host function would look? </p>\n<p>Thanks a lot! :)</p>",
        "id": 418521569,
        "sender_full_name": "Fedor Smirnov",
        "timestamp": 1706464043
    },
    {
        "content": "<p>I think you're more-or-less describing the current state of the wasi-threads proposal (it's very experimental), and the <a href=\"https://github.com/bytecodealliance/wasmtime/tree/main/crates/wasi-threads\">implementation in Wasmtime</a> might be of interest to you as it's doing what you're describing I believe</p>",
        "id": 418522902,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706465253
    },
    {
        "content": "<p>Thank you for the pointer :) </p>\n<p>If I am reading the code correctly, we create a new Store instance for every new module that we create on a call to the host function we define. So the instances can share memory, in spite of not being in the same store?</p>\n<p>And, for the modules to share memory, it is sufficient to add the memory to the linker (line 140)? And then all modules which we instantiate via the host function will have access to it? Is it because they are created from the same <code>instance_pre</code> ?</p>",
        "id": 418527209,
        "sender_full_name": "Fedor Smirnov",
        "timestamp": 1706468921
    },
    {
        "content": "<p>Sort of but not quite. It's correct that multiple stores are used, one per thread, and that memory is shared. The detail though is that the memory is a <code>SharedMemory</code> and therefore safe to transfer across threads and additionally independent from a store.  This is a form of shared memory multithreading for the wasm module itself, which may or may not be what you're looking for. Shared memory multithreading in wasm requires a fair bit of cooperation with the module in question.</p>",
        "id": 418666026,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1706543313
    },
    {
        "content": "<p>I see. Will try to implement it following the example you linked to and will see how it goes. Thank you! This has been a great help :)</p>",
        "id": 418691749,
        "sender_full_name": "Fedor Smirnov",
        "timestamp": 1706551298
    }
]