[
    {
        "content": "<p>I'm implementing <code>GuestMemory</code> for a memory type in my Wasm interpreter, to be able to use <code>wasi-common</code>. Can I assume that whenever <code>wasi-common</code> writes to the memory it first calls <code>mut_borrow</code>, or does it only do that if for some reason it's going to store a memory region somewhere to be used later, or something like that? Would be good to know in what cases <code>mut_borrow</code> will be called by <code>wasi-common</code>.</p>",
        "id": 221196096,
        "sender_full_name": "osa1",
        "timestamp": 1609314279
    },
    {
        "content": "<p>Hi. Yes that’s the idea behind the runtime borrow checker. It will call the borrow functions at the start of (possible) access and the unborrow functions at the end.</p>",
        "id": 221255825,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371264
    },
    {
        "content": "<p>The runtime borrow checking is something the wiggle crate abstracts away. Wiggle-generated code will call the is_borrowed methods when copying items out of guest memory (to ensure the copy operation is safe) and the borrow methods get called at creation and drop of the GuestSlice / GuestSliceMut / GuestStr / GuestStrMut structs</p>",
        "id": 221255971,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371404
    },
    {
        "content": "<p>In general I suggest that you use the wiggle-borrow crates implementation of the borrow checker and wire that into your guest memory impl.</p>",
        "id": 221256010,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371447
    },
    {
        "content": "<p>It’s probably not the most efficient implementation possible but so far we haven’t found that runtime borrow checking is a performance bottleneck. If you do find ways to improve the wiggle-borrow crate we are happy to accept them</p>",
        "id": 221256088,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371526
    },
    {
        "content": "<p>Btw, I’m most of the way through a rewrite of wasi-common, it’s in a draft PR. So, expect the way you build a wasi common context to change, and other interfaces to it as well.</p>",
        "id": 221256185,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371643
    },
    {
        "content": "<p>I’m on vacation this week but sometimes I check zulip. I haven’t been watching GitHub. Will be back next week.</p>",
        "id": 221256209,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609371685
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"253992\">@Pat Hickey</span> for the details . I'm already using wiggle-borrow.</p>",
        "id": 221293790,
        "sender_full_name": "osa1",
        "timestamp": 1609425426
    }
]