[
    {
        "content": "<p>WASM Mixins</p>",
        "id": 438784588,
        "sender_full_name": "Sekoia",
        "timestamp": 1715774015
    },
    {
        "content": "<p>Argh, didn't mean to send that yet. Hold on.</p>",
        "id": 438784627,
        "sender_full_name": "Sekoia",
        "timestamp": 1715774029
    },
    {
        "content": "<p>Hiya!<br>\nI've had an idea for a project that I've been casually exploring for a little bit: WASM Mixins.</p>\n<p>Essentially, \"safe\" code injection. I don't think there's any practical use for this kind of thing, beyond \"modding\" programs that allow it, so it's really just for fun. I'm basing myself off of Minecraft modding mixins, which injects JVM bytecode. JVM bytecode is much higher level than WASM, so it is relatively easy to do basic injection; simply add a call!</p>\n<p>In WASM, the call would need to call a new function. For <em>very</em> basic code injection, this is fine, because we can simply append a new function. However, this does not work with code injection that uses memory (because only one memory is defined per module (currently)), other functions (because the function indices would need to be shifted, which is very complex), etc.<br>\nThe only solution I can see is to import the injected function (and then call it, though that's a little slower, it's okay).</p>\n<p>Problem: this <em>also</em> shifts the entire function space of the injected module. Possible solution: \"reserve\" some function indices with fake functions, that can be removed freely?</p>\n<p>If you see any other issues, or have other solutions, I'd be interested to hear them (or even if you don't and just wanna play around with the idea too)!</p>",
        "id": 438786782,
        "sender_full_name": "Sekoia",
        "timestamp": 1715774778
    },
    {
        "content": "<p>In some ways I think this would actually be <em>easier</em> than you suspect; binary WASM  (or equivalent textual WAT) is much easier to manipulate than typical native ASM (not sure how it would compare to JVM bytecode). You are correct that mucking around with a module's linear memory could be tricky, but it seems like multi-memory actually would be a reasonable solution in this scenario by twiddling memory indexes as part of the manipulation. <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 438792769,
        "sender_full_name": "Lann Martin",
        "timestamp": 1715776886
    },
    {
        "content": "<p>Yeah, definitely easier than native ASM, which is why I'm actually interested in implementing this :P</p>\n<p>I don't think you <em>can</em> twiddle memory indexes; currently all base instructions implicitly refer to memory index 0 (though, if I had a WASM runtime that has multiple-memory support, I could make all injected functions refer to their respective memories). The other problem is function indexes, since function \"pointers\" (indices, really) exist, and can be manipulated as data... before every call in an injected function, I would have to offset it by that injection's memory offset.</p>\n<p>Actually a lot of these problems can be strongly reduced with a custom runtime (all index spaces can be offset when in their respective cases), but I'm not sure how much I want to veer into that, because non-compliant binaries would break all existing tooling.</p>",
        "id": 438804438,
        "sender_full_name": "Sekoia",
        "timestamp": 1715780376
    },
    {
        "content": "<p>Somebody else suggested injecting a <em>single</em> new import, which would be a delegating function. The delegating function would call the injected functions, and it would be constructed at injection time. Different injected functions would have different signatures, so some form of arbitrary message passing would be needed (and since I'm working in raw WASM, it needs to be relatively simple and agnostic, not a malloc or something).</p>",
        "id": 438804991,
        "sender_full_name": "Sekoia",
        "timestamp": 1715780526
    },
    {
        "content": "<blockquote>\n<p>if I had a WASM runtime that has multiple-memory support</p>\n</blockquote>\n<p><a href=\"https://docs.rs/wasmtime/20.0.2/wasmtime/struct.Config.html#method.wasm_multi_memory\">https://docs.rs/wasmtime/20.0.2/wasmtime/struct.Config.html#method.wasm_multi_memory</a> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 438806184,
        "sender_full_name": "Lann Martin",
        "timestamp": 1715780858
    },
    {
        "content": "<p>Well, analogously I would need function and table offsets (alternatively, right before any call or table fetch, offset the index by the function's offset in that index space. But that's difficult to implement and not the fastest).</p>",
        "id": 438808131,
        "sender_full_name": "Sekoia",
        "timestamp": 1715781382
    },
    {
        "content": "<p>Have you seen <a href=\"https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly\">https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly</a> ? Andy outlined a scheme for adding new functions to a wasm instance by manipulating the table</p>",
        "id": 438821148,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1715784435
    },
    {
        "content": "<p>oo, I haven't! That seems really relevant, thank you!</p>",
        "id": 438823331,
        "sender_full_name": "Sekoia",
        "timestamp": 1715785029
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"253992\">Pat Hickey</span> <a href=\"#narrow/stream/206238-general/topic/WASM.20mixins/near/438821148\">said</a>:</p>\n<blockquote>\n<p>Have you seen <a href=\"https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly\">https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly</a> ? Andy outlined a scheme for adding new functions to a wasm instance by manipulating the table</p>\n</blockquote>\n<p>I think I've understood it now. In the dynamic version, the main module dynamically generates a new module, with a <code>patch</code> function. Also, a new function is appended to the main module. The... handler, for lack of a better word, instantiates this new module, then calls <code>patch</code>. <code>patch</code> imports a table from the main module, injects the newly added function to that table, and when the main module runs, it'll <code>call_indirect</code> the newly added function.</p>\n<p>Very neat!</p>",
        "id": 439033823,
        "sender_full_name": "Sekoia",
        "timestamp": 1715869814
    },
    {
        "content": "<p>I ended up finding <code>walrus</code>, which helps a <em>lot</em>. Anyway, I now have function redirection!</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"n\">INITIAL</span><span class=\"w\"> </span><span class=\"n\">MODULE</span>:\n<span class=\"nb\">From</span> <span class=\"nc\">fn_zero</span>\n<span class=\"n\">MIXED</span><span class=\"w\"> </span><span class=\"n\">MODULE</span>:\n<span class=\"nb\">From</span> <span class=\"nc\">fn_one</span>\n</code></pre></div>",
        "id": 439389557,
        "sender_full_name": "Sekoia",
        "timestamp": 1716074468
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"253992\">Pat Hickey</span> <a href=\"#narrow/stream/206238-general/topic/WASM.20mixins/near/438821148\">said</a>:</p>\n<blockquote>\n<p>Have you seen <a href=\"https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly\">https://wingolog.org/archives/2022/08/18/just-in-time-code-generation-within-webassembly</a> ? Andy outlined a scheme for adding new functions to a wasm instance by manipulating the table</p>\n</blockquote>\n<p>oh this is neat!</p>",
        "id": 439443254,
        "sender_full_name": "Soni L.",
        "timestamp": 1716129640
    }
]