[
    {
        "content": "<p>Hi there <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span>  Shivam here, <br>\nI want to contribute for the wasmtime fuzzing project which was nominated during this years gsoc2020. While working on the proposal I had plenty of doubts regarding the concepts like fuzzing for ABI abstractions, heap safety and much more. Due to lack of time during the application process I had to apply with a very little knowledge about the goal which I wanted to clear out by proper communication. I wrote on the github issue page for same   and it directed me here.</p>",
        "id": 192956043,
        "sender_full_name": "Shivam Balikondwar",
        "timestamp": 1586088041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282030\">@Shivam Balikondwar</span> thanks for this! We'll look but we're going to try to be fair to the other applicants as well.</p>",
        "id": 192976510,
        "sender_full_name": "Deian Stefan",
        "timestamp": 1586118315
    },
    {
        "content": "<p>Yeah no problem but I am doing it to know more about the project</p>",
        "id": 192976525,
        "sender_full_name": "Shivam Balikondwar",
        "timestamp": 1586118361
    },
    {
        "content": "<p>Given the deadline has already passed and it is equally probable that I might get rejected so I am considering without the outcome. <br>\nEven if someone else gets selected I am completely fine with him working on the idea cause it's his right he has worked on it.</p>",
        "id": 192976603,
        "sender_full_name": "Shivam Balikondwar",
        "timestamp": 1586118467
    },
    {
        "content": "<p>But I keep it up to you if you think it's fair then I shall look on it @Deian</p>",
        "id": 192976751,
        "sender_full_name": "Shivam Balikondwar",
        "timestamp": 1586118666
    },
    {
        "content": "<p>(Or her.) We'll take a look! Excited that you're interested in this stuff!</p>",
        "id": 192977644,
        "sender_full_name": "Deian Stefan",
        "timestamp": 1586120028
    }
]