[
    {
        "content": "<p>Hello folk! Can I ask what is the use for <code>(type .. )</code> in WebAssembly? I am reading the spec, but I can fully grasp what is the point of it.</p>",
        "id": 313362314,
        "sender_full_name": "Peter Bocan",
        "timestamp": 1669924162
    },
    {
        "content": "<p>These are signature types that can be used e.g. on <code>call_indirect</code>s. In the binary format, indices into the type section are used everywhere a function signature is needed -- at function declarations (in the function section), in imports, and at indirect calls</p>",
        "id": 313362784,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1669924298
    },
    {
        "content": "<p>does it make sense to generate them all the time or only when needed?</p>",
        "id": 313364446,
        "sender_full_name": "Peter Bocan",
        "timestamp": 1669924780
    },
    {
        "content": "<p>the binary format requires them (the indirection into the type section is how all function signatures are encoded)</p>",
        "id": 313365038,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1669924906
    },
    {
        "content": "<p>in the text format, I think in every place you can say (type N) you can also say (func (param ...) (result ...))</p>",
        "id": 313365094,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1669924920
    },
    {
        "content": "<p>ah alright, is there a need to define types manually in the text format? I may need to read more on that.</p>",
        "id": 313366599,
        "sender_full_name": "Peter Bocan",
        "timestamp": 1669925379
    },
    {
        "content": "<p>I don't think so, no, it's enough to write the signatures directly where you define or import functions</p>",
        "id": 313367696,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1669925725
    },
    {
        "content": "<p>I'm 95% sure you can do it inline on <code>call_indirect</code> instructions too but I'd have to double-check</p>",
        "id": 313367733,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1669925737
    },
    {
        "content": "<p>it's correct that you don't need to define the types in the text format, and all locations that can use a type you can define the type inline as well</p>",
        "id": 313369865,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1669926421
    },
    {
        "content": "<p>if you define the same type inline in multiple places in the text format it's deduplicated in the final binary produced</p>",
        "id": 313369906,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1669926433
    }
]