[
    {
        "content": "<p>I'm trying to use wiggle, and am hitting the issue that the first return has to be primitive. Is there a strong requirement for that, or is it just a current technical limitation? I'd love to be able to use <code>anyhow::Result&lt;()&gt;</code> as my \"errno\" type by encoding the context chain in an <code>(array string)</code></p>",
        "id": 221826589,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609968761
    },
    {
        "content": "<p>so, the return types in wiggle happen to be a weird thing thats not fully worked out yet.</p>",
        "id": 221828216,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609969832
    },
    {
        "content": "<p>the convention in witx that wasi and wiggle agree on is that the very first return type is an atomic value that can encode either success or an error condition (basically, posix errno)</p>",
        "id": 221828318,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609969894
    },
    {
        "content": "<p>all subsequent return types are only valid when the first is success</p>",
        "id": 221828333,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609969907
    },
    {
        "content": "<p>there is no support for using a more complex error type at the abi level.</p>",
        "id": 221828452,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609969961
    },
    {
        "content": "<p>i suggest you use an enum for error like wasi's <code>errno</code> type.</p>",
        "id": 221828620,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970052
    },
    {
        "content": "<p>Are there plans to make more complex error types possible, is it something that has been formally decided against, or is it just pending design?</p>",
        "id": 221828653,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970075
    },
    {
        "content": "<p>definitely not formally decided against. we havent pursued it in part because we havent needed to (there are a bunch of other stuff higher priority)</p>",
        "id": 221828702,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970108
    },
    {
        "content": "<p>(BTW, is there an issue tracker for witx/wiggle? AFAICT it appears to be split and lost between wasi and wasmtime)</p>",
        "id": 221828712,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970121
    },
    {
        "content": "<p>the pending design is that, one day soon, interface types will make it possible to send more complex types across these boundaries</p>",
        "id": 221828729,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970135
    },
    {
        "content": "<p>and witx isnt trying to be interface types quite yet, because its just not ready.</p>",
        "id": 221828761,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970148
    },
    {
        "content": "<p>if you need something before then, we can figure out a way to fit it into the way things work currently</p>",
        "id": 221828819,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970168
    },
    {
        "content": "<p>as far as issue tracking - this is a bit of a tricky thing. the witx crate lives in WebAssembly/WASI because its very useful for validating changes to the standard itself, autogenerating the markdown docs from the doc comments (so the canonical docs are just in one place), and so on.</p>",
        "id": 221828884,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970210
    },
    {
        "content": "<p>so its a bit like the wasm reference interpreter, you are welcome to use other tools but this one is the official validator</p>",
        "id": 221828917,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970235
    },
    {
        "content": "<p>Got it, thank you :) so I guess I'll just ignore that problem for now, currently my callbacks expose few error types so I can just expose an enum, even though it's much less good UX (well... or maybe I'll just have my callbacks directly log the errors for now, even though said errors may end up being worked around on the other side of the chain)</p>",
        "id": 221828967,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970272
    },
    {
        "content": "<p>all of the tools that generate code using the witx crate live elsewhere. many of them are in the wasmtime repo.</p>",
        "id": 221828979,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970277
    },
    {
        "content": "<p>the other aspect of error handling is the user error conversion facilities of wiggle</p>",
        "id": 221829050,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970303
    },
    {
        "content": "<p>do you grok what <code>UserErrorConversion</code> is up to in wasi-common?</p>",
        "id": 221829101,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970331
    },
    {
        "content": "<p>Hmm so I guess things like \"complex error types aren't supported\" should be tracked in webassembly/wasi so it's not forgotten about?</p>",
        "id": 221829108,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970334
    },
    {
        "content": "<p>yeah, if youd like. i promise we wont forget about it, but it is useful to put my thinking on the record in a reply to that issue and let others chime in as well.</p>",
        "id": 221829166,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970373
    },
    {
        "content": "<p>I think so, it's the place where I'd have walked the context trace of my anyhow::Error to turn it into an (array string) so it gets in the metadata, to be decoded on the wasm side :)</p>",
        "id": 221829275,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970413
    },
    {
        "content": "<p>Gotcha, thanks :) any github handle I should tag?</p>",
        "id": 221829298,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970427
    },
    {
        "content": "<p>anyway, since you and i agree that complex error types are the correct way to do programming, wiggle supports you using them through <code>the argument </code>errors: { errno =&gt; RichError }` syntax in the arguments to the wiggle::from_witx! macro.</p>",
        "id": 221829360,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970464
    },
    {
        "content": "<p>im <code>pchickey</code> on github but no need to cc, i read all issues going to WebAssembly/WASI</p>",
        "id": 221829411,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970489
    },
    {
        "content": "<p>Hmmmmm... but that will lose all the error metadata when going through the wasm boundary, right?</p>",
        "id": 221829449,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970516
    },
    {
        "content": "<p>(Right now I'm just converting to a boolean $success for testing purposes)</p>",
        "id": 221829533,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970539
    },
    {
        "content": "<p>yes, but it gives you the opportunity to log it, or save it in your ctx for later retrieval</p>",
        "id": 221829536,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970540
    },
    {
        "content": "<p>Oh right I hadn't thought of logging there, thank you :)</p>",
        "id": 221829564,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970560
    },
    {
        "content": "<p>Aaand actually storing in the ctx and returning an u64 handle is the killer idea: this way I can skip the whole wasm stack and feed it back to the other side</p>",
        "id": 221829635,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970607
    },
    {
        "content": "<p>so if you want to save the complex error into your ctx, then you can have a special function thats get_latest_error  which has two results <code>(result $error $errno) (result $latest_error $your_complex_error_type)</code></p>",
        "id": 221829650,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970623
    },
    {
        "content": "<p>Oh that's even better :)</p>",
        "id": 221829736,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970666
    },
    {
        "content": "<p>This way no need to add wasm-skipping logic</p>",
        "id": 221829776,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970692
    },
    {
        "content": "<p>ah yeah if you use a u64 ident that identifies which error, then you can skip the terrible posix <code>errno()</code>-style <code>get_latest_error</code> semantics and make it something like <code>(param $error_idx u64) (result $errno $errno) (result $rich_error $rich_error)</code>...</p>",
        "id": 221829806,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970712
    },
    {
        "content": "<p>theres no threads yet, so latest_error will work fine, but its one of those things thats just warty anyway</p>",
        "id": 221829837,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970739
    },
    {
        "content": "<p>Thank you for all these ideas! I'll try to sum that all in a wasi issue :) (not sure I'll give back an u64 yet though, as it'd mean having to deal with gcing unused errors)</p>",
        "id": 221829928,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970772
    },
    {
        "content": "<p>true. my assumption would be that errors should be finite and instances short-lived enough that storing them for a while is fine. but your design may be different.</p>",
        "id": 221829991,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609970815
    },
    {
        "content": "<p>Yeah I'd rather have a long-lived instance, as I'm using wasm for configuration so changing instances would mean having to resetup it</p>",
        "id": 221830141,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609970899
    },
    {
        "content": "<p>right on. my job is to keep instances as short-lived as possible. if you're lucky, you'll be the one to find whatever weird edge cases happen when <code>wiggle-borrow</code> hits internal overflows that i havent found yet</p>",
        "id": 221830550,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609971060
    },
    {
        "content": "<p>Nice :D I was kind of wondering whether I shouldn't automatically restart the instance every few hours of uptime or so, to avoid leaks in user configuration affecting the program, but it may be fun to try running for a few weeks and see if actual bad things happen :)</p>",
        "id": 221830859,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609971236
    },
    {
        "content": "<p>im certain that <code>wiggle-borrow</code> could use automated testing and that performance (and maybe even correctness?) improvements can be made. but i dont have the time to work on that more just now.</p>",
        "id": 221830988,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609971304
    },
    {
        "content": "<p>Makes sense! There are always priorities, and I'm with you that lots of other things are more important than wiggle-borrow's performance right now :)</p>",
        "id": 221831120,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609971371
    },
    {
        "content": "<p>i need to run for the day and go... participate in democracy</p>",
        "id": 221831880,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1609971885
    },
    {
        "content": "<p>Cool, good luck participating in democracy!</p>",
        "id": 221832090,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609972023
    },
    {
        "content": "<p>And have a nice day :)</p>",
        "id": 221832127,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609972042
    },
    {
        "content": "<p>Hmm... Coming back here, it looks to me like a callback basically cannot return an array or string, and thus that last_error cannot actually return all the data. (or at least, I haven't figured out how to allocate data in the guest memory)<br>\nIs this correct? Is there a way to actually do it?<br>\nCurrently the best I could think of would be to:</p>\n<ol>\n<li>Pass in a buffer</li>\n<li>Return a (array u8) instead of an (array string) by concatenating all strings together and making sure it's all ASCII, because I can't figure out how to get a GuestPtr&lt;str&gt; from another GuestPtr</li>\n</ol>\n<p>But then I feel like I'm missing something... maybe?</p>",
        "id": 221837846,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1609975624
    },
    {
        "content": "<p>The webassembly module is responsible for allocating memory. The embedder doesn't have any knowledge about the allocator used by the wasm module.</p>",
        "id": 221930098,
        "sender_full_name": "bjorn3",
        "timestamp": 1610018414
    },
    {
        "content": "<p>Makes sense, what I was thinking was about exposing the allocator from wasm. It's actually what I'm currently doing for other parts of the wasm FFI: allocate a memory block via an <code>allocate</code> function, then write serialized data to it, and deserialize/deallocate on the other site of the ffi. It's certainly less performant, but it's also the currently best way I found to properly bind functions from wasm to host.</p>\n<p>Anyway, hopefully when wiggle or wit support exposing callbacks from wasm to host, it'll probably be possible to industrialize this by having the allocator function return a GuestPtr. But even then that will probably require some more API surface to be able to use such arrays/strings properly from wasm side?</p>\n<p>That said I guess it's surely all already on the roadmap to interface types, so it's probably not worth discussing too much at length I guess :)</p>",
        "id": 221943640,
        "sender_full_name": "Léo Gaspard",
        "timestamp": 1610027695
    }
]