[
    {
        "content": "<p>The webassembly spec is somewhat vague on what a trap is. The spec only says:</p>\n<blockquote>\n<p><strong>Traps</strong><br>\nUnder some conditions, certain instructions may produce a trap, which immediately aborts execution. Traps cannot be handled by WebAssembly code, but are reported to the outside environment, where they typically can be caught.</p>\n</blockquote>\n<p>In particular, there doesn't seem to be anything specifying that traps <em>actually</em> have to be caught, or that the VM has to report anything to the outside environment beside \"a trap occurred, sucks to be you\". In practice, all browsers throw exceptions on traps (though I'm not sure if the JS API specifies this is what needs to happen?)</p>\n<p>So, some dumb questions, mostly out of curiosity:</p>\n<ul>\n<li>Does wasmtime make guarantees about what a trap should be?</li>\n<li>Is an hypothetical wasm implementation that aborts or segfaults on a trap compliant with the wasm spec?</li>\n</ul>",
        "id": 237386501,
        "sender_full_name": "Olivier FAURE",
        "timestamp": 1620157388
    },
    {
        "content": "<p>Traps are not equivalent to exceptions as exceptions may be added to Wasm in the future (see <a href=\"https://github.com/WebAssembly/exception-handling\">https://github.com/WebAssembly/exception-handling</a>). They're more analogous to a \"signal\" that can't be handled by Wasm, but can be handled in the host environment.</p>\n<p>Wasmtime has a guaranteed representation of a trap in its Rust API, which is <code>wasmtime::Trap</code>; this representation is used both for any traps Wasm code might cause or from host functions that may \"trap\".</p>\n<p>Wasm only has the <code>unreachable</code> instruction that explicitly is for trapping; other instructions may cause traps when runtime validation fails (i.e. divide by zero, an out-of-bounds memory access, an indirect call type signature mismatch, etc). The Wasm spec just outlines the trap conditions; it's the responsibility of a runtime like Wasmtime to ensure that traps are raised when those conditions are met.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/exception-handling\" style=\"background-image: url(https://opengraph.githubassets.com/3eeec11177db158670b6c2501107c5d60048bbf1b37335f54460fd902cd338e4/WebAssembly/exception-handling)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/exception-handling\" title=\"WebAssembly/exception-handling\">WebAssembly/exception-handling</a></div><div class=\"message_embed_description\">Proposal to add exception handling to WebAssembly. Contribute to WebAssembly/exception-handling development by creating an account on GitHub.</div></div></div>",
        "id": 237390835,
        "sender_full_name": "Peter Huene",
        "timestamp": 1620159231
    },
    {
        "content": "<p>Wasm itself can't \"abort\" like one would do in a C program; it may execute an <code>unreachable</code> instruction to cause a trap or call a host function that \"aborts\" (for example, in WASI there's a <code>proc_exit</code> function which implementations may treat as a special trap to \"exit\" the Wasm \"process\")</p>\n<p>Wasm also can't \"segfault\"; it can read or write memory at an offset that isn't valid for the current size of the memory being referenced, which is a trap condition; it's up to the runtime to ensure a trap gets returned back to the host environment.  One way to do that would have bounds checks for every memory instruction.  Wasmtime can be configured to do bounds checking, but for performance, it uses guard memory regions that will cause OS signals and then translates those signals to traps by default.</p>",
        "id": 237391609,
        "sender_full_name": "Peter Huene",
        "timestamp": 1620159603
    }
]