[
    {
        "content": "<p>In the spirit of WASM being a strong sandbox, hosts need tools to mitigate intentional and accidental denial-of-service attacks from untrusted guests. In a JavaScript host, using the <code>WebAssembly</code> global, it seems like it is very hard to accomplish this in an ergonomic way.</p>\n<p>By its nature, JavaScript is single-threaded and blocks on calls to exported guest functions. As a result, it has no mechanism to cancel that operation unless the canceller is in another isolate. There is no built-in way to invoke an exported function with a predetermined deadline. So a JavaScript host needs to spin up workers (according to runtime) to execute the guest functions. It can then enforce deadlines and cancellations from the event loop that has references to the workers.</p>\n<p>This seems like a pretty critical flaw in the <code>WebAssembly</code> interface itself. Is there somewhere with deeper discussion on this? Is it 'on the radar' of the right people?</p>",
        "id": 422487674,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1708457359
    },
    {
        "content": "<p>I haven't really seen any discussion about this sort of thing in the JS <code>WebAssembly</code> API. I'd file an issue on the <code>webassembly/design</code> repo if you wanted to kick off that discussion.</p>\n<p>FWIW, JS is generally considered by browsers to be in the same sandbox as wasm. That is, it's all untrusted guest code to the browser, and they don't really differentiate between JS vs Wasm (modulo the semantics around wasm imports and not gaining ambient authority to call any JS function).</p>\n<p>Also, another option is to pre-process the wasm to insert fuel or something like that if you have this particular use case of wanting to avoid DoS in your JS app due to infinite loops or whatever in your Wasm</p>",
        "id": 422489703,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1708458238
    },
    {
        "content": "<p>Web workers are the canonical solution to blocking computation in browsers</p>",
        "id": 422490025,
        "sender_full_name": "Lann Martin",
        "timestamp": 1708458359
    },
    {
        "content": "<p>Maybe you could clarify what the problem is with that solution?</p>",
        "id": 422490338,
        "sender_full_name": "Lann Martin",
        "timestamp": 1708458484
    },
    {
        "content": "<p>I would say that the problem with the status quo is one of ergonomics; the approach to spawning Workers on different JavaScript runtimes is often quite different. It requires the introduction of quite a bit of complexity that is unrelated to WASM to safely consume the tech.</p>\n<p>The tools for publishing re-usable code that can be consumed on each of these runtimes is also very difficult. JavaScript is already horrible when it comes to packaging and publishing anything requiring a separate entrypoints being available across runtimes.</p>",
        "id": 422493202,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1708459713
    },
    {
        "content": "<blockquote>\n<p>JS is generally considered by browsers to be in the same sandbox as wasm. That is, it's all untrusted guest code to the browser, and they don't really differentiate between JS vs Wasm</p>\n</blockquote>\n<p>That sounds like a very plausible explanation. I bet the server-side runtime and untrusted guest use-cases weren't key factors in the design of the <code>WebAssembly</code> API.</p>",
        "id": 422494250,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1708460196
    },
    {
        "content": "<p>I've found this issue on GitHub that appears to have some background discussion: <a href=\"https://github.com/WebAssembly/design/issues/1345\">https://github.com/WebAssembly/design/issues/1345</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/design/issues/1345\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/fca7a83b7e89d95519288c2263a5e84f0971b54d\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f373539396538333663353034623934646632643834336261663863313133386534353563636166396361383735396665393263613036643833396264333266362f576562417373656d626c792f64657369676e2f6973737565732f31333435)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/design/issues/1345\" title=\"Proposal: Await 路 Issue #1345 路 WebAssembly/design\">Proposal: Await 路 Issue #1345 路 WebAssembly/design</a></div><div class=\"message_embed_description\">@RReverser and I would like to propose a new proposal for WebAssembly: Await. The motivation for the proposal is to help \"synchronous\" code compiled to WebAssembly, that does something like a read ...</div></div></div>",
        "id": 422495235,
        "sender_full_name": "Geoff Goodman",
        "timestamp": 1708460671
    }
]