[
    {
        "content": "<p>In my work to support <a href=\"https://github.com/WebAssembly/component-model/blob/main/design/mvp/examples/SharedEverythingDynamicLinking.md\">shared-everything linking</a>, I've been wrestling with the problem of Wizer-style pre-initialization for components.  I've spoken with various folks about it, suggesting and discarding a few approaches.  I had a new idea over the weekend, which I'd like to get feedback on, particularly from <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> and <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> if/when you have time: <a href=\"https://hackmd.io/rZ2_yvhRRsqjJiKoj27MCA\">https://hackmd.io/rZ2_yvhRRsqjJiKoj27MCA</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/component-model/blob/main/design/mvp/examples/SharedEverythingDynamicLinking.md\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/35f86c9b42241b24edb90e07f1af8669dd6fcfa6\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f396331356462653538343332386461316338633630333066373436663465333936623130636562316337343830646665336634316332663464653765616563352f576562417373656d626c792f636f6d706f6e656e742d6d6f64656c)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/component-model/blob/main/design/mvp/examples/SharedEverythingDynamicLinking.md\" title=\"component-model/SharedEverythingDynamicLinking.md at main · WebAssembly/component-model\">component-model/SharedEverythingDynamicLinking.md at main · WebAssembly/component-model</a></div><div class=\"message_embed_description\">Repository for design and specification of the Component Model - component-model/SharedEverythingDynamicLinking.md at main · WebAssembly/component-model</div></div></div><div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://hackmd.io/rZ2_yvhRRsqjJiKoj27MCA\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/b37ce5483ca5f88093e39486a76c6a2b768cd6a5\\/68747470733a2f2f6861636b6d642e696f2f696d616765732f6d656469612f4861636b4d442d6f672e6a7067)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://hackmd.io/rZ2_yvhRRsqjJiKoj27MCA\" title=\"Proposal for Component Pre-initialization - HackMD\">Proposal for Component Pre-initialization - HackMD</a></div><div class=\"message_embed_description\">or</div></div></div>",
        "id": 365582097,
        "sender_full_name": "Joel Dice",
        "timestamp": 1686580113
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> am I reading this right that it would be a sort of \"component wizer\" project? I really like that you're considering making it possible to be a component itself as well. While I understand you say it could apply to many component graphs, how much of the approach do you see as tied to the needs of the dynamic linking work specifically? Would you really be able to generalize enough of the work to make the effort worthwhile? Would be great to discuss this topic further in the dynamic languages meeting as well.</p>",
        "id": 365645524,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1686594238
    },
    {
        "content": "<p>The more I think about it, the more I like this idea! I've left a comment on the document suggesting a kind of strange way of looking at the middle steps.</p>\n<p><span class=\"user-mention\" data-user-id=\"553681\">@Guy Bedford</span>, my take is that what Joel has proposed should in principle work for any component as long as the result of partial execution can be serialized as a component. (So I guess reference types, and at least some of the GC proposal, don't work.) The implementation complexity mostly comes from parsing enough of the component to find all the mutable state, then exporting the revised state in some way that the host can find it, and finally serializing the component again with those \"holes\" filled back in with the updated state. It sounds like a pretty straightforward (though not exactly easy) solution to me.</p>",
        "id": 365647548,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1686594707
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"553681\">@Guy Bedford</span>  Yes, I spoke with <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> about adding component support to Wizer, but when we dove into the details of what that would entail for both Wizer and Wasmtime, it got pretty ugly.  The proposal above avoids that ugliness by doing some strategic pre-processing of the input component.<br>\nFor the time being, I'm focused on the shared-everything linking case (and more specifically, <code>componentize-py</code>), so I haven't thought deeply yet about the general case of pre-initializing arbitrary components, but what <span class=\"user-mention\" data-user-id=\"504918\">@Jamey Sharp</span> described is what I have in mind.</p>",
        "id": 365649996,
        "sender_full_name": "Joel Dice",
        "timestamp": 1686595350
    },
    {
        "content": "<p>So this tool would still depend on Wizer? One issue we have in JS land is that we need binary builds maintained on npm of wizer (and also anything depending on wizer). hence my excitement for the possibility of supporting wasmable interpreters, over maintaining more binary builds on npm.</p>",
        "id": 365651687,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1686595813
    },
    {
        "content": "<p>No, what I've described wouldn't depend on Wizer.  And yes, I'm excited about that, too.  I've added a note to the bottom of the doc:</p>\n<blockquote>\n<p>Also note that, since there’s nothing runtime-specific about this approach, we could theoretically use a Wasm interpreter which itself compiles to Wasm and package the whole tool as a Wasm module or component.</p>\n</blockquote>",
        "id": 365652418,
        "sender_full_name": "Joel Dice",
        "timestamp": 1686596021
    },
    {
        "content": "<p>This would do the work that wizer does in a different way. It might make sense for it to be \"the new wizer\" and live in the wizer repo.</p>\n<p>It could be a multi-stage series of components: The \"wizer\" component reads the user's component and produces a new component that, when run, emits the wizened component. (This is basically my weird suggestion in Joel's document.) Then you don't need a wasm interpreter running inside wasm; whichever wasm runtime you use runs the user's code as well as the code that writes the final output.</p>",
        "id": 365653467,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1686596296
    },
    {
        "content": "<p>If there's more iterative paths as well, that wouldn't be a problem, but stating that end goal seems worthwhile to me! I am all for such a Component Wizer / Wizer v2 and the overall approach, count me on board :)</p>",
        "id": 365654275,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1686596504
    },
    {
        "content": "<p>Seems reasonable to me.</p>\n<p>Soft preference for adding this to Wizer than creating a whole new tool specifically for components of just exactly that particular shape.</p>",
        "id": 365960094,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1686681516
    },
    {
        "content": "<p>Thanks for taking a look, <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span>.  I'm not sure when I'll get around to implementing this, but I'll look at how it might fit into Wizer when I do.</p>",
        "id": 365975302,
        "sender_full_name": "Joel Dice",
        "timestamp": 1686685485
    }
]