[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253989\">@Peter Huene</span> I have the need to compose a component that uses resources, but <a href=\"https://github.com/bytecodealliance/wasm-tools/blob/30cc3aec517fff3670556bc7f28dee27c0434af8/crates/wasm-compose/src/encoding.rs#L591\">unfortunately, they're not yet implemented</a>. I'm wondering what your feeling is on the difficulty of adding resource support. I know you're in the middle of a significant rewrite, so I'm unsure if it's worth it for me to onboard to a codebase that will be changing significantly.</p>",
        "id": 395263384,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1696599889
    },
    {
        "content": "<p>I'm not exactly sure how much work is required to implement it, but I'm still several weeks out from being able to slot in the replacement code, so if this is blocking you, it might be worth investigating</p>",
        "id": 395296853,
        "sender_full_name": "Peter Huene",
        "timestamp": 1696610780
    },
    {
        "content": "<p>The replacement will definitely support resources (once I get it to that point)</p>",
        "id": 395296939,
        "sender_full_name": "Peter Huene",
        "timestamp": 1696610819
    },
    {
        "content": "<p>I have a temporary work around so if the new version will support resources, it's probably easiest for me to just wait. Thanks though!</p>",
        "id": 395300657,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1696612404
    },
    {
        "content": "<p>as a heads up I am doing a pretty large refactor to <code>wasmparser</code> and making there be a type id per kind of type instead of just one big uni-typed <code>TypeId</code>. this has a pretty big effect on a lot of wasm-tools, including <code>wasm-compose</code> so if anyone starts implementing this in <code>wasm-compose</code> give me a heads up please because we will 100% conflict with each other</p>",
        "id": 395336318,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1696631110
    },
    {
        "content": "<p>I'm interested in making a demo that passes resource handles across component boundaries, which will require at least minimal support for resources in <code>wasm-compose</code>, so I may take a crack at this early next week if nobody else has.  <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> what's the current state of your <code>wasmparser</code> refactor?</p>",
        "id": 397313702,
        "sender_full_name": "Joel Dice",
        "timestamp": 1697635809
    },
    {
        "content": "<p>It compiles but I’m still working through all the tests on the wasmparser side of things. Don’t let me hold you up if you’ve got the fire in you to start implementing resources support in wasm-compose</p>",
        "id": 397330685,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1697640773
    }
]