[
    {
        "content": "<p>I'm working on a compiler to produce a WASM image from a Java program. One of the challenges is that Java supports multiple threads; because of the unsuitability (and lack of availability) of the current Host GC proposal, we're looking at maintaining shadow stacks for each thread in order to perform in-image GC. The difficulty is one of memory management: typically a Java runtime would allocate many discontiguous regions from virtual memory to facilitate multiple downward-growing stacks and a typically upwards-growing heap, relying on the operating system to ensure that the gaps and unused areas in these regions don't consume physical memory resources. However WASM memory can seemingly only grow in one contiguous blob, which would imply that things need to be densely packed in order to avoid excessive memory usage. I was wondering if there are any discussions on how folks are handling this kind of situation?</p>",
        "id": 340618927,
        "sender_full_name": "David Lloyd",
        "timestamp": 1678371606
    },
    {
        "content": "<p>I work on the ghc wasm backend and had a similar challenge before. The haskell runtime used to assume existence of mmap/VirtualAlloc. I ended up refactoring it to optionally support grabbing memory via sbrk, maybe similar refactorings can also be done for java?</p>",
        "id": 340620591,
        "sender_full_name": "Cheng Shao",
        "timestamp": 1678371976
    },
    {
        "content": "<p>You might want to look at how TeaVM does it, e.g. <a href=\"https://github.com/konsoletyper/teavm/blob/a543b91b84bef71f0c4d60c5a1073f133963779f/core/src/main/java/org/teavm/runtime/Fiber.java\">https://github.com/konsoletyper/teavm/blob/a543b91b84bef71f0c4d60c5a1073f133963779f/core/src/main/java/org/teavm/runtime/Fiber.java</a>.  I haven't studied it in detail, but it appears to be using heap-allocated, dynamically resized arrays for each primitive and reference type.  Another option would be to support a segmented stack with fixed-sized segments which are allocated and freed as needed.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/konsoletyper/teavm/blob/a543b91b84bef71f0c4d60c5a1073f133963779f/core/src/main/java/org/teavm/runtime/Fiber.java\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/2b49c20b91e410015158886063e0ec50ec31b2b9\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f303231613632363661623962613164343164613537333862656136376137326131383534613766303261663565643135653364383130323334633238323763642f6b6f6e736f6c6574797065722f746561766d)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/konsoletyper/teavm/blob/a543b91b84bef71f0c4d60c5a1073f133963779f/core/src/main/java/org/teavm/runtime/Fiber.java\" title=\"teavm/Fiber.java at a543b91b84bef71f0c4d60c5a1073f133963779f · konsoletyper/teavm\">teavm/Fiber.java at a543b91b84bef71f0c4d60c5a1073f133963779f · konsoletyper/teavm</a></div><div class=\"message_embed_description\">Compiler of Java bytecode to JavaScript. Contribute to konsoletyper/teavm development by creating an account on GitHub.</div></div></div>",
        "id": 340622183,
        "sender_full_name": "Joel Dice",
        "timestamp": 1678372328
    },
    {
        "content": "<p>BTW, I think Java developers know to expect size-limited stacks by now, so if you anticipate that the number of threads per app is going to be relatively low, and that memory is not particularly constrained, you could keep it simple and just allocate a fixed-sized stack (e.g. 512KB) per thread, generating a <code>StackOverflowError</code> if it overflows.</p>",
        "id": 340625938,
        "sender_full_name": "Joel Dice",
        "timestamp": 1678373089
    }
]