[
    {
        "content": "<p>tschneidereit opened <a href=\"https://github.com/bytecodealliance/rfcs/issues/6\">Issue #6</a>:</p>\n<blockquote>\n<p>Over in #1, @joshtriplett <a href=\"http://1#issuecomment-731364357\">highlighted</a> that we haven't yet defined a process for resolving conflicts that might otherwise leave RFCs in limbo indefinitely. We shouldn't put this off for too long, and instead aim to have it in place before the first such case occurs.</p>\n</blockquote>",
        "id": 218426491,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1606831973
    },
    {
        "content": "<p>joshtriplett <a href=\"https://github.com/bytecodealliance/rfcs/issues/6#issuecomment-740480198\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/issues/6\">Issue #6</a>:</p>\n<blockquote>\n<p>Concrete proposal, based on some discussions in the Rust project:</p>\n<p>Any one stakeholder may register an objection to a proposal. There is minimum discussion period associated with such an objection, to give people time to discuss and consider. After that discussion period, to continue to maintain the objection, at least one other stakeholder must second the objection; seconding does not imply agreement with the objection itself, only that the objection has some merit and that there's value in continuing to hear it out. (Seconding objections that you don't necessarily agree with is encouraged; declining to second an objection means you believe that it both has been fully heard and discussed, that nothing would be gained by further discussion, and that no resolution seems likely to be possible.) If an objection is not seconded, the objector is encouraged to write a \"dissenting opinion\", which should be incorporated into RFCs or similar in an appropriate section (e.g. \"alternatives\" or \"open questions\"), but is asked to \"disagree and commit\" to the team consensus. (This does <em>not</em> preclude them from raising other issues in good faith, or from raising related issues if new information comes to light; this should not be used to silence subsequent discussion, only used to allow the process to move forward without repetition.)</p>\n<p>In other words, if a stakeholder wishes to block something beyond a reasonable initial period, they need to convince at least one other stakeholder that there's an issue that has not yet been fully heard or discussed or understood. If they can convince at least one other stakeholder, that objection can stand indefinitely; that seems reasonable, as we should strongly aim for full consensus and not override objections lightly. If they cannot convince a <em>single</em> other stakeholder that there's any more to hear out, and everyone believes that there's no consensus to be had, it's possible to move forward.</p>\n<p>I'm proposing this based on having experience in all three roles: as the person with the sole objection, as a person arguing that someone else's objection should be heard further, and as a person who has seen objections that did not have any support from the rest of the team.</p>\n<p>I would also encourage something like the following, to help people reach consensus:</p>\n<p>Before resorting to this process to override an objection, try to reach a consensus if at all possible. In particular, note that many seemingly intractable discussions stop once they reach questions that one or more stakeholders consider related to their values or similarly core considerations. Rather than treating this as the end of a discussion, however, this can be the start of the most critical part of the discussion. Many interesting questions come down to evaluations of such values and the tradeoffs between them.</p>\n</blockquote>",
        "id": 219183730,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1607417623
    }
]