[
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1204095621\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>Personally this all sounds great to me, I'm excited to see this take shape! I'm think that reusing Cranelift backends is a great idea and I think the integration strategy chosen here (no tiering yet) is the right answer for now. </p>\n<p>I suspect that various abstractions in Wasmtime which baseline compilation would want to use are not as optimal as they could be as-implemented today. We haven't focused much on compile time performance and Cranelift often dwarfs any cost in Wasmtime or other parts of the system, but I think having a baseline compiler push on these abstractions to optimize them is a great forcing function to have. Mostly just saying this as a word of caution that there may be some surprsing bottlenecks come time for performance measurements but it should all be easy enough to handle.</p>\n<p>Lastly one thing I might recommend is if possible getting AArch64 support up and running as soon as possible. In such an architecture-specific context as a baseline compiler adding a second architecture I find can often radically change existing designs so getting that forcing function sooner rather than later may be helpful. That being said I don't think it's necessary to push on it immediately and if y'all would prefer to defer it to the second phase as you've mentioned here I also think that's ok.</p>\n</blockquote>",
        "id": 291865601,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659539962
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1205532100\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>This paper may be useful:</p>\n<p><a href=\"https://arxiv.org/abs/2011.13127\">https://arxiv.org/abs/2011.13127</a>: Copy-and-Patch Compilation: A fast compilation algorithm for high-level languages and bytecode</p>\n<blockquote>\n<p>Our WebAssembly compiler generates code 4.9X-6.5X faster than Liftoff, the WebAssembly baseline compiler in Google Chrome. The generated code also outperforms Liftoff's by 39%-63% on the Coremark and PolyBenchC WebAssembly benchmarks. </p>\n</blockquote>\n<p>In the future if an interpreter tier is added below the baseline compiler the following is also interesting:</p>\n<p><a href=\"https://arxiv.org/abs/2205.01183\">https://arxiv.org/abs/2205.01183</a>: A fast in-place interpreter for WebAssembly</p>\n<blockquote>\n<p>Our evaluation shows that in-place interpretation of Wasm code is space-efficient and fast, achieving performance on-par with interpreting a custom-designed internal format.</p>\n</blockquote>\n</blockquote>",
        "id": 292040006,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659632674
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1205585917\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<p>This paper may be useful:</p>\n<p><a href=\"https://arxiv.org/abs/2011.13127\">https://arxiv.org/abs/2011.13127</a>: Copy-and-Patch Compilation: A fast compilation algorithm for high-level languages and bytecode</p>\n<blockquote>\n<p>Our WebAssembly compiler generates code 4.9X-6.5X faster than Liftoff, the WebAssembly baseline compiler in Google Chrome. The generated code also outperforms Liftoff's by 39%-63% on the Coremark and PolyBenchC WebAssembly benchmarks.</p>\n</blockquote>\n</blockquote>\n<p>The paper is indeed really interesting, but the approach it takes is not terribly compatible with the goals that we have; in particular we don't want to depend on a C++ compiler and template specialization, and relocation magic, and then gluing together the machine code that comes from that separate offline process, to generate the actual bits of code. An equally important goal of the baseline compiler is to be straightforward to understand and modify; as such, a very simple \"emit these three instructions for this Wasm opcode\" mapping is ideal for maintainability.</p>\n</blockquote>",
        "id": 292046713,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659635673
    },
    {
        "content": "<p>saulecabrera <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1205587460\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>During today's wasmtime meeting, we discussed @fitzgen's and @alexcrichton's feedback around aarch64 support; we concluded that lowering the priority of Reference Types and bumping the priority of supporting at least a subset of  aarch64 is probably the best path forward for the initial implementation. I've made the necessary changes to reflect this decision. </p>\n</blockquote>",
        "id": 292046852,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659635760
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1206262855\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<p>in particular we don't want to depend on a C++ compiler and template specialization, and relocation magic, and then gluing together the machine code that comes from that separate offline process, to generate the actual bits of code.</p>\n</blockquote>\n<p>Would it be possible to replace C++ with Cranelift IR? It could then be compiled at build time and at runtime.</p>\n</blockquote>",
        "id": 292130975,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659692982
    },
    {
        "content": "<p>saulecabrera <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1206410162\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>in particular we don't want to depend on a C++ compiler and template specialization, and relocation magic, and then gluing together the machine code that comes from that separate offline process, to generate the actual bits of code.</p>\n</blockquote>\n<p>Would it be possible to replace C++ with Cranelift IR? It could then be compiled at build time and at runtime.</p>\n</blockquote>\n<p>Personally I think that even if possible, this approach would still not be compatible with the design principles that we've laid out, mainly around (i) simplicity and (ii) no intermediate representation. In general I think that it might be worth thinking about keeping the implementation as simple and straight forward as possible. </p>\n</blockquote>",
        "id": 292148883,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659703772
    },
    {
        "content": "<p>saulecabrera edited a <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1206410162\">comment</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>in particular we don't want to depend on a C++ compiler and template specialization, and relocation magic, and then gluing together the machine code that comes from that separate offline process, to generate the actual bits of code.</p>\n</blockquote>\n<p>Would it be possible to replace C++ with Cranelift IR? It could then be compiled at build time and at runtime.</p>\n</blockquote>\n<p>Personally I think that even if possible, this approach would still not be compatible with the design principles that we've laid out, mainly around (i) simplicity and (ii) no intermediate representation. In general I think that it might be worth thinking about keeping the implementation as simple and straightforward as possible. </p>\n</blockquote>",
        "id": 292156739,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1659707661
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234652060\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>I want to expand on @bjorn3's suggestions. But, to be clear, I'm not going to argue that this alternative should replace the current RFC. If this RFC is the direction that you want to pursue, @saulecabrera, then I see no reason the rest of us shouldn't support you in that. That said, here's an alternative that I think has some advantages.</p>\n<p>Imagine that for each WebAssembly instruction, we write down a sequence of Cranelift instructions to implement it, with holes for registers and labels. (To keep this short, I'm hand-waving things like control-flow.) That's basically what <code>cranelift/wasm/src/code_translator.rs</code> is, if you squint.</p>\n<p>We currently get an optimizing WebAssembly compiler by filling those CLIF sequences with virtual registers from abstract interpretation, concatenating the snippets, and then handing the result off to Cranelift.</p>\n<p>We could instead get a baseline compiler from those snippets of CLIF by compiling each snippet to native code in isolation, and then concatenating the compiled snippets. Compiling the snippets to native code can happen during the wasmtime build if desired. The number of variations we need to compile of each snippet is bounded by the number of physical registers used to shadow the wasm stack. This is essentially Copy-and-Patch, but using the compiler we already maintain instead of a C++ compiler.</p>\n<p>And we could also get an interpreter by inserting those CLIF snippets into a dispatch loop, also written in CLIF, with register holes filled in by loads and stores to an explicit value stack. The \"fast in-place interpreter\" paper implemented the interpreter in native assembly because they couldn't control the generated code well enough from a high-level language, but I believe Cranelift IR gives us everything we'd need while being able to compile the interpreter for multiple architectures. (Chris tells me this resembles Spidermonkey's \"baseline interpreter\".)</p>\n<p>I like this approach because we'd get three tiers, all supporting every target architecture, while only having to implement new instructions once. That appeals to me for giving us confidence that the tiers are all equally correct implementations.</p>\n</blockquote>",
        "id": 296678498,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662057909
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234695228\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<p>Compiling the snippets to native code can happen during the wasmtime build if desired. The</p>\n</blockquote>\n<p>I think this would be necessary to meet performance goals, since otherwise we would be materializing a bunch of IR that we wouldn't need to if we didn't do this approach.</p>\n<p>Not clear what kind of impact this would have on the Wasmtime crate's compile times, but that is something I would be concerned about.</p>\n<blockquote>\n<p>I like this approach because we'd get three tiers, all supporting every target architecture, while only having to implement new instructions once. That appeals to me for giving us confidence that the tiers are all equally correct implementations.</p>\n</blockquote>\n<p>Yes, this is pretty nice. Tempting. I like using CLIF to side step using a C++ compiler and making a super hacky post-processing linker that chops off prologues and epilogues and patches control flow together. I like having control over the shape of the code that we would paste together, so we can be sure we aren't messing up edge cases.</p>\n<p>But also, this is a bit more work to get to an initial baseline compiler implementation than what the RFC proposes.</p>\n</blockquote>",
        "id": 296686274,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662060654
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234791422\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>I do like @jameysharp 's idea here, from first principles: it would be a nice way to be able to obtain a series of compilers from one source-of-truth. We should experiment with this in the future, I think.</p>\n<p>The tradeoff space I see right now is, on the one hand, a \"handwritten straightforward baseline compiler (this RFC) with the advantages of:</p>\n<ul>\n<li>Simple to verify by looking: one sees exactly the instructions that will be emitted for any given opcode, locked down in the source and not indirectly from any other toolchain or generation process;</li>\n<li>Simpler to add new opcodes to than Cranelift. While on the one hand if we assume that all features will be in Cranelift so leveraging this work is \"free\", on the other hand in practice engines that have a separate baseline tier (like SpiderMonkey) often add features to the baseline compiler <em>first</em>, because it's an order of magnitude simpler. This could allow us to build out early support for some features and experiment more freely before we work out the details of a high-performance, optimizing-tier implementation.</li>\n<li>A separate implementation adds \"verification diversity\": we can differentially fuzz Cranelift against this new backend and possibly find issues.</li>\n</ul>\n<p>On the other hand:</p>\n<ul>\n<li>A copy-and-patch-like approach that stitches together Cranelift-compiled fragments can much more flexibly grow its \"library\" into many op-combining possibilities. This would be a natural design point between an op-by-op baseline compiler / template-JIT (this RFC) and a full optimizing tier. \"Macro-op fusion\" is still a single-pass approach so retains compile speed while possibly getting pretty decent isel.</li>\n<li>If we assume that the Cranelift implementation is a sunk cost, then this does give us baseline compiler support for new features as we add them for \"free\". We just need to pay for the complexity and effort to build the framework once.</li>\n</ul>\n<p>also, to amplify and add a bit to @fitzgen's point here</p>\n<blockquote>\n<p>Not clear what kind of impact this would have on the Wasmtime crate's compile times, but that is something I would be concerned about.</p>\n</blockquote>\n<p>I'd be concerned about build <em>complexity</em> as well: this implies a \"bootstrap compiler\" that is built during the compiler build process to compile another compiler (or data that is embedded into it); that's probably nontrivial cost. And it implies that Cranelift itself is at least a dev-dependency of the baseline compiler, which may or may not be desirable.</p>\n<p>On balance I think I still favor the approach in this RFC, but these ideas are intriguing for a possible later exploration (so thanks again for raising them!).</p>\n</blockquote>",
        "id": 296701225,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662066978
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234800627\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>Thanks, Nick and Chris! I generally agree with both of you, although I'd quibble about the value of implementation diversity: we already have plenty of wasm implementations to use for differential testing. I have more thoughts on engineering details such as build time and build complexity, but I don't want to sidetrack discussion on this RFC further. So unless consensus swings towards implementing the copy-and-patch thing, I'll leave it at that.</p>\n</blockquote>",
        "id": 296702618,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662067578
    },
    {
        "content": "<p>saulecabrera <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234850470\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<p>Thanks for expanding on this @jameysharp; I find your thoughts interesting here, mostly from the perspective of maximizing reusability and correctness. I must admit that one of the biggest unknowns for me, is the build-time complexity that this approach will/might introduce and what will be the ROI of that cost; in paper the ideas seem compelling, but I find it a bit hard to quantify in the scope of Wasmtime without more investment/investigation in that direction.</p>\n<p>Expanding on @cfallin's point above around the simplicity to add new features:</p>\n<p>One side-effect that I'm hoping to get with the current proposal (which is not explicit in the RFC and perhaps I should add it), is to make easier to add and maintain developer-facing features, the main feature that I have in mind is debugging. I feel that with the Copy-and-Patch approach, this will be more difficult to achieve (this is purely an assumption, so I might be wrong here). </p>\n<p>On correctness: FWIW, we discussed (and the RFC states) integrating fuzzing in phase 1 to ensure a correctness-first approach; this doesn't void the fact that having a single source of truth is potentially less error-prone. </p>\n<p>In conclusion my feeling is that switching the approach has the potential to bring in  a set of desirable benefits, but we'd need to deal with more unknowns/complexity. The approach that we have today, offers a higher level of certainty in terms of maintenance, compilation and runtime performance in the scope of Wasmtime. That said, if there's a way to leave the door open to incrementally investigate this down the road, on top of the current proposal, I think we should consider it. </p>\n</blockquote>",
        "id": 296709565,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662071225
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/rfcs/pull/28#issuecomment-1234867015\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">issue #28</a>:</p>\n<blockquote>\n<blockquote>\n<p>In conclusion my feeling is that switching the approach has the potential to bring in a set of desirable benefits, but we'd need to deal with more unknowns/complexity. The approach that we have today, offers a higher level of certainty in terms of maintenance, compilation and runtime performance in the scope of Wasmtime.</p>\n</blockquote>\n<p>I agree. My guess is that copy-and-patch would let us maintain less total code in the end, but compared to the RFC, it's definitely not as clear how we get from here to there.</p>\n<blockquote>\n<p>That said, if there's a way to leave the door open to incrementally investigate this down the road, on top of the current proposal, I think we should consider it.</p>\n</blockquote>\n<p>I don't think there's anything about the current RFC that makes it hard to do something like copy-and-patch later. As long as Wasmtime has a path that still uses Cranelift, we can try slicing it up any time. We absolutely don't have to choose one approach or the other.</p>\n<p>On the other hand, I don't think the work outlined in this RFC helps much with implementing copy-and-patch. So, _if_ folks felt like that was something we want to do in the short term, then we could save some effort overall by going straight there. But since copy-and-patch has more uncertainty and engineering risk, I think it's reasonable to follow the RFC's plan first.</p>\n<blockquote>\n<p>One side-effect that I'm hoping to get with the current proposal (which is not explicit in the RFC and perhaps I should add it), is to make easier to add and maintain developer-facing features, the main feature that I have in mind is debugging.</p>\n</blockquote>\n<p>I think that would be a great note to add to the RFC, as well as these points that Chris made:</p>\n<blockquote>\n<ul>\n<li>\n<p>Simple to verify by looking: one sees exactly the instructions that will be emitted for any given opcode, locked down in the source and not indirectly from any other toolchain or generation process;</p>\n</li>\n<li>\n<p>Simpler to add new opcodes to than Cranelift. [...] in practice engines that have a separate baseline tier (like SpiderMonkey) often add features to the baseline compiler _first_, because it's an order of magnitude simpler. This could allow us to build out early support for some features and experiment more freely before we work out the details of a high-performance, optimizing-tier implementation.</p>\n</li>\n</ul>\n</blockquote>\n</blockquote>",
        "id": 296711938,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1662072801
    }
]