[
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/rfcs/pull/26#issuecomment-1170166172\">commented</a> on <a href=\"https://github.com/bytecodealliance/rfcs/pull/26\">issue #26</a>:</p>\n<blockquote>\n<p>Thanks for taking the time to write this up, but as I read over it at least personally the main impression that I get is that this is a lot of work and process for not a lot of gain. These sorts of things seem good to write down eventually in the future but for now it feels to me like we have much bigger issues in wit-bindgen around issues like:</p>\n<ul>\n<li>The component model is still a moving target that wit-bindgen hasn't caught up to. There's significant divergence in the current implementation of async/futures/etc between the predicted path of the component model and wit-bindgen as-is today.</li>\n<li>In wit-bindgen features like resource types don't even exist in the component model yet.</li>\n<li>Support for streams in wit-bindgen doesn't exist beyond parsing, and it's unclear how this will play out in each language.</li>\n<li>The interface of wit-bindgen itself (\"what exactly do you write down\") in terms of what are the inputs and what are the outputs is itself still in flux.</li>\n</ul>\n<p>Overall this seems like the wrong time to add process to a situation that mainly needs foundational work to make progress. Unfortunately this work isn't just exclusive to wit-bindgen as there's a lot of coordination that also needs to happen with the component-model proposal, various consumers, etc. </p>\n<p>Reflecting on this now I'm personally thinking that it would be better to flesh out wit-bindgen itself and its implementation before going much further down the path for a release process and versioning and such. For example with Wasmtime <a href=\"https://github.com/bytecodealliance/rfcs/pull/11\">first the API had an RFC</a> and afterwards there was a <a href=\"https://github.com/bytecodealliance/rfcs/pull/14\">Wasmtime 1.0 RFC</a>. This sort of feels like the inverse order of operations is happening for wit-bindgen and I think that's at least one reason this feels premature aftering seeing it laid out.</p>\n</blockquote>",
        "id": 287876826,
        "sender_full_name": "RFC notifications bot",
        "timestamp": 1656518251
    }
]