[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253992\">@Pat Hickey</span> <span class=\"user-mention\" data-user-id=\"421591\">@Bailey Hayes</span> is there anything that I need to do on my side to move the repo into the WebAssembly org? Do I need to fork the wasi-proposal-template?</p>",
        "id": 421247093,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707832179
    },
    {
        "content": "<p>oh, right, I just did this for wasi-observe with <span class=\"user-mention\" data-user-id=\"418102\">@Chris Dickinson</span> - the process that worked, at least for that case, was to transfer ownership of the repo to me (pchickey on github), and then i have the permissions to transfer it into the webassembly org, and then once thats complete i need to re-add you and your co-chair as admins of the repo. sound good?</p>",
        "id": 421289283,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707844449
    },
    {
        "content": "<p>Fine with me, just not sure the current repo has the right structure.</p>",
        "id": 421291587,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707845280
    },
    {
        "content": "<p>Does the repo need to be a fork of wasi-proposal-template?</p>",
        "id": 421291672,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707845300
    },
    {
        "content": "<p>yes, it should be, if possible</p>",
        "id": 421292001,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707845425
    },
    {
        "content": "<p>if something about that template is really not the right shape, lets talk about it</p>",
        "id": 421292036,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707845438
    },
    {
        "content": "<p>if you are going to migrate stuff to a different shape by hand, i can make a fork of the template for you under WebAssembly and give you the right permissions, and then you can just go from there?</p>",
        "id": 421292123,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707845476
    },
    {
        "content": "<p>Yeah, let's do that.</p>",
        "id": 421292853,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707845751
    },
    {
        "content": "<p>Should I move everything over including the examples, or just the wit?</p>",
        "id": 421292870,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707845757
    },
    {
        "content": "<p>im not sure what the best policy is for examples. the standards process is pretty keen to separate implementations (e.g. wasmtime-wasi, wasmtime-wasi-http, wasmtime-wasi-nn) from the specs themselves. in the cases where we have put implementations under the webassembly org, its actually created some problems (e.g. what is the process for early disclosure of a security problem in wasi-libc? well, we dont have one, because the standards body doesnt really have a way to do non-public things). otoh, if the examples are instructive to show people how implementations should work, that seems appropriate to be in the proposal repo (and maybe as we start doing tests for many different proposals we will do it in individual proposal repos rather than centralize it in WebAssembly/wasi-testsuite like exists today)</p>",
        "id": 421293326,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707845928
    },
    {
        "content": "<p>so, i guess based on that guidance, you can make your best judgement for whether examples belong inside your proposal repo, or out in some other repo where an \"implementation\" lives</p>",
        "id": 421293454,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707845974
    },
    {
        "content": "<p>In that case, I think I'll keep them separated for now.</p>",
        "id": 421293667,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707846043
    },
    {
        "content": "<p>whats your github username? as well as any other co-maintainers</p>",
        "id": 421293839,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707846115
    },
    {
        "content": "<p>MendyBerger<br>\nseanisom</p>",
        "id": 421294006,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707846169
    },
    {
        "content": "<p>thanks - admin invites sent to both</p>",
        "id": 421294083,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1707846201
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 421294131,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1707846220
    }
]