[
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1179469543\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>This patch is a replacement for #3740</p>\n<p>Results currently look like this: <a href=\"https://github.com/jlb6740/wasmtime/pull/3#issuecomment-1179394254\">https://github.com/jlb6740/wasmtime/pull/3#issuecomment-1179394254</a></p>\n</blockquote>",
        "id": 289015356,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1657337049
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1180654481\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>This is looking quite nice! Would it be possible to add <code>bytecodealliance/wasmtime-sightglass-benchmarking/.github/workflows/main.yml</code> to this repository as well? I think it'd be ideal if we could have everything in this repository if we can.</p>\n<p>Instead of a <code>curl</code> to send a repository dispatch to the private repository I'd imagine that we could instead push to a branch? For example the commit that wants to be benchmarked could be checked out as part of this workflow and then pushed to a special branch name in the private repository. The \"actually run the benchmark\" perf run would then trigger on this special branch name and do everything it's already doing today.</p>\n<p>Review-wise I think it'd be best to be able to edit the workflow publicly in this repository rather than juggling hidden state elsewhere.</p>\n</blockquote>",
        "id": 289221299,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1657559149
    },
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1182525641\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<blockquote>\n<p>This is looking quite nice! Would it be possible to add <code>bytecodealliance/wasmtime-sightglass-benchmarking/.github/workflows/main.yml</code> to this repository as well? I think it'd be ideal if we could have everything in this repository if we can.</p>\n</blockquote>\n<p>I would definitely like that as well, but how is it possible?</p>\n<blockquote>\n<p>Instead of a <code>curl</code> to send a repository dispatch to the private repository I'd imagine that we could instead push to a branch? For example the commit that wants to be benchmarked could be checked out as part of this workflow and then pushed to a special branch name in the private repository. The \"actually run the benchmark\" perf run would then trigger on this special branch name and do everything it's already doing today.</p>\n</blockquote>\n<p>@alexcrichton Would you like to see this refactor before merging this patch? Currently I am not sure how what you describe would work. The yml file that executes commands to download the correct sightglass, mainline, and patch, I would think needs to be associated with the private repo. That self-hosted runner executes the run steps in the github action yml so that needs to be part of the private repo's github actions. By putting logic here to push a patch to the private server I don't see yet what that really accomplishes. It introduces a patch on the private server but for what purpose? Currently the private server (that gets it's run steps from the yml) downloads the patch. The patch is never duplicated on any other branch, it just lives at its home of its original feature branch. Also, I am not sure how that would work when multiple requests at the same time?  In short, I don't yet see a way to accomplish the interesting steps in this repository alone. My thoughts are that while I completely agree from a review standpoint that it would be best to have all logic in one place, the private repository is that place and can be checked and has it's own review process. I don't think we have to sacrifice correctness. Just treat it like any other API .. when there is an issue just have to know which side to make the changes. From the wasmtime perspective, the curl statement sends a request to the private repository where the private repository is now a black box. If we want to scrutinize or update the logic the black box is doing, we just have to do it there.</p>\n<blockquote>\n<p>Review-wise I think it'd be best to be able to edit the workflow publicly in this repository rather than juggling hidden state elsewhere.</p>\n</blockquote>\n<p>Again, I do agree.</p>\n</blockquote>",
        "id": 289389351,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1657662018
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1183356605\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>I would envision adding the workflow to this repository as:</p>\n<ul>\n<li>The <code>on:</code> condition is only for branches that are named <code>perf-test-*</code>. This means it won't run for the main bytecodealliance repo</li>\n<li>The workflow added to this repo would run on a custom runner. The custom runner is only added to the private repo. This is ok since it won't actually run in the public repo.</li>\n<li>Otherwise the workflow in the private repo is basically the same, it checks out the branch whenever a push happens to <code>perf-test-*</code> and it could post results back to the PR when done.</li>\n</ul>\n<p>Otherwise from this action added here the main difference would be instead of a <code>curl</code> a <code>git push</code> is done to a <code>perf-test-*</code> branch in the private repository.</p>\n<blockquote>\n<p>Would you like to see this refactor before merging this patch?</p>\n</blockquote>\n<p>Personally I would say yes. Having everything in one repo seems like a foundational shift relative to what you've currently got working which probably won't happen if we don't do it to start out with. </p>\n<blockquote>\n<p>Also, I am not sure how that would work when multiple requests at the same time?</p>\n</blockquote>\n<p>One idea would be for PR number N to push to <code>perf-test-N</code> so that way multiple PRs don't conflict.</p>\n<blockquote>\n<p>the private repository is that place and can be checked and has it's own review process</p>\n</blockquote>\n<p>The major downside, infrastructurally, is that you can't change atomically change the perf process in a PR to wasmtime. That means that the Wasmtime configuration to schedule a perf run must be kept in sync with the private repo's configuration. By having all the configuration in one place we can change everything at once in a single PR. Needing two PRs is not only cumbersome but runs the risk of breakage since the repos could get out of sync with each other.</p>\n</blockquote>",
        "id": 289474503,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1657725481
    },
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1220951520\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>@fitzgen @cfallin Hi guys .. had a good chat with @alexcrichton today and flushed out some concerns about the refactoring suggestion made. Its good to try the refactoring now. Since this is an anticipated patch, if there are any unanticipated roadblocks with the refactor we will look to merge this as is and address the refactor concern later, but we think the refactoring should work as expected. The idea is to have as much logic here as possible. Will start on that next week and hopefully have this ready for review the week after when @alexcrichton is back. I do anticipate that once the actions is updated there will be new comments and concerns to address before merger which is fine, so do anticipate that.</p>\n</blockquote>",
        "id": 294334579,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1660931512
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1220955256\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>SGTM, really excited to get this up and running soon!</p>\n</blockquote>",
        "id": 294335483,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1660931810
    },
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1246976135\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>@alexcrichton Note, this latest patch is intended to address previous comments.</p>\n</blockquote>",
        "id": 298798724,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1663170938
    },
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1248677932\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<blockquote>\n<p>Looks great to me, thanks again for your patience!</p>\n<p>I've got some minor nits below but it's fine to defer any or all of them to later if you'd prefer. Do you need me to configure any tokens or such in the repo before/after merging to have this work?</p>\n</blockquote>\n<p>@alexcrichton No thanks for your patience! I think the refactoring works as imagined and is definitely an improved workflow as it combines everything in one patch and reduces logic. @alexcrichton @fitzgen @abrown I think this is ready to merge and iterate on. The only question I have is are the tokens workable. I believe they are, but of course those can be updated too.</p>\n</blockquote>",
        "id": 299058638,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1663279230
    },
    {
        "content": "<p>jlb6740 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421#issuecomment-1248750554\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4421\">issue #4421</a>:</p>\n<blockquote>\n<p>Example output is here: <a href=\"https://github.com/jlb6740/wasmtime/pull/10\">https://github.com/jlb6740/wasmtime/pull/10</a><br>\nNote, the comment trigger /bench_x64 needs to be posted via the \"review\" comment box. It is not triggered by simply leaving a comment here in the \"issue\". </p>\n</blockquote>",
        "id": 299067321,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1663284256
    }
]