[
    {
        "content": "<p>jameysharp opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7668\">issue #7668</a>:</p>\n<blockquote>\n<h4>Feature</h4>\n<p>The Firefox profiler format supports annotating timestamps or time-ranges with \"markers\", to show particular events on the same timeline as the profile. We could use markers in the guest profiler to indicate when profiling was suspended due to running a host-call.</p>\n<h4>Benefit</h4>\n<p>The guest profiler specifically only profiles WebAssembly guest code, so any time spent in host-calls is just absent from the profile. We'd present a more complete picture by marking those intervals so the user can see where host-calls happened, how long they took, and ideally what host-call was issued.</p>\n<h4>Implementation</h4>\n<p>As a starting point, Wasmtime's <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Store.html#method.call_hook\"><code>Store::call_hook</code></a>, or its async variant, allows registering a callback for both exit from and entry to the guest. I don't think we can find out _what_ host-call triggered the exit that way, though.</p>\n<p>Also we don't get a reference to the <code>Store</code> in the callback, so we can't sample the stack at that point. That might be an oversight in the call-hook API.</p>\n<h4>Alternatives</h4>\n<p>The profiler is usable without these markers. A long-running host-call just appears as a gap in the profile's timeline.</p>\n<p>We might be able to do something with the <code>Linker</code> to wrap all the configured host-calls, rather than using the <code>call_hook</code>. That should at least allow us to record which host-call triggered each exit.</p>\n</blockquote>",
        "id": 406865576,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702084118
    },
    {
        "content": "<p><a href=\"https://github.com/jameysharp\">jameysharp</a> added the enhancement label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7668\">Issue #7668</a>.</p>",
        "id": 406865597,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702084130
    },
    {
        "content": "<p><a href=\"https://github.com/jameysharp\">jameysharp</a> added the wasmtime label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7668\">Issue #7668</a>.</p>",
        "id": 406865598,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702084131
    }
]