[
    {
        "content": "<p>akirilov-arm labeled <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1583\">issue #1583</a>:</p>\n<blockquote>\n<p>The names <code>PrimaryMap</code> and <code>SecondaryMap</code> are misleading and un-descriptive.  For the benefit of readers and maintainers of Cranelift, and especially newcomers, I propose we give them better names.</p>\n<ul>\n<li>\n<p>The <code>Map</code> component is misleading.  Neither type possesses what I think of as the primary characteristic of a map (in the sense of Rust <code>HashMap</code>, libstdc++ <code>map</code>, etc), which is O(1 + epsilon) access time for sparse keys.  The new names shouldn't include the text <code>Map</code>.</p>\n</li>\n<li>\n<p>These types are in fact vectors, and you need to know that to use them reasonably (meaning, they only work well for dense zero-based key ranges) but there's nothing in the name to suggest that.</p>\n</li>\n<li>\n<p><code>Primary</code> and <code>Secondary</code> suggest some relationship between individual maps which simply doesn't exist.  This confused me for some time when I first came to the code base.  I thought: how do I find all the <code>SecondaryMaps</code> associated with a <code>PrimaryMap</code>?  Are they connected via some Rust type system magic?  Or is it done at run time; if so is there some registry I should consult?  This is of course totally irrelevant; there is no such connection.</p>\n</li>\n</ul>\n<p>I suggest to rename <code>PrimaryMap</code> to <code>FixedSizeVec</code> and <code>SecondaryMap</code> to <code>AutoResizeVec</code>:</p>\n<ul>\n<li>\n<p>it doesn't claim they are maps, which they aren't</p>\n</li>\n<li>\n<p>it does claim they are vectors, which they are</p>\n</li>\n<li>\n<p>it doesn't claim any relationship between them, which there isn't</p>\n</li>\n<li>\n<p>it correctly summarises the essential difference between them: one is fixed size, the other resizes (upwards) on demand.</p>\n</li>\n</ul>\n<p>I believe that accurate naming is important, and this would be a small but important step in making Cranelift easier to understand.  If there is general support I will happily prepare a patch.<br>\n</p>\n</blockquote>",
        "id": 255808232,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1633122706
    }
]