[
    {
        "content": "<p>jameysharp edited <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6697\">PR #6697</a>:</p>\n<blockquote>\n<p>We discussed this in today's Wasmtime meeting and the consensus was that we trust each of these people to have a sufficient standard of care for anything they release.</p>\n<p>This reduces our estimated audit backlog by about 184 kLOC.</p>\n<p>For the most part, the trust records I'm adding here are identical to trust records that Mozilla is using. The fact that they've also decided these publishers are trustworthy is reassuring additional evidence for our decision. The exceptions and notable cases are as follows:</p>\n<p>I've chosen to not trust three crates by these authors that Mozilla did not trust. I suspect Mozilla simply doesn't use these crates or has manually audited them, rather than there being any problem with the crates themselves. But I've chosen to be conservative about what we trust.</p>\n<ul>\n<li>autocfg: we only have an exception for an old version, and that version is only used transitively by wasi-crypto.</li>\n<li>env_logger: Mozilla has audited some versions; we should update, or add delta audits.</li>\n<li>thread_local: only used by tracing-subscriber which is only used in dev-dependencies.</li>\n</ul>\n<p>I've trusted one crate that Mozilla did not: libm, when published by Amanieu. We're trusting libc when published by the same author, and libm is a small extension of the same trust.</p>\n<p>Recent versions of the toml crate have been published by epage so I looked at in this process, but Mozilla only trusts the older versions which were published by alexcrichton. They've been delta-auditing the newer versions. I've chosen to follow their lead on this; Alex is a trusted contributor to Wasmtime anyway.</p>\n<p>This PR is a step toward #6672, but I've run <code>cargo vet</code> myself rather than relying on anyone else's vetting.</p>\n</blockquote>",
        "id": 373035942,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1688683514
    },
    {
        "content": "<p>cfallin submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6697#pullrequestreview-1517546668\">PR review</a>.</p>",
        "id": 373047274,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1688688992
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6697\">PR #6697</a>.</p>",
        "id": 373241361,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1688742259
    }
]