[
    {
        "content": "<p>jeffcharles opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4018\">issue #4018</a>:</p>\n<blockquote>\n<h4>Feature</h4>\n<p>I'd like a way to retrieve the name of the invoked hostcall in a <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Store.html#method.call_hook\">call hook</a>. Ideally getting the arguments and return values would also be useful.</p>\n<h4>Benefit</h4>\n<p>Adding this feature would allow me to log the name of the invoked hostcall. We have third party developers writing wasm modules running on something we've built around wasmtime and we'd like to offer a trace feature so those developers can see what hostcalls are being invoked and roughly when they are invoked relative to other parts of their modules. Including arguments and return values could also be useful in that context.</p>\n<h4>Implementation</h4>\n<p>I do not have an implementation plan at this time.</p>\n<h4>Alternatives</h4>\n<p>I'd be open to using a different API than the call hook one if it allows me to do something similar where a callback is invoked with sufficient context available to determine the hostcall name. Alternatively, if there were a way to define a decorator around the WASI hostcalls, that could also work, since I could just instrument other hostcalls.<br>\n</p>\n</blockquote>",
        "id": 278705475,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1649775695
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4018#issuecomment-1097034042\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4018\">issue #4018</a>:</p>\n<blockquote>\n<p>One idea I had for this is some sort of injection wrapper in <code>Linker</code> where you could have something like <code>Linker::pre_hook</code> or similar. A small caveat is that you'd have to define said <code>pre_hook</code> before calling any other <code>Linker</code> function to define an item, but that's not necessarily the end of the world.</p>\n<p>Another idea is a specific hook on <code>WasiCtxt</code> itself, although that would probably want integration with <code>wiggle</code> to generate calls to such a hook rather than us having to manually do it.</p>\n<p>In both of these schemes though you wouldn't have access to parameters or return values. That's actually pretty difficult to do I think in the sense that having a uniform representation for arguments and returns can generally be quite inefficient.</p>\n<p>If all you need is logging though <code>wasi-common</code> should already have logs for arguments in/out of hostcalls, so if the end goal is just a few prints that may suffice as well?</p>\n</blockquote>",
        "id": 278730700,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1649786839
    },
    {
        "content": "<p>jeffcharles <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4018#issuecomment-1098524563\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4018\">issue #4018</a>:</p>\n<blockquote>\n<blockquote>\n<p>If all you need is logging though wasi-common should already have logs for arguments in/out of hostcalls, so if the end goal is just a few prints that may suffice as well?</p>\n</blockquote>\n<p>I confirmed that it does and this seems to work for our purposes for the time being. Thank you! That being said, having this be part of an API instead of an implementation detail would help us avoid relying on the these log calls being present as part of how we provide hostcall tracing. But what's currently there is good enough for now.</p>\n</blockquote>",
        "id": 278896295,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1649886983
    }
]