[
    {
        "content": "<p>philipc opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a> from <code>philipc:split-dwarf</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>The DWARF sections in <code>DebugInputContext</code> were always set to the DWARF sections from the .wasm file. However, when parsing split DWARF, most of the time we want to be using the sections from the .dwp file instead. We were already passing <code>gimli::Dwarf</code> to most places already so having the sections in <code>DebugInputContext</code> was no benefit. So a lot of this commit is replacing <code>context</code> with <code>dwarf</code>.</p>\n<p>Next, sometimes we were using the wrong <code>gimli::Dwarf</code>. In general, we want to use the skeleton unit for parsing line info, and the split unit for everything else. <code>clone_unit</code> was wrongly using the DWARF associated with the skeleton unit in many places. Instead of changing all of those places, I've kept the variable names <code>dwarf</code> and <code>unit</code>, but changed which DWARF they refer to. This also fits better with the non-split operation. So some of the changes in this commit are updating places that were already correct to use the new variable meanings.</p>\n<p>Finally, this commit adds a call to <code>copy_relocated_attributes</code>. This copies some info from the skeleton unit that is needed when parsing the split unit.</p>\n<p>For testing, the existing <code>dwarf_fission.dwp</code> is too simple for this to make any difference. I've been testing with one of my own C projects, but that's not something I want to add to wasmtime. Additionally, further fixes are required. I'm open to suggestions for a suitable small but non-trivial project to use for testing purposes.</p>\n</blockquote>",
        "id": 462508321,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723712910
    },
    {
        "content": "<p><strong>philipc</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a>.</p>",
        "id": 462508322,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723712910
    },
    {
        "content": "<p><strong>philipc</strong> requested <a href=\"https://github.com/fitzgen\">fitzgen</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a>.</p>",
        "id": 462508323,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723712911
    },
    {
        "content": "<p>philipc updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a>.</p>",
        "id": 462508641,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723713068
    },
    {
        "content": "<p>alexcrichton submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132#pullrequestreview-2240572697\">PR review</a>:</p>\n<blockquote>\n<p>Thank you for taking the time to review this, it's much appreciated!</p>\n<blockquote>\n<p>I've been testing with one of my own C projects, but that's not something I want to add to wasmtime. Additionally, further fixes are required. I'm open to suggestions for a suitable small but non-trivial project to use for testing purposes.</p>\n</blockquote>\n<p>Would you happen to have a suggestion about how we can best organize tests here? Should we for example check in C files to get compiled in CI with various clang flags? Or is there a text format for DWARF which we could exploit? (or something else more clever you've done in gimli?)</p>\n</blockquote>",
        "id": 462567369,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723733552
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a>.</p>",
        "id": 462572679,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723734818
    },
    {
        "content": "<p>philipc <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132#issuecomment-2292339096\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9132\">PR #9132</a>:</p>\n<blockquote>\n<p>I'm not aware of any text format for DWARF. gimli's testing is nearly all artificial DWARF that the tests manually assemble while running. I think it would be tedious to extend that to manually generating the associated Wasm too.</p>\n<p>Compiling a C file in CI would be an option for functionality testing (can I step a debugger to this line and see the correct variables), but for regression tests it becomes dependent on the compiler version installed on the test system (changing the compiler may give different DWARF, so it may no longer be testing the original bug).</p>\n<p>Maybe I can come up with a contrived C file that manages to result in a variety of DWARF. Or more likely it would need to be C++.</p>\n</blockquote>",
        "id": 462647676,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1723758662
    }
]