[
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3769#issuecomment-1030568792\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3769\">issue #3769</a>:</p>\n<blockquote>\n<blockquote>\n<p>This commit fixes the issue by skipping all cold instructions when<br>\nemitting value-label ranges (which are translated into debuginfo). This<br>\nmeans that variables defined in cold blocks will not have DWARF<br>\nmetadata. But cold blocks are usually compiler-inserted slowpaths, not<br>\nuser code, so this is probably OK.</p>\n</blockquote>\n<p>That is quite unfortunate. For cg_clif cold blocks will be user specified (using <code>#[cold]</code>). In addition it may make sense to use something like <a href=\"https://arxiv.org/abs/2112.14679\">https://arxiv.org/abs/2112.14679</a> to automatically infer cold blocks.</p>\n</blockquote>",
        "id": 270811686,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1644045925
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3769#issuecomment-1030570277\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3769\">issue #3769</a>:</p>\n<blockquote>\n<p>Indeed, it's not ideal, but the debug code right now is a bit of a mess that is strongly oriented around ranges of instruction offsets and in-order traversals of offsets, and it's hard to justify the effort needed to fix that (probably a few weeks) against all of the other things that need doing and against the existing \"certain inputs will cause panics\" bug. Cold blocks didn't exist at all until ~a month ago so IMHO providing some support for them, with a baseline of \"correct and non-panic'ing compilation\" but some feature deficiencies, is better than not making this fix.</p>\n<p>Anyone willing to take a deeper dive into the debug code (maybe even replace the analysis with something faster) is of course more than welcome! Always happy to brainstorm better approaches/designs here.</p>\n</blockquote>",
        "id": 270812190,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1644046719
    }
]