[
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1791496677\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<p>@tschneidereit or @JakeChampion: will this change be ok with the JS embedding? They effectively mean you need to retrieve the status and headers from an incoming-response and the method, path&amp;query, scheme, authority, and headers, from an incoming-request before starting to consume the body, after which you'll not be able to retrieve those elements.</p>\n</blockquote>",
        "id": 400014788,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1698957041
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1791573221\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<p>Hmm, while the answer to that is \"yes\", I would somewhat prefer not to do this, unless we absolutely have to (e.g. because otherwise an efficient implementation isn't viable.)</p>\n<p>The reason is that a request semantically isn't just its body, and \"just\" needing to access the body shouldn't require extracting all other information one might possibly need, just to be on the safe side. (In fact, I'd somewhat prefer for <code>consume</code> to be called <code>body</code>, while still only working once. Or even just always returning the same resource handle, same as <code>headers</code> returns the same resource when called multiple times (I think?). I'm assuming that there are technical or conceptual reasons why that doesn't work, though.</p>\n</blockquote>",
        "id": 400022717,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1698961078
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1791751165\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<p>Ok, sounds reasonable to me <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> </p>\n</blockquote>",
        "id": 400040479,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1698972422
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1792806164\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<blockquote>\n<p>In fact, I'd somewhat prefer for consume to be called body, while still only working once.<br>\nI am in favor of this change!<br>\nOr even just always returning the same resource handle, same as headers returns the same resource when called multiple times (I think?). I'm assuming that there are technical or conceptual reasons why that doesn't work, though.</p>\n</blockquote>\n<p>Headers doesn't return the same resource when called multiple times, instead they return a fresh resource containing a HostFields::Ref which refers to the same fields.</p>\n<p>I'll do my best to explain this but @alexcrichton please correct or clarify for me: We can't do the \"return the same resource multiple times\" trick because these returned resources must become owned by the caller component, and therefore have their own independent lifetime. When the caller becomes the owner it must be possible for it to to drop the resource, or move its ownership to another component, without affecting anything else in its table.</p>\n<p>We used to gloss over this distinction when passing table indices around, but now its important to remember that table indicies are just the abstraction to resources which are taken care of entirely by the component runtime, and out in our implementations of wit interfaces, that is totally abstracted away.</p>\n</blockquote>",
        "id": 400172605,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1699030562
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1792828192\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<p>That's all correct yeah, and I'd add one more bit of context related to headers. Headers are a bit of a leaky abstraction because each time you acquire a set of headers you're actually acquiring a pointer to where the headers store (that's the <code>HostFields::Ref</code>). This means that if the storage of the headers are dropped that becomes in effect a dangling pointer. The leaky abstraction part is that we prevent dropping the storage of the headers while there's active resources pointing at the headers. Only once all headers resources are gone can the original storage be dropped too.</p>\n<p>Theoretically something similar is possible for bodies. The catch is that whenever we access headers we've always got the table around so we can chase the \"pointer\" which is actually just a table index. For I/O objects their operations are not executed with a table as an argument, so an I/O object can't currently use the same strategy.</p>\n<p>The other possible solution to enable calling <code>consume</code> (or <code>body</code>) multiple times would be to do reference counting on the host. In Rust though that'd require <code>Arc&lt;Mutex&lt;_&gt;&gt;</code> which is otherwise unnecessary overhead.</p>\n</blockquote>",
        "id": 400175346,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1699031455
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463#issuecomment-1792934249\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7463\">issue #7463</a>:</p>\n<blockquote>\n<p>Thank you for (re-)explaining the constraints that apply here, Pat and Alex <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> </p>\n<p>Given all this, I think it's probably better to have <code>consume</code> work only once, and bindings/frameworks that want to expose an accessor for the body that can be used multiple times can just implement that in content by caching the result.</p>\n</blockquote>",
        "id": 400186164,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1699035912
    }
]