[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a> from <code>alexcrichton:legalize-isle</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>This PR is the result of some discussion in the Cranelift weekly meeting a few weeks ago at this point. Currently backends are required to cope with any shape of IR thrown at them, modulo some minor platform-agnostic legalization. This can be difficult at times in cases such as:</p>\n<ul>\n<li>Many backends handle some constructs in the same way, for example zero-extending a 32-bit value to a 128-bit value. This is done as \"easy\" combinations of other already-implemented instructions, but each backend also has to have 128-bit specific logic. This is applicable to many instructions other than <code>uextend</code> as well.</li>\n<li>Backends don't have the ability to create new basic blocks or control flow during lowering. This gives rise to pseudo-instructions which bake in the control flow to them, but at least personally I feel that's pretty cumbersome and brittle.</li>\n<li>The work that backends do to transform CLIF to something that can be emitted natively is not subject to optimizations. For example many backends insert sign/zero extensions for various operations which can theoretically be GVN'd with previous ones if they already exist, but this is so late in the pipeline GVN doesn't run.</li>\n</ul>\n<p>As a broad solution to the above issues as well as being in the spirit of \"let's write more stuff in ISLE as it's much easier to extend\", this PR migrates all legalization into ISLE. The general setup of this PR is that there's a shared set of legalizations which represent the prior backend-agnostic legalizations (e.g. replacing <code>iadd_imm x, y</code> with <code>iadd x, (iconst y)</code>). Each backend then has its own set of legalizations which are added to this set of legalizations to create one large <code>legalize</code> function. Additionally the NaN canonicalization pass is now moved into ISLE as well to happen as part of the legalization step (ok so maybe \"legalize\" isn't the best term for it any more at that point, please bikeshed this or tell me it's a bad idea)</p>\n<p>Existing legalizations are ported for examples, in addition to two target-specific legalizations:</p>\n<ul>\n<li>On RISC-V some sample legalizations are done where <code>uextend</code>-to-i128 no longer needs to be handled in the backend as it's handled in the legalization phase instead. Other backends can in theory include these rules as well, but that's left for a future PR.</li>\n<li>On x86_64 the <code>fcvt_from_uint</code> instruction's lowering for 64-bit types is no longer a pseudo-instruction in the backend. Instead the pseudo-instruction is deleted and replaced with a legalization. This brings a few benefits such as being able to use AVX instructions in the lowering in addition to breaking false dependencies, neither of which previously happened in the lowering.</li>\n</ul>\n<p>My main goal with this is to not necessarily solve all the preexisting issues with the backends but instead provide a framework to move forward. When CFG edits are required for lowerings or when constructs would be good to throw at egraph-based optimization it's now easy to add a rule to <code>legalize.isle</code> and have it thrown in. This can help shift some complexity around and avoid consolidating it all in one pass.</p>\n<p>A downside of this approach, however, is that it doesn't provide a means to remove all pseudo-instructions. For example the x64 backend has pseudo-instructions for converting floats to integers, and they can't be legalized with this technique. The reason for this is that the native instruction has no corresponding CLIF instruction which can express it. While it's possible to add <code>x86_*</code> instructions to CLIF that seems best left for later only if truly necessary. In the meantime my hope is that backends, as maintenance continues over time, can start sharing more logic in these legalizations related to 128-bit integers for example or otherwise legalizing larger lowerings through this technique rather than all via ISLE lowerings.</p>\n</blockquote>",
        "id": 397878360,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697923228
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/elliottt\">elliottt</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397878361,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697923229
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-compiler-reviewers\">wasmtime-compiler-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397878362,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697923229
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397882016,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697928132
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397882613,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697928845
    },
    {
        "content": "<p><strong>cfallin</strong> requested <a href=\"https://github.com/cfallin\">cfallin</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397884187,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697930769
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 397884564,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1697931294
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>.</p>",
        "id": 401851034,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1699912342
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2091797445\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>I forgot this PR existed and got excited again while reading over the discussion history. I think that, with some work, there's a clean solution to the problem of the egraph pass undoing target-specific legalizations: Delay elaboration until lowering. I've written that up in #8529 because I think it's useful independently.</p>\n<p>There's still a problem if the legalized version gets eliminated by <code>subsume</code>. We can delete all uses of <code>subsume</code> in the egraph rules if we want, but conceivably the auto-subsume behavior from #8006 could be a problem too.</p>\n<p>The above is all stuff we could do separately from this PR. I think it would be worthwhile to remove the parts of this PR that change any lowering rules, and just convert the existing legalization pass to ISLE.</p>\n</blockquote>",
        "id": 436782185,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1714686513
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2108373070\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>A bit belated getting back to this, but that sounds plausible to me! I'll probably leave this be though for now since we're not really changing that much related to legalization nowadays and the main motivation here was to open up the door to simplifying various rules in backends (e.g. backend-specific legalization). Once there's a clearer direction on #8529 I think it'd make sense to start moving in that direction.</p>\n</blockquote>",
        "id": 438414450,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1715621752
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2381005979\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>FYI: we now take <code>trap[n]z</code> instructions all the way to the backend, so there are no more control-flow changes during legalization, so moving legalization to ISLE should be easier now.</p>\n<p>But I also kind of feel like we shouldn't have to do <em>any</em> legalization in the mid-end. Instead, I think we should remove the instructions that get legalized and replace them with <code>InstructionBuilder</code> convenience methods, as we've talked about previously (in other issues, or cranelift meetings, can't remember). That is, we'd remove the <code>stack_store</code> instruction but keep the ability to do <code>builder.ins().stack_store(...)</code> and it would just eagerly generate <code>v123 = stack_addr ...; store ..., v123;</code> clif instructions.</p>\n</blockquote>",
        "id": 473388869,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727560960
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2381342612\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>The reason I'm using stack_load and stack_store in cg_clif is to simplify the printed clif ir to make it easier to read. As well as to make future optimizations that depend on stack pointers not leaking easier. stack_addr would leak stack pointers as Cranelift doesn't have pointer provenance.</p>\n</blockquote>",
        "id": 473445623,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727613696
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2383568059\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<blockquote>\n<p>But I also kind of feel like we shouldn't have to do any legalization in the mid-end.</p>\n</blockquote>\n<p>One day I'd like to have a property where backends don't have to implement lowering for <code>uextend.i128 x</code> for example because they all already support <code>iconcat</code> and <code>iconst.i64 0</code>, so I'd at least personally still like to see legalization used for \"massage this input IR until all operations the backend doesn't support are removed\"</p>\n</blockquote>",
        "id": 473777502,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727711225
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2383588279\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<blockquote>\n<p>\"massage this input IR until all operations the backend doesn't support are removed\"</p>\n</blockquote>\n<p>+1, that's the \"good\" usage of legalization IMHO. Historically it was used for (i) \"unconditional on all backends\" rewrites (stack loads/stores as a good example), (ii) actual instruction lowering until it reached CLIF insts that corresponded one-to-one to machine insts on the target; (iii) \"reduce to a previously solved problem\" rewrites (narrowing and polyfills).</p>\n<p>Options (i) and (ii) are \"inefficient\" in the sense that we can do them better by (i) emitting the final sequence right away, as suggested above, and (ii) using our one-pass lowering scheme that we introduced with MachInsts and VCode. But Option (iii) is eminently reasonable; I too think that there's unnecessary duplication in our 128-bit ops handling, for example. We've talked about \"architecture-specific mid-end rules\" and this is a use-case for that IMHO -- a backend can opt into the \"narrow 128 to 64 bits\" ruleset, or selectively opt in but gradually implement more efficient lowerings over time, etc.</p>\n</blockquote>",
        "id": 473779795,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727711786
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2383976612\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>Agreed that use case (iii) continues to make sense. We just don't currently do it at all.</p>\n<p>(i) and (ii) I think should be removed.</p>\n<hr>\n<p>@bjorn3 </p>\n<blockquote>\n<p>The reason I'm using stack_load and stack_store in cg_clif is to simplify the printed clif ir to make it easier to read. As well as to make future optimizations that depend on stack pointers not leaking easier. stack_addr would leak stack pointers as Cranelift doesn't have pointer provenance.</p>\n</blockquote>\n<p>If you only use the proposed <code>stack_{store,load}</code> helper methods, the stack addresses will not leak beyond their associated stores/loads, which is exactly the same situation we have today.</p>\n<p>It is true that the clif text dumps will have two operations where it used to have one (pre-legalization and optimization, at least). I think that is ultimately acceptable, and a small price to pay for simplifying the IR and compiler internals, but it <em>is</em> a downside.</p>\n</blockquote>",
        "id": 473831505,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727723969
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321#issuecomment-2383998421\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7321\">PR #7321</a>:</p>\n<blockquote>\n<p>For a little more on escape analysis and stack addresses, re: @bjorn3's concerns: it's true that Cranelift doesn't have a notion of pointer provenance, so an arbitrary integer computation that happens to produce a correct stack address could technically access the stack legally; but that's already the case today, <em>under the hood</em>, in the sense that we do translate <code>stack_load</code>/<code>_store</code> to regular loads/stores and we do not specify that the stack is \"outside the ordinarily accessible address space\".</p>\n<p>Short of full provenance though I think we can still have a notion of \"leakage\" that is formally definable: an address becomes visible (an arbitrary integer computation can produce a pointer that can access it) once used/exposed by any operation other than as the address of a load/store. So <code>stack_addr</code>-&gt;<code>stack_load</code> can be pattern-matched today, and an escape analysis can see (if no other uses of the <code>stack_addr</code>) that the address does not enter the rest of the program dataflow. Such a line of reasoning should be reasonable to take, IMHO, because the only way that a computation could <em>otherwise</em> happen upon the address is by guessing or having inside knowledge of the system (stack layout, etc). So in other words we avoid the full complexity of maintaining pointer provenance through IR transforms (all the things we've talked about before) while still having a notion of \"exposed addresses\".</p>\n</blockquote>",
        "id": 473834944,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1727724764
    }
]