[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a> from <code>alexcrichton:stable-fuzz-corpus</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>This commit is an improvement to the longevity of Wasmtime's corpus of fuzz inputs to the <code>instantiate</code> fuzzer. Currently the input to this fuzzers is arbitrary binary data which is a \"DNA\" of sorts of what to do. This DNA changes over time as we update the fuzzer and add configuration options, for example. When this happens though the meaning of all existing inputs in the corpus changes because they all have slightly different meanings now. The goal of this commit is to improve the usefulness of a historical corpus, with respect to the WebAssembly modules generated, across changes to the DNA.</p>\n<p>A custom mutator is now provided for the <code>instantiate</code> fuzzer. This mutator will not only perform libfuzzer's default mutation for the input but will additionally place an \"envelope\" around the fuzz input. Namely, the fuzz input is encoded as a valid WebAssembly module where the actual input to the fuzzer is a trailing custom section. When the fuzzer runs over this input it will read the custom section, perform any configuration generation necessary, and then use the envelope module as the actual input to the fuzzer instead of whatever was generated from the fuzz input. This means that when a future update is made to the DNA of a module the interpretation of the fuzz input section will change but the module in question will not change. This means that any interesting shapes of modules with respect to instructions should be preserved over time in theory.</p>\n<p>Some consequences of this strategy, however, are:</p>\n<ul>\n<li>\n<p>If the DNA changes then it's difficult to produce minor mutations of the original module. This is because mutations generate a module based on the new DNA which is likely much different than the preexisting module. This mainly just means that libFuzzer will have to rediscover how to mutate up into interesting shapes on DNA changes but it'll still be able to retain all the existing interesting modules. Additionally this can be mitigate with the integration of <code>wasm-mutate</code> perhaps into these fuzzers as well.</p>\n</li>\n<li>\n<p>Protection is necessary against libFuzzer itself with respect to the module. The existing fuzzers only expect valid modules to be created, but libFuzzer can now create mutations which leave the trailing section in place, meaning the module is no longer valid. One option is to record a cryptographic hash in the fuzz input section of the previous module, only using the module if the hashes match. This approach will not work over time in the face of binary format changes, however. For example the multi-memory proposal changed binary encodings a year or so ago meaning that any previous fuzz-generated cases would no longer be guaranteed to be valid. The strategy settled by this PR is to pass a flag to the execution function indicating if the module is \"known valid\" and gracefully handle error if it isn't (for example if it's a prior test case).</p>\n</li>\n</ul>\n<p>I'll note that this new strategy of fuzzing is not applied to the <code>differential</code> fuzzer. This could theoretically use the same strategy but it relies much more strictly on being able to produce a module with properties like NaN canonicalization, resource limits, fuel to limit execution, etc. While it may be possible to integrate this with <code>differential</code> in the future I figured it'd be better to start with the <code>instantiate</code> fuzzer and go from there.</p>\n<p>&lt;!--<br>\nPlease make sure you include the following information:</p>\n<ul>\n<li>\n<p>If this work has been discussed elsewhere, please include a link to that<br>\n  conversation. If it was discussed in an issue, just mention \"issue #...\".</p>\n</li>\n<li>\n<p>Explain why this change is needed. If the details are in an issue already,<br>\n  this can be brief.</p>\n</li>\n</ul>\n<p>Our development process is documented in the Wasmtime book:<br>\n<a href=\"https://docs.wasmtime.dev/contributing-development-process.html\">https://docs.wasmtime.dev/contributing-development-process.html</a></p>\n<p>Please ensure all communication follows the code of conduct:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md\">https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md</a><br>\n--&gt;</p>\n</blockquote>",
        "id": 355001588,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988266
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/elliottt\">elliottt</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001591,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988268
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-fuzz-reviewers\">wasmtime-fuzz-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001592,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988268
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-compiler-reviewers\">wasmtime-compiler-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001593,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988268
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/pchickey\">pchickey</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001597,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988269
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001598,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988269
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-default-reviewers\">wasmtime-default-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355001599,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988269
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355182643,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1683040447
    },
    {
        "content": "<p>pchickey submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322#pullrequestreview-1409409302\">PR review</a>.</p>",
        "id": 355196392,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1683043058
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6322\">PR #6322</a>.</p>",
        "id": 355254610,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1683057905
    }
]