[
    {
        "content": "<p>ValeryAntopol opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5936\">issue #5936</a>:</p>\n<blockquote>\n<p>I read the docs about the <code>Send + Sync + 'static</code> requirement <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Func.html#why-send--sync--static\">https://docs.rs/wasmtime/latest/wasmtime/struct.Func.html#why-send--sync--static</a>, and it suggests passing most of the data through the store. However, it is not easy to do it in my case and forces me to change many <code>Rc</code> -&gt; <code>Arc</code> and even add a mutex, without any other reasons except wasmtime's requirements.  So it is a </p>\n<p>I understand that it is generally unsafe to have <code>unsafe impl</code>, but if wasmtime uses thread-safety guarantees only to make its structures thread-safe and does not rely on them internally, it will be fine. The question refers to the latest version at the time of aswering, and if answer is \"safe\" then it would be nice to know if it is expected to change in future.</p>\n</blockquote>",
        "id": 339890148,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1678114545
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5936#issuecomment-1456355982\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5936\">issue #5936</a>:</p>\n<blockquote>\n<p>This is technically allows because Wasmtime doesn't spawn any threads for you (except when compiling modules with parallel-compilation enabled which isn't related to the runtime).</p>\n<p>If you can get it to work, however, the intention is that non-<code>Send</code>-and-<code>Sync</code> state would be stored in the <code>T</code> of the <code>Store&lt;T&gt;</code> which all functions get access to. That way your host functions which are <code>Send + Sync + 'static</code> typically don't actually close over anything and they're just function pointers.</p>\n</blockquote>",
        "id": 339900188,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1678116793
    }
]