[
    {
        "content": "<p>mmitton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5851\">PR #5851</a> from <code>branch_folding</code> to <code>main</code>:</p>\n<blockquote>\n<p>I have implemented branch folding for constant value conditionals inside the egraph midend.  This covers BrIf and BrTable, converting them to Jump instructions and removing edges in the ControlFlowGraph and updating the DominatorTree, detecting unreachable code and removing them as well.</p>\n<p>This necessitated having mutable access to the DominatorTree in egraph, so it had to be removed from AliasAnalysis and passed to AliasAnalysis for the functions that needed it.  As a side benefit, this cleaned up some lifetimes sprinkled around to have a reference to DominatorTree in AliasAnalysis.</p>\n<p>A block is determined to be unreachable if it no longer has any predecessors or has one predecessor and is the head of a loop.</p>\n<p>After folding the branch and removing pred/succ to dead code, when a block is processed, a check is made to see if there are parameters to the block and there is one and only one pred to the block.  If this is the case, the parameters are detached from the block and aliased to the passed arguments in the BlockCall.</p>\n<p>I have chatted briefly with @cfallin while implementing this, and he suggested I create a PR to let people review the changes.</p>\n</blockquote>",
        "id": 329475267,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1677083872
    },
    {
        "content": "<p>mmitton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5851\">PR #5851</a> from <code>branch_folding</code> to <code>main</code>.</p>",
        "id": 329491453,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1677087887
    },
    {
        "content": "<p>mmitton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5851\">PR #5851</a> from <code>branch_folding</code> to <code>main</code>.</p>",
        "id": 338579254,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1677588832
    }
]