[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a> from <code>alexcrichton:use-wasmparser-types</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>Before this commit Wasmtime would build up its own representation of type information independently of wasmparser, effectively duplicating things such as type scopes and managing indices. This to some degree is required because Wasmtime's type information is serialized into compiled images and wasmparser's information isn't easily serialized. With the advent of resources in components, however, the task of doing this correctly has become much more difficult.</p>\n<p>When component translation was first written it was more difficult to acquire type information from <code>wasmparser::Validator</code>. Nowadays there's helpful type information exposed every step of the way which makes it much easier to get at the types of items while we're translating rather than only at the very end (or not at all). This is one of the motivations for this commit where now it's possible to avoid duplicating the work <code>wasmparser</code> is doing whereas before it wasn't as easy.</p>\n<p>Additionally with resources in the component model they perform namely a number of involved type substitutions during instantiation of arbitrary components which isn't implemented in Wasmtime today. Some of this will be required for Wasmtime to correctly implement resources so instead of doing all that again I've decided to replace Wasmtime's management of types with wasmparser's management of types.</p>\n<p>The main difference in this commit is that Wasmtime no longer tracks type information during translation and that conversion into Wasmtime's type hierarchy now has a different entry point. Previously conversion would happen based on raw types read from the wasm file (think index-based things) whereas now translation happens on <code>wasmparser</code>'s parsed and validated hierarchy of types (think ID-based things rather than index-based things). This makes translation slightly more involved but overall it's largely performing the same work.</p>\n<p>One gotcha with this PR is that core wasm modules using GC types and typed function references could theoretically have worked previously but they no longer work. It turns out that <code>wasmparser</code> is not correctly surfacing type information in components for core modules that use GC types, namely because <code>wasmparser</code>'s validated type hierarchy uses the same core wasm types as what's read raw from the type section. This in turn means that the index-based format can't be resolved. This is a bug in <code>wasmparser</code> which will need resolving but is a big chunk of work to take on, so for now the component model will panic on these sorts of modules (which are disabled by default anyway).</p>\n<p>Overall the end-goal of this commit is to ease the implementation of resources a bit by heavily relying on <code>wasmparser</code>'s understanding of resources, chiefly the functionality of performing type substitutions on subcomponent instantiations.</p>\n<p>&lt;!--<br>\nPlease make sure you include the following information:</p>\n<ul>\n<li>\n<p>If this work has been discussed elsewhere, please include a link to that<br>\n  conversation. If it was discussed in an issue, just mention \"issue #...\".</p>\n</li>\n<li>\n<p>Explain why this change is needed. If the details are in an issue already,<br>\n  this can be brief.</p>\n</li>\n</ul>\n<p>Our development process is documented in the Wasmtime book:<br>\n<a href=\"https://docs.wasmtime.dev/contributing-development-process.html\">https://docs.wasmtime.dev/contributing-development-process.html</a></p>\n<p>Please ensure all communication follows the code of conduct:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md\">https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md</a><br>\n--&gt;</p>\n</blockquote>",
        "id": 369049698,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687567430
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/itsrainy\">itsrainy</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 369049700,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687567431
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 369049701,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687567431
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 369052677,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687568514
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 369549205,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687751631
    },
    {
        "content": "<p><strong>pchickey</strong> requested <a href=\"https://github.com/pchickey\">pchickey</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 370142133,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687885582
    },
    {
        "content": "<p>pchickey submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638#pullrequestreview-1501476452\">PR review</a>.</p>",
        "id": 370143329,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687885818
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6638\">PR #6638</a>.</p>",
        "id": 370173145,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687891945
    }
]