[
    {
        "content": "<p>sunfishcode <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2526#issuecomment-748619182\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2526\">Issue #2526</a>:</p>\n<blockquote>\n<p>The original JS polyfill was built from compiling the initial WASI implementation in Wasmtime written in C with Emscripten. Since then, Wasmtime has moved to an implementation written in Rust and dropped the C version. In theory, it should be possible to compile the Rust code with Emscripten in the same way, however at this time, this has not yet been done.</p>\n<p>One lesson learned is that compiling with Emscripten tends to produce a lot of code, while hand-written approaches, such as <a href=\"https://github.com/bjorn3/rust/blob/compile_rustc_wasm4/rustc.html\">this one</a> or <a href=\"https://github.com/WebAssembly/waterfall/blob/master/src/wasi.js\">this</a> tend to be a lot smaller and more flexible. Instead of Implementing WASI on top of a Posix-ish API and bundling an implementation of the Posix-ish API to support that, they can just directly implement the WASI APIs.</p>\n<p>At this point, we should probably remove the mentions of the original JS polyfill. Its main purpose was to demonstrate that it's possible to polyfill WASI on the Web, which it did, and now there are better alternatives. The two I linked to above aren't complete, but they're enough for a fair number of use cases.</p>\n</blockquote>",
        "id": 220523532,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1608476601
    },
    {
        "content": "<p>NukeManDan <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2526#issuecomment-820551158\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2526\">Issue #2526</a>:</p>\n<blockquote>\n<p>@sunfishcode I wanna close this one out, is there a more recent PR that does what you describe to remove and rework this section? Thanks! <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> </p>\n</blockquote>",
        "id": 234705658,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1618502973
    }
]