[
    {
        "content": "<p>bnjbvr <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258#issuecomment-703685676\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258\">Issue #2258</a>:</p>\n<blockquote>\n<blockquote>\n<p>would it make sense to hold the EmitInfo in the VCode container itself, and plumb it into the instruction emission from there?</p>\n</blockquote>\n<p>I'm happy to do this, but that would break the symmetry with <code>EmitState</code>... which could also live in Vcode in fact. Maybe also moving EmitState would help reducing the traits complexity... Any preference here? (Happy to chat about this on Zulip)</p>\n</blockquote>",
        "id": 212310571,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1601909681
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258#issuecomment-703771051\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258\">Issue #2258</a>:</p>\n<blockquote>\n<p>I suppose I see the difference between <code>EmitState</code> and <code>EmitInfo</code> as: the vcode should be emittable multiple times (the instructions are immutable during emit), so we want <code>EmitState</code> to be an external thing -- it's transient, per emission; while <code>EmitInfo</code> encapsulates some information that is tied to the lowering and should not be changed, so its lifetime should be as long as the VCode. (And given that it shouldn't change, there is really only one \"correct value\" to use when emitting a given VCode body, so it doesn't seem right to require it as a parameter.) So from that perspective, the asymmetry doesn't bother me too much. That said, I'm happy to go with your original design as well if you prefer it :-)</p>\n</blockquote>",
        "id": 212330033,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1601918353
    },
    {
        "content": "<p>cfallin edited a <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258#issuecomment-703771051\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258\">Issue #2258</a>:</p>\n<blockquote>\n<p>I suppose I see the difference between <code>EmitState</code> and <code>EmitInfo</code> as: the VCode should be emittable multiple times (the instructions are immutable during emit), so we want <code>EmitState</code> to be an external thing -- it's transient, per emission; while <code>EmitInfo</code> encapsulates some information that is tied to the lowering and should not be changed, so its lifetime should be as long as the VCode. (And given that it shouldn't change, there is really only one \"correct value\" to use when emitting a given VCode body, so it doesn't seem right to require it as a parameter.) So from that perspective, the asymmetry doesn't bother me too much. That said, I'm happy to go with your original design as well if you prefer it :-)</p>\n</blockquote>",
        "id": 212330057,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1601918367
    },
    {
        "content": "<p>bnjbvr <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258#issuecomment-704168193\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258\">Issue #2258</a>:</p>\n<blockquote>\n<p>That's a good argument, thanks! I hadn't thought about the fact that we could emit several times (I wonder what such a use case would be though, since an emitter who'd like to emit in several places would emit in a buffer, and then would carry a cheap copy rather than the full-blown emission.) I'll rework my patch.</p>\n</blockquote>",
        "id": 212406956,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1601978831
    },
    {
        "content": "<p>bnjbvr <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258#issuecomment-704821473\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2258\">Issue #2258</a>:</p>\n<blockquote>\n<p>@cfallin Updated the patch, please let me know if you want to take another look!</p>\n</blockquote>",
        "id": 212535250,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1602063811
    }
]