[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-724861455\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>Hi @Voultapher -- so, at least the core codegen bits of Cranelift should build with stable Rust (1.43+ currently) -- we check this on CI here: <a href=\"https://github.com/bytecodealliance/wasmtime/blob/0568f4fb02f68b577653f81f7a62cb6881c67121/.github/workflows/main.yml#L129-L133\">link</a>. <code>wasmtime</code> and <code>clif-util</code> should also build on stable Rust. Could you say a little more about the issues you're seeing that are requiring nightly?</p>\n<p>(re the PR overall, I agree we should update the badge and info -- thanks for taking the time to do this!)</p>\n</blockquote>",
        "id": 216246997,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605030401
    },
    {
        "content": "<p>Voultapher <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-724866117\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>First ran into the issue mentioned in the #2377 and then it complained that feature(test) is nightly only. Even if those core bits are 1.43 we should be more explicit that does not mean, that clone + cargo build will work.</p>\n</blockquote>",
        "id": 216248199,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605030909
    },
    {
        "content": "<p>Voultapher edited a <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-724866117\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>First ran into the issue mentioned in #2377 and then it complained that feature(test) is nightly only. Even if those core bits are 1.43 we should be more explicit that does not mean, that clone + cargo build will work.</p>\n</blockquote>",
        "id": 216248227,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605030922
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-726142682\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>I personally feel that nightly shouldn't really be mentioned at all in the README. If lightbeam really is the only consumer of nightly that's not heavily developed right now anyway and it's not worth saying we require nightly in the README. I think that the readme should say \"works on the current stable Rust\" so we don't have to update it every 6 weeks personally.</p>\n</blockquote>",
        "id": 216481667,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605194283
    },
    {
        "content": "<p>Voultapher <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-726288943\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>So here is my personal experience with wanting to get started contributing. I read the README and it says 'so for some cargo commands, such as cargo test, the --all is needed to tell cargo to visit all of the crates.', in the moment I understood that as 'please run cargo test --all' otherwise you're missing important tests. So I do that, and get a build failure, I think to myself, oh right haven't updated rust for a while. Go check it, hmm, 1.44 but the badge says 1.37, whatever. I update, then it gets a bit further, and complains, ey that's nightly only. Alright I switch to nightly, and then more than hour later I've finally finished my first build + test cycle, which also throws up some errors. That does not feel nice.</p>\n<p>Now I suggest we adjust the README to avoid future contributors from experiencing the same frustrations. If you want to avoid nightly in your README because it looks bad, well then don't use nightly. Saying it works with stable while hiding the fact, that if you follow the recommendation 2 lines below it won't work with stable, that feels disingenuous. I tried being clear in the latest proposed wording what works with stable and what doesn't. I suggest we are either open and honest with what is required and expected, or somehow feature gate out those nightly parts, so that only those few actively working on Lightbeam and knowing what they are doing require it, even when running <code>cargo test --all</code>.</p>\n</blockquote>",
        "id": 216515678,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605209143
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-726791318\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>Thank you for sharing that feedback, @Voultapher. I think you're right that there's a seeming inconsistency in the documentation that we should resolve. I also think that in isolation the individual parts you mention are true, but combined I can see how they're confusing for newcomers, which isn't great. I think your proposed changes go in the right direction, but we might want to go even further, in particular around clarifying what's expected to pass in CI.</p>\n<p>ISTM like we should clarify the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/docs/contributing-testing.md\">section on testing</a> to make explicit what testing should be done in which circumstances. Ideally, this would state something like \"for most development, running the tests for the crate you're changing should be sufficient, but you may also want to run the same tests we run in our CI system\", and then describe how to run individual crate tests with an example, and how to run the CI tests. Then we could end with a note on running all tests, but mention that some of them require a Nightly version of Rust, and some crates are expected to fail.</p>\n<p>It's unfortunate that there's no way to specify a default set that'd be run with <code>cargo test</code>. @alexcrichton, AFAICT that's not possible, right? Alternatively perhaps we can extract the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/.github/workflows/main.yml#L250-L261\"><code>cargo test</code> invocation from the CI config</a> into a shell script and refer to that?</p>\n</blockquote>",
        "id": 216616984,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605277323
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387#issuecomment-728150185\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2387\">Issue #2387</a>:</p>\n<blockquote>\n<p>I agree with @tschneidereit that the best fix here seems to be updating the documentation on what tests are expected to be run by users (or how to run tests). Running <code>cargo test --all</code> not only requires nightly because of one crate right now but it also tests a lot more than you probably want to (e.g. building z3 for peepmatic).</p>\n<p>Also, unfortunately, yeah, I don't think there's a way through Cargo to customize the default set of tests run via <code>cargo test</code>. (other than the shell script, which I'm not a huge fan of because it doesn't support Windows well)</p>\n</blockquote>",
        "id": 216889904,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1605542014
    }
]