[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2774\">PR #2774</a> from <code>compile-fewer-trampolines</code> to <code>main</code>:</p>\n<blockquote>\n<p>Previously each module in a module-linking-using-module would compile<br>\nall the trampolines for all signatures for all modules. In forest-like<br>\nsituations with lots of modules this would cause quite a few trampolines<br>\nto get compiled. The original intention was to have one global list of<br>\ntrampolines for all modules in the module-linking graph that they could<br>\nall share. With the current design of module linking, however, the<br>\nintention is for modules to be relatively isolated from one another<br>\nwhich would make achieving this difficult.</p>\n<p>In lieu of total sharing (which would be good for the global scope<br>\nanyway but we also don't do that right now) this commit implements an<br>\nalternative strategy where each module simply compiles its own<br>\ntrampolines that it itself can reach. This should mean that<br>\nmodule-linking modules behave more similarly to standalone modules in<br>\nterms of trampoline duplication. If we ever do global trampoline<br>\ndeduplication we can likely batch this all together into one, but for<br>\nnow this should fix the performance issues seen in fuzzing.</p>\n<p>Closes #2525<br>\n</p>\n</blockquote>",
        "id": 231873767,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1616705327
    },
    {
        "content": "<p>peterhuene submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2774#pullrequestreview-621586654\">PR Review</a>.</p>",
        "id": 231877511,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1616707011
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2774\">PR #2774</a>.</p>",
        "id": 231895740,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1616717464
    }
]