[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5208\">PR #5208</a> from <code>pooling-dynamic</code> to <code>main</code>:</p>\n<blockquote>\n<p>This is a continuation of the thrust in #5207 for reducing page faults and lock contention when using the pooling allocator. To that end this commit implements support for efficient memory management in the pooling allocator when using wasm that is instrumented with bounds checks.</p>\n<p>The <code>MemoryImageSlot</code> type now avoids unconditionally shrinking memory back to its initial size during the <code>clear_and_remain_ready</code> operation, instead deferring optional resizing of memory to the subsequent call to <code>instantiate</code> when the slot is reused. The instantiation portion then takes the \"memory style\" as an argument which dictates whether the accessible memory must be precisely fit or whether it's allowed to exceed the maximum. This in effect enables skipping a call to <code>mprotect</code> to shrink the heap when dynamic memory checks are enabled.</p>\n<p>In terms of page fault and contention this should improve the situation by:</p>\n<ul>\n<li>\n<p>Fewer calls to <code>mprotect</code> since once a heap grows it stays grown and it never shrinks. This means that a write lock is taken within the kernel much more rarely from before (only asymptotically now, not N-times-per-instance).</p>\n</li>\n<li>\n<p>Accessed memory after a heap growth operation will not fault if it was previously paged in by a prior instance and set to zero with <code>memset</code>. Unlike #5207 which requires a 6.0 kernel to see this optimization this commit enables the optimization for any kernel.</p>\n</li>\n</ul>\n<p>The major cost of choosing this strategy is naturally the performance hit of the wasm itself. This is being looked at in PRs such as #5190 to improve Wasmtime's story here.</p>\n<p>This commit does not implement any new configuration options for Wasmtime but instead reinterprets existing configuration options. The pooling allocator no longer unconditionally sets<br>\n<code>static_memory_bound_is_maximum</code> and then implements support necessary for this memory type. This other change to this commit is that the <code>Tunables::static_memory_bound</code> configuration option is no longer gating on the creation of a <code>MemoryPool</code> and it will now appropriately size to <code>instance_limits.memory_pages</code> if the <code>static_memory_bound</code> is to small. This is done to accomodate fuzzing more easily where the <code>static_memory_bound</code> will become small during fuzzing and otherwise the configuration would be rejected and require manual handling. The spirit of the <code>MemoryPool</code> is one of large virtual address space reservations anyway so it seemed reasonable to interpret the configuration this way.</p>\n<p>&lt;!--</p>\n<p>Please ensure that the following steps are all taken care of before submitting<br>\nthe PR.</p>\n<ul>\n<li>\n<p>[ ] This has been discussed in issue #..., or if not, please tell us why<br>\n  here.</p>\n</li>\n<li>\n<p>[ ] A short description of what this does, why it is needed; if the<br>\n  description becomes long, the matter should probably be discussed in an issue<br>\n  first.</p>\n</li>\n<li>\n<p>[ ] This PR contains test cases, if meaningful.</p>\n</li>\n<li>[ ] A reviewer from the core maintainer team has been assigned for this PR.<br>\n  If you don't know who could review this, please indicate so. The list of<br>\n  suggested reviewers on the right can help you.</li>\n</ul>\n<p>Please ensure all communication adheres to the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/master/CODE_OF_CONDUCT.md\">code of\nconduct</a>.<br>\n--&gt;<br>\n</p>\n</blockquote>",
        "id": 308055332,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667598676
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5208\">PR #5208</a> from <code>pooling-dynamic</code> to <code>main</code>.</p>",
        "id": 308091929,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667625128
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/peterhuene\">peterhuene</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5208\">PR #5208</a>.</p>",
        "id": 308445112,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667844750
    },
    {
        "content": "<p>peterhuene submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5208#pullrequestreview-1172799373\">PR review</a>.</p>",
        "id": 308669126,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667939629
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5208\">PR #5208</a>.</p>",
        "id": 308670466,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667940190
    }
]