[
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1398641105\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<p>I'll note that I've confirmed at least on x86_64 and arm64 that this does not slow down the <code>Module::deserialize_file</code> operation. Specifying the write permission, and not actually writing to anything, means everything is still fast on Linux.</p>\n</blockquote>",
        "id": 322557052,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674232647
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1398773995\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<p>Would it be possible to use GOT relative relocations for libcalls and then only make the GOT writable while applying the relocations and make it read-only again afterwards? Or maybe even store libcall addresses in the VMContext to keep the whole module read-only?</p>\n</blockquote>",
        "id": 322586984,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674239109
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1398878503\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<blockquote>\n<p>If an attacker did manage to write to the non-executable pages, what would the impact be? </p>\n</blockquote>\n<p>My current understanding is that if an attacker could pave over the image then that means they have an arbitrary write primitive so while making the image readonly wouldn't hurt it's not like that would protect the actual malloc heap or any other state in a process. In that sense I don't think the impact would be any worse or better with a readonly image.</p>\n<p>My main motivation for switching things to read/write though was the aspect that in-memory compiled modules are already read/write. I don't think it's out of the cards by any means to make the entire image readonly but if we were to implement that I think we'd want to implement it for all compiled images and not just those deserialized from files.</p>\n<blockquote>\n<p>Would it be possible to use GOT relative relocations for libcalls ... ?</p>\n</blockquote>\n<p>While I'm not 100% sure how the GOT works my impression is that it's a table of function pointers that's filled in at runtime but nothing else needs to be filled in at runtime. If that's true then while it would improve the performance of resolving these relocations (today it's O(relocations) and with a GOT it'd be O(symbols-to-relocate-against)) I don't think it would change the calculus here much. Today file-mapped images are completely readonly so we still couldn't apply relocations.</p>\n<p>Now you're right, though, that ideally we wouldn't have any relocations here at all. The problem with these though is that the libcall is introduced very late in the codegen pipeline (at lowering) which means there's no guaranteed access to a vmctx so loading from the vmctx isn't necessarily possible. We'd have to patch out the clif instructions during the wasm -&gt; clif lowering stage to do libcalls via the vmctx but that means we'd be baking in target-specific lowering information to that lowering pass which would be a bit of a bummer.</p>\n<hr>\n<p>I should clarify, I don't think that a readonly image would really cause issues at all. There's a part of the publication process for an image to make it executable where we make the text section read/execute (e.g. removing the write bit), and we could pretty easily make the whole image readonly just before that (this would happen just after relocations are applied)</p>\n</blockquote>",
        "id": 322606046,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674245478
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1398958545\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<blockquote>\n<p>While I'm not 100% sure how the GOT works my impression is that it's a table of function pointers that's filled in at runtime but nothing else needs to be filled in at runtime.</p>\n</blockquote>\n<p>Indeed. This only applies to code relocations. Data relocations are unchanged as it is impossible to handle the indirection. For Wasmtime that isn't relevant though as it only has code relocations.</p>\n<blockquote>\n<p>The problem with these though is that the libcall is introduced very late in the codegen pipeline (at lowering) which means there's no guaranteed access to a vmctx so loading from the vmctx isn't necessarily possible.</p>\n</blockquote>\n<p>AFAIK the backend does know about vmctx, albeit as an opaque value. I guess it would be possible to add a flag to define the offset to load libcall addresses. Even so I do agree this is probably not the way to go.</p>\n</blockquote>",
        "id": 322617819,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674249564
    },
    {
        "content": "<p>github-actions[bot] <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1400518048\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<h4>Subscribe to Label Action</h4>\n<p>cc @fitzgen</p>\n<p>&lt;details&gt;<br>\nThis issue or pull request has been labeled: \"fuzzing\"</p>\n<p>Thus the following users have been cc'd because of the following labels:</p>\n<ul>\n<li>fitzgen: fuzzing</li>\n</ul>\n<p>To subscribe or unsubscribe from this label, edit the &lt;code&gt;.github/subscribe-to-label.json&lt;/code&gt; configuration file.</p>\n<p><a href=\"https://github.com/bytecodealliance/subscribe-to-label-action\">Learn more.</a><br>\n&lt;/details&gt;</p>\n</blockquote>",
        "id": 323045621,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674486918
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1403833528\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<p>@jameysharp would you be up for reviewing this? If not no worries, I can pass it along.</p>\n</blockquote>",
        "id": 323520992,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674661967
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1403923650\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<p>I think this PR would be a clear improvement over the _status quo_ if it left non-executable pages read-only (for both disk-backed and memory-only maps). You may very well be correct that if someone can write to these pages then we have bigger problems, but I'm not personally comfortable giving it an r+ as-is. If other stakeholders who rely on Wasmtime for multi-instance isolation decide that's safe, I'd be happy to see this merged.</p>\n</blockquote>",
        "id": 323535575,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674665657
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608#issuecomment-1403959060\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5608\">issue #5608</a>:</p>\n<blockquote>\n<p>Ok I've pushed a commit to do that. To be clear though I'm still wary of this. Changing memory permissions can often lead to scaling issue w.r.t. IPIs and such. I continue to believe it's not necessary here since if you can overwrite random memory in the image there's basically no reason you can't overwrite anything else. I won't disagree it's a defense-in-depth thing, though.</p>\n</blockquote>",
        "id": 323540332,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1674666924
    }
]