[
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1707#issuecomment-974306199\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1707\">issue #1707</a>:</p>\n<blockquote>\n<p>Peepmatic was removed in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3543\">https://github.com/bytecodealliance/wasmtime/pull/3543</a></p>\n</blockquote>",
        "id": 262107914,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637346384
    },
    {
        "content": "<p>fitzgen closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1707\">issue #1707</a>:</p>\n<blockquote>\n<p>Right now, if there are two subtrees of LHS match ops that are the same, except they check different paths (e.g. checking if a first operand is the result of an <code>iadd</code> and checking if a second operand is the result of an <code>iadd</code>) we create different states because each state is associated with a <code>MatchOp</code> and a <code>MatchOp</code> embeds the path of the thing it is operating on within itself.</p>\n<p>We should investigate ways to de-duplicate these states and match operations.</p>\n<p>One idea is to implicitly maintain a stack of what the current instruction we're operating against is, and expand our generated automata to be pushdown automata. It is unclear to me how to expand our existing algorithm for transducer automata construction to add pushdown support. I don't know whether there is anything in the literature describing how to do this or not.</p>\n<p>Another idea is to add <code>MatchOp</code> opcodes that don't actually do any matching, but just do traversal-through-the-data-flow-graph operations. Things like push and pop operations, or register-assignment operations. The downside here is that we have more operations to process, and it isn't clear that the size of the automata will actually get smaller, even if we can de-duplicate more than we did before, because there would be so many more extra operations.</p>\n</blockquote>",
        "id": 262107915,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637346385
    }
]