[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1046#issuecomment-1117855104\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1046\">issue #1046</a>:</p>\n<blockquote>\n<p>I'm doing some issue gardening, and this has been open for ~3.5 years without much happening; given that we have gotten along well enough with our current CLIF comment character (<code>;</code>) in the meantime I think I will go ahead and close this. If anyone wants to make a renewed effort/argument for alternative CLIF syntax please feel free though!</p>\n</blockquote>",
        "id": 281214081,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651695568
    },
    {
        "content": "<p>cfallin closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1046\">issue #1046</a>:</p>\n<blockquote>\n<p>Cranelift's clif files (example <a href=\"https://github.com/CraneStation/cranelift/blob/master/filetests/parser/branch.clif\">here</a>) currently use <code>;</code> for line comments. This is somewhat common in assembler languages, and LLVM IR, but it's not always immediately obvious for people from other backgrounds.</p>\n<p>Using <code>//</code> would follow Cranelift's syntax for types <code>v0: i32</code>, <code>-&gt; i32</code>, and so on in taking syntactic queues from Rust where it makes sense to do so. (Related: should we change <code>function</code> to <code>fn</code>? That doesn't feel as important because <code>function</code> is more self-explanatory there, but it's worth considering.)</p>\n<p><code>//</code> is two characters rather than <code>;</code>'s one, but my intuition is that little things we can do to make IR dumps easier to approach for people not already familiar with them will end up being valuable in a variety of contexts, more so than absolute conciseness.</p>\n</blockquote>",
        "id": 281214085,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651695571
    }
]