[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3600\">PR #3600</a> from <code>isle-5-uextend-sextend</code> to <code>main</code>:</p>\n<blockquote>\n<p>This commit migrates the sign/zero extension instructions from<br>\n<code>lower_inst.rs</code> to ISLE. There's actually a fair amount going on in this<br>\nmigration since a few other pieces needed touching up along the way as<br>\nwell:</p>\n<ul>\n<li>\n<p>First is the actual migration of <code>uextend</code> and <code>sextend</code>. These<br>\n  instructions are relatively simple but end up having a number of special<br>\n  cases. I've attempted to replicate all the cases here but<br>\n  double-checks would be good.</p>\n</li>\n<li>\n<p>This commit actually fixes a few issues where if the result of a vector<br>\n  extraction is sign/zero-extended into i128 that actually results in<br>\n  panics in the current backend.</p>\n</li>\n<li>\n<p>This commit adds exhaustive testing for<br>\n  extension-of-a-vector-extraction is a noop wrt extraction.</p>\n</li>\n<li>\n<p>A bugfix around ISLE glue was required to get this commit working,<br>\n  notably the case where the <code>RegMapper</code> implementation was trying to<br>\n  map an input to an output (meaning ISLE was passing through an input<br>\n  unmodified to the output) wasn't working. This requires a <code>mov</code><br>\n  instruction to be generated and this commit updates the glue to do<br>\n  this. At the same time this commit updates the ISLE glue to share more<br>\n  infrastructure between x64 and aarch64 so both backends get this fix<br>\n  instead of just aarch64.</p>\n</li>\n</ul>\n<p>Overall I think that the translation to ISLE was a net benefit for these<br>\ninstructions. It's relatively obvious what all the cases are now unlike<br>\nbefore where it took a few reads of the code and some boolean switches<br>\nto figure out which path was taken for each flavor of input. I think<br>\nthere's still possible improvements here where, for example, the<br>\n<code>put_in_reg_{s,z}ext64</code> helper doesn't use this logic so technically<br>\nthose helpers could also pattern match the \"well atomic loads and vector<br>\nextractions automatically do this for us\" but that's a possible future<br>\nimprovement for later (and shouldn't be too too hard with some ISLE<br>\nrefactoring).</p>\n<p>&lt;!--</p>\n<p>Please ensure that the following steps are all taken care of before submitting<br>\nthe PR.</p>\n<ul>\n<li>\n<p>[ ] This has been discussed in issue #..., or if not, please tell us why<br>\n  here.</p>\n</li>\n<li>\n<p>[ ] A short description of what this does, why it is needed; if the<br>\n  description becomes long, the matter should probably be discussed in an issue<br>\n  first.</p>\n</li>\n<li>\n<p>[ ] This PR contains test cases, if meaningful.</p>\n</li>\n<li>[ ] A reviewer from the core maintainer team has been assigned for this PR.<br>\n  If you don't know who could review this, please indicate so. The list of<br>\n  suggested reviewers on the right can help you.</li>\n</ul>\n<p>Please ensure all communication adheres to the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/master/CODE_OF_CONDUCT.md\">code of\nconduct</a>.<br>\n--&gt;<br>\n</p>\n</blockquote>",
        "id": 264870547,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1639494195
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/fitzgen\">fitzgen</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3600\">PR #3600</a>.</p>",
        "id": 264870552,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1639494198
    },
    {
        "content": "<p>fitzgen submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3600#pullrequestreview-832080950\">PR review</a>.</p>",
        "id": 264931305,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1639518664
    },
    {
        "content": "<p>fitzgen merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3600\">PR #3600</a>.</p>",
        "id": 264931315,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1639518670
    }
]