[
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1113#issuecomment-772681462\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1113\">Issue #1113</a>:</p>\n<blockquote>\n<p>Most of cranelift-codegen-meta isn't used for the new backend framework anymore.</p>\n</blockquote>",
        "id": 225049225,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612373089
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1113#issuecomment-772716692\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1113\">Issue #1113</a>:</p>\n<blockquote>\n<p>Most of the issues here are related to the old backends, which will be removed eventually, and are fixed in the new backends; closing.</p>\n</blockquote>",
        "id": 225057172,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612376243
    },
    {
        "content": "<p>cfallin closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1113\">Issue #1113</a>:</p>\n<blockquote>\n<p>Having worked with cranelift for a few weeks now, I've had several discussions about how to improve the code in the <code>cranelift-codegen</code> module. I am sure that moving meta from Python to Rust has made the code easier to understand and use but here are some things I've noticed as I've worked in this module:</p>\n<ol>\n<li>__static references__: <code>cranelift-codegen</code> contains many <code>by_name</code> retrievals throughout the encodings, formats, legalization, etc. This means that when I add a new instruction, e.g., I can't encode it until I've found the alphabetically-ordered location to insert a <code>by_name(\"my_inst\")</code>--and I forget to do this every time. @bnjbvr mentioned that we might be able to use <a href=\"https://docs.rs/lazy_static/1.4.0/lazy_static/\">lazy_static</a> to initialize them. Then we could use instructions, e.g., by importing <code>crate::shared</code> and writing <code>shared::splat</code> where they are used. This may work for instructions, formats, recipes (maybe?), but we may run into issues with settings since <code>SettingGroupBuilder::build</code> does more than just collect predicates.</li>\n<li>__eliminate templates__: <code>cranelift-codegen</code> has the concept of <code>Recipe</code>s; the x86 subdirectory has the additional concept of <code>Template</code>s (previously <code>TailRecipe</code>s). Perhaps I just don't understand the purpose of <code>Template</code> clearly enough (and would appreciate an explanation), but having both <code>Recipe</code> and <code>Template</code> is very confusing; it is unclear when to build one or the other and the difference seems minimal. Is there a way <code>Recipe</code> can be improved to cover any features it is missing and <code>Template</code> eliminated?</li>\n<li>__recipe naming convention__: The x86 recipes have a confusing assortment of names: sometimes they make sense (<code>null</code> and <code>null_fpr</code>) but other times the naming is less than clear (e.g. <code>brid</code> might stand for a branch recipe with a double-word immediate?). This makes it difficult to find existing recipes that may already do what I need. Can we explain the naming convention in the documentation and/or adopt a naming convention that is more explanatory?</li>\n<li>__non-string recipes__: The recipe code itself (i.e. in <code>emit</code>) is difficult to change because it is a string, not Rust code. If a recipe is coded incorrectly, usually the build will fail; if the code was statically analyzable the errors would be clearer sooner. If instead <code>emit</code> could be passed a closure or function to do the appropriate recipe work, then the code would be statically analyzable: <code>.emit(|sink, bits, regs|  { ... }</code>. This won't work as-is because each recipe uses different parameters and types, but perhaps a procedural macro wrapped around this (i.e. <code>emit(recipe_from!(|sink, bits, regs| { ... })</code>) could reduce a real Rust closure/function to the strings <code>emit</code> expects while allowing IDEs to statically analyze the code.</li>\n<li>__re-factor PerCpuModeEncodings__: The x86 encodings use a <code>PerCpuModeEncodings</code> struct to join an instruction, its bound types, its encodings, its recipes, etc. Currently there are a confusing assortment of methods for adding different subsets of these (e.g. enc_x86_64_instp, enc_both, enc_x86_64, enc_i32_i64, etc.). Perhaps a builder-like pattern would allow us to remove some of these methods and clarify what is happening; something like: <code>e.inst(band).with_types([B1, B8, B16]).uses_recipe(rec_rr.opcodes(...)).when_isa([use_sse3]).when_predicate(...).encode();</code>. For instructions that have several encodings following a pattern (i.e. like that of <code>enc_i32_i64</code>) we could add a <code>.encode_with_pattern(...)</code> accepting an enum for the various patterns.</li>\n</ol>\n<p>I am opening this issue to discuss if any of the above are feasible and desirable. Please add to this list if there are other items.<br>\n</p>\n</blockquote>",
        "id": 225057173,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612376243
    }
]