[
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-784021108\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>I got a panic at cranelift/codegen/src/isa/x64/abi.rs:508 when trying this branch out. There is an <code>unimplemented!()</code> there under the assumption that no XMM registers are callee-save, which is an incorrect assumption for WindowsFastcall.</p>\n</blockquote>",
        "id": 227400096,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614071213
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-784434020\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Ah, I had missed that -- fixed now and test added.</p>\n</blockquote>",
        "id": 227484301,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614106624
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-784476946\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>The sysroot compiled successfully. The only missing things for full Windows support in cg_clif are TLS support and a few small things on the cg_clif side.</p>\n</blockquote>",
        "id": 227495046,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614110854
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-786992206\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<blockquote>\n<p>One thing I didn't see (and maybe I missed) is how \"args above four\" are pushed in a right-to-left fashion to the stack</p>\n</blockquote>\n<p>I went back and looked to be sure -- this is somewhat confusing phrasing, but \"pushed right-to-left\" is functionally the same as \"args in order are at ascending stack addresses\", which is what this PR does. This <a href=\"https://godbolt.org/z/hhGG57\">quick experiment</a> on Compiler Explorer shows arg 5 is at <code>[rsp+40]</code> and arg 6 is at <code>[rsp+48]</code> (40 because return address plus 32-byte shadow space). So I <em>think</em> we're OK here, and e.g. <code>%f6</code> in the tests verifies this order (returns first of two on-stack args).</p>\n<blockquote>\n<p>[CI test]</p>\n</blockquote>\n<p>I'll look into adding this! We may need to temporarily disable some tests to make it work, since unwind info for Windows is not implemented yet.</p>\n<p>An interesting question is: how do we actually validate that we match what other compilers provide and expect? Even for System V, we don't (I think) have an ABI test that explicitly links Cranelift-produced code with other native code. I suppose we implicitly get that when we run tests that make calls into the Wasmtime runtime; perhaps we should add a few \"test weird ABI corners\" VM calls just for this purpose.<br>\n</p>\n</blockquote>",
        "id": 228027534,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614394720
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-789483045\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>An update on this: I've been pulling on a thread the last few days in order to implement fully correct \"non-Rust\" i128 support and I'm starting to wonder if this is the right path.</p>\n<p>This has sort of turned into a refactor of the entire ABI machinery in order to support by-ref values and cross-XMM/integer movement, and it is maddeningly complex. Basically, because we don't have a legalization-based approach wherein we can \"reduce to a previously solved problem\", we end up handling an \"arg within an arg\" (the by-ref pointer) which contorts the code quite a bit. By-ref support adds another stack area on the caller side whose layout we have to compute, and tweaks a bunch of the ABI traits because we need some temp registers in various places. It's asymmetric wrt the return case: fastcall passes 128-bit return values, even integers (<code>__m128</code>), in XMM registers; so our two-I64-reg integer handling that is consistent throughout the rest of the backend needs special-cased split/concat code for return values only.</p>\n<p>To recap, this is necessary only for <code>extern \"C\"</code> calls from cg_clif with <code>i128</code> values. Everything with cg_clif + Rust ABI works correctly; this is only for the hypothetical case that one links with a C library and passes 128-bit integers to it. I'm currently at a 1K-line diff and it's ~50% done.</p>\n<p>This is the complexity I was worried about when I had suggested \"just panicing on i128 in the non-Rust case\" above; @bjorn3, your pushback then was that this is not Fastcall-compliant, and indeed that is true! However, I am wondering how much this corner case really matters at this point in time, versus the disproportionate cost of building it (and the opportunity cost of not working on other things); and perhaps if it is very important later, we can talk about properly allocating time for implementing this.</p>\n<p>Thoughts?</p>\n</blockquote>",
        "id": 228545403,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614754270
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-789622161\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>As far as I know the following pass modes are used for SystemV and Fastcall with cg_llvm:</p>\n<table>\n<thead>\n<tr>\n<th>what</th>\n<th>sysv pass mode</th>\n<th>sysv abi</th>\n<th>fastcall pass mode</th>\n<th>fastcall abi</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>argument</strong></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>i128 Rust abi</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n</tr>\n<tr>\n<td>i128 C abi</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n<td>indirect</td>\n<td>pass pointer in register</td>\n</tr>\n<tr>\n<td>__m128 Rust abi</td>\n<td>indirect</td>\n<td>pass pointer in register</td>\n<td>indirect</td>\n<td>pass pointer in register</td>\n</tr>\n<tr>\n<td>__m128 C abi</td>\n<td>vector i64x2</td>\n<td>xmm register</td>\n<td>indirect</td>\n<td>pass pointer in register</td>\n</tr>\n<tr>\n<td>128bit struct Rust abi</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n</tr>\n<tr>\n<td>128bit struct C abi</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n<td>indirect</td>\n<td>pass pointer in register</td>\n</tr>\n<tr>\n<td><strong>return value</strong></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>i128 Rust abi</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n</tr>\n<tr>\n<td>i128 C abi</td>\n<td>cast -&gt; i128</td>\n<td>two integer registers</td>\n<td>indirect</td>\n<td>pass return pointer in register</td>\n</tr>\n<tr>\n<td>__m128 Rust abi</td>\n<td>indirect</td>\n<td>pass return pointer in register</td>\n<td>indirect</td>\n<td>pass return pointer in register</td>\n</tr>\n<tr>\n<td>__m128 C abi</td>\n<td>vector i64x2</td>\n<td>xmm register</td>\n<td>vector i64x2</td>\n<td>xmm register</td>\n</tr>\n<tr>\n<td>128bit struct Rust abi</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n</tr>\n<tr>\n<td>128bit struct C abi</td>\n<td>cast -&gt; i128</td>\n<td>pass in two registers</td>\n<td>indirect</td>\n<td>pass return pointer in register</td>\n</tr>\n</tbody>\n</table>\n<p>The pass mode here is the <code>PassMode</code> computed by rustc. When <code>cast -&gt; i128</code> is used, the value is always passed in two integer registers, even when the calling convention theoretically doesn't support it. If the calling convention doesn't support it, for the C abi, rustc will use an indirect pass mode.</p>\n<p>I think Cranelift should follow LLVM and always pass i128 in two integer registers. If it needs to be passed as pointer or on the stack, the abi adjustement code of the user of Cranelift can do this. It is impossible to fully handle the abi in Cranelift anyway as it doesn't support structs. Cranelift should have the building blocks based on which the calling convention can be followed.</p>\n</blockquote>",
        "id": 228571972,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614768567
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-789966102\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Thank you for the detailed comparison table, @bjorn3!</p>\n<p>So, yes, it seems we are in agreement: the by-ref argument passing can exist at a layer above the CLIF as finally seen by the codegen backend. This seems to be a better factorization of complexity.</p>\n<p>Given this plan, I'll fix up the PR to address all of the other issues, then document that the i128-in-two-registers scheme is an LLVM/rustc-inspired extension. The open question is whether we want to do this by default (when the user just asks for <code>WindowsFastcall</code>) or only when explicitly indicated by a variant ABI (<code>WindowsFastcallRust</code> or <code>WindowsFastcallLLVM</code> for example) or by an ISA flag (<code>fastcall_i128_in_integer_reg_pair</code> for example). I think I lean toward the latter, to minimize confusion later -- it forces the Cranelift user to think about and understand these subtleties of Fastcall -- and we can link to this PR discussion as a fairly detailed exploration of the space :-)</p>\n</blockquote>",
        "id": 228644229,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614796811
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-790014508\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Maybe it could be called <code>enable_llvm_abi_extensions</code>?</p>\n</blockquote>",
        "id": 228656996,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614801417
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-790317383\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>In the last few commits I fell down a bit of a CI rabbithole but now this PR also allows the Cranelift backend variant to be set via environment variable; I couldn't get a separate action/runner to work for Windows CI so this lets us add it to the main testing matrix instead. Let's see if this works...</p>\n</blockquote>",
        "id": 228721980,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614837433
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-790322409\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Hmm, actually, scratch that -- that won't work because our filetests need to be aware of the dynamic choice of backend as well (to enable the right ones).</p>\n<p>This seems to be another case where a simple request (\"run it on Windows CI\") has turned into a deep rabbithole of maddening complexity. Given that we are planning to switch the default Wasmtime backend soon (at which point all of our tests will provide coverage for this), given the increasingly uncomfortable maze of features and environment-variable switches, and given that filetests are covering fastcall with golden-output matching for now, I would <em>strongly</em> prefer not to dive further down this rabbithole, instead just waiting until we switch over to have actual run-test coverage -- @abrown, what do you think?</p>\n</blockquote>",
        "id": 228722695,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614838040
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-790798716\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Updated again after consulting with alexcrichton and abrown on Zulip -- <code>runs-on: windows</code> and <code>runs-on: windows-latest</code> are entirely different things apparently :-) Let's see if this works better...</p>\n<p>@sunfishcode, see the wasi-related test exclusion in the latest commit -- any thoughts on that? I was seeing failures of some symlink-related WASI tests on my local Windows machine (MinGW64 / MSYS2, Win10, possible complication: space in username/path (?)) but the shell script passes cleanly when excluding these.</p>\n</blockquote>",
        "id": 228816995,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614879566
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-791035923\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>The segfault in CI is odd -- I can reproduce something similar locally but it seems to be a nondeterministic failure; it is always in <code>__report_gsfailure</code> in the Visual Studio runtime library, but I'm not yet able to trace how we're getting there (there is no <code>rr</code> on Windows sadly) -- though execution is through <code>longjmp</code> and for some very odd reason the disassembly also shows a call to <code>__telemetry_main_return_trigger()</code>, which appears to be telemetry (!) that MSVC inserts via the standard library. It's entirely possible that all of this is a red herring and the real issue is an ABI mismatch somewhere else; will continue to dig.</p>\n</blockquote>",
        "id": 228871514,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614901780
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-791114207\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>More info: the segfault happens whenever a library call raises a trap (e.g. try running the table_fill Wasm spec tests); it results in the unit-test process exiting via abort in <code>__report_gsfailure()</code>. This is a failure of the \"GS\" stack-check mechanism in MSVC, which stores and checks stack cookies. Unfortunately it does not reproduce under <code>gdb</code> consistently (also MinGW gdb does not load symbols from the .exe, and MinGW LLDB hangs, so I'm debugging somewhat blind) -- I can get it to appear or not appear by causing the frame that calls <code>setjmp</code> to be a tail cail or not (with a debugging println). If not tail call, then failure still happens <em>except</em> under GDB.</p>\n<p>I'm trying to learn more about the GS stack-cookie mechanism; it doesn't seem that it would have any sort of action-at-a-distance (check other stack frames, etc) behavior, and the frames on either side of the setjmp/longjmp are in rustc-compiled native code. It's possible that the fastcall impl is going way out of bounds, of course. Does anyone know more about this mechanism (@sunfishcode or @peterhuene maybe)?</p>\n</blockquote>",
        "id": 228889555,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614913089
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-791117684\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Hmm, actually, things go awry after an <code>rdsspq</code> instruction and mismatch in <code>__report_gsfailure</code>; this appears to be Intel CET (Control-flow Enforcement Technology?) which is a shadow stack thing. I'm wondering if we need to do something special in our generated code to keep this mechanism happy...</p>\n</blockquote>",
        "id": 228890336,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614913645
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-791124890\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>I think I've worked out what's going on:</p>\n<ul>\n<li><code>longjmp()</code> on windows-msvc, on a recent-enough machine with CET instructions, tracks the shadow stack depth and if it does not match a value stored in the longjmp block (i.e. we're skipping up the stack), invokes <code>RtlUnwind()</code>, a Win32 function, to unwind frames.</li>\n<li>We aren't generating/registering Windows unwind info yet, so this causes the program to abort. (This is the proximate issue we're seeing.)</li>\n<li>I see this issue now and not earlier, and GitHub CI sees it, I think because of presence of CET instructions: I get crashes on my Win10 VM on my 2020 desktop but not Skylake-era mini PC. Presumably GitHub's Windows runners are also running on recent cores (?).</li>\n<li>It's possible my speculation about ISA differences is wrong and something else is causing the runtime to try to unwind frames; in any case, it's trying to rely on unwind info that isn't there.</li>\n</ul>\n<p>So our possible avenues forward seem to be:</p>\n<ul>\n<li>Land this without Windows CI. We don't actually support a Wasmtime-with-new-BE execution on Windows, because longjmp might break without unwind info. But this isn't any worse than now, where we don't support said execution because we don't do fastcall.</li>\n<li>Implement unwind info as well and land one PR with both.</li>\n<li>Roll our own setjmp that somehow circumvents Windows' structured exception handling. I'm skeptical of interfacing with complex mechanisms that require correct metadata, for security and correctness reasons; the most correct metadata is the metadata you don't have to generate at all. But there may (?) be consequences to that, or it may just not be possible; can someone more knowledgeable about Win32 chime in?</li>\n</ul>\n<p>If the third option is not possible, I'd favor #1, so this PR doesn't grow unboundedly; we can then include Windows CI when we add unwind (next) and get coverage of everything at once. Thoughts?</p>\n</blockquote>",
        "id": 228892064,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614914940
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678#issuecomment-791587186\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2678\">Issue #2678</a>:</p>\n<blockquote>\n<p>Sounds good -- thanks for the review efforts!</p>\n</blockquote>",
        "id": 228997335,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1614967380
    }
]