[
    {
        "content": "<p>juntyr opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>I am running WASI code in Wasmtime and the browser and am trying to reuse my WasiCtx implementation for both. While the Wasmtime host can access the guest's memory, which wiggle exposes by requiring a <a href=\"https://docs.rs/wiggle/latest/wiggle/trait.GuestMemory.html#tymethod.base\"><code>GuestMemory::base</code></a> method implementation. In my browser use case, however, the \"host\" runs inside WASM itself and launches new guests as separate WASM instances. The backing memory for each instance, an ArrayBuffer, is disjoint, so any memory transfer has to go through copying read and write calls.</p>\n<h4>Feature</h4>\n<p>Would it be (or is it already) possible to generalise the <a href=\"https://docs.rs/wiggle/latest/wiggle/trait.GuestMemory.html\"><code>GuestMemory</code></a> trait to allow for guest memory implementations which are disjoint? If the <a href=\"https://docs.rs/wiggle/latest/wiggle/trait.GuestMemory.html#tymethod.base\"><code>GuestMemory::base</code></a> method is required by current Wasmtime(-adjacen) code, it could be moved into an extension trait implemented by all current implementations.</p>\n<h4>Benefit</h4>\n<p>This more general approach would allow further code reuse even on platforms where the WASM host cannot directly access a guest's memory.</p>\n<p>Thank you for your help!</p>\n</blockquote>",
        "id": 412949544,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705322706
    },
    {
        "content": "<p>juntyr <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1892513928\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>It seems like <code>GuestSlice</code> also assumes that the host has direct access to the guest as it implements <code>Deref</code> (and <code>GuestSliceMut</code> implements <code>DerefMut</code>)</p>\n</blockquote>",
        "id": 412998171,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705337705
    },
    {
        "content": "<p>juntyr edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1892513928\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>It seems like <code>GuestSlice</code> also assumes that the host has direct access to the guest as it implements <code>Deref</code> (and <code>GuestSliceMut</code> implements <code>DerefMut</code>). This seems to be a bigger issue as other uses of <code>base()</code> (mainly the primitive read and write implementations) can naturally also be implemented using only reads and writes.</p>\n</blockquote>",
        "id": 412998852,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705337842
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1894312580\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>Unfortunately the traits now I think are really closely tied to everything being in the same address space. Updating the trait would be a significant refactoring to the internals of <code>wiggle</code> and <code>wasi-common</code> I suspect. This is also an area of the project we're not investing a ton of time and effort in to right now since it's part of the now-dated <code>wasi-common</code> crate and preview1 where we've sinced largely moved on to preview2 and the <code>wasmtime-wasi</code> crate. </p>\n<p>If you're interested to game out the change that's ok, but if it's a significant refactoring it may be somewhat difficult to land.</p>\n</blockquote>",
        "id": 413217028,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705430374
    },
    {
        "content": "<p>juntyr <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1894844825\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>Thank you for your response! I tried to hack together a workaround using an intermediary copy buffer that translates device memory into short-lived (per each syscall) host copies that are reflected back to the guest (the same idea that the original WASI polyfill was based on). While <a href=\"https://github.com/rust-lang/rust/pull/119616\">https://github.com/rust-lang/rust/pull/119616</a> is being worked on, this should provide a useful workaround.</p>\n<p>For the future, are there plans to provide some common WASI implementation primitives that can also be used with other runtimes? For instance, most host implementations for the preview-2 components could reside in a new wasi-common crate and be re-exported in wasmtime-wasi (which would also add Wasmtime-specific plumbing to link in these implementations). This would be extremely helpful in use cases such as mine where a different runtime is needed for different targets but I want to (1) reuse most components (2) control a few components (e.g. clock and RNG for full reproducibility) and (3) share as much of this implementation as possible.</p>\n<p>Thank you again for your time and help and keep up your fantastic work!</p>\n</blockquote>",
        "id": 415939266,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705459229
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1897541706\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>Right now we haven't really figured out the best way to do that. Currently the reusable abstraction layer is the WIT-generated traits. That's a good deal of surface area to implement, however, so it's likely not what you're looking for.</p>\n<p>Beyond that it's difficult to build abstractions that keep it easy for us to actually keep working on the implementation as well as users not have to reimplement all of WASI. </p>\n<p>All that to say it'd be something great to have, but isn't something we know what it looks like right now.</p>\n</blockquote>",
        "id": 416468513,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1705537123
    },
    {
        "content": "<p>juntyr <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1906864334\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>GitHub's landing page recommendations just introduced me to <a href=\"https://github.com/bytecodealliance/WASI-Virt\">https://github.com/bytecodealliance/WASI-Virt</a>, which might be even more in the direction of what I'm looking for. What better way to achieve a fully reproducible WASI environment than to virtualise it and compile it into the module itself so that all/most (I usually still like printing to stdout) WASI calls are removed :D</p>\n<p>Does it make sense to already move my pipeline to wasi-preview2? I'm compiling all WASM modules from Rust and have full control over their compilation, but since some use C dependencies that are compiled with the wasi-sdk (which seems to only just start to get preview-2 support), I'd probably compile to preview-1 for a while longer, then transform with the adapter, and then transform again with the virtualisation. Is this reasonably doable already?</p>\n</blockquote>",
        "id": 417522765,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1706041591
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1907031127\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>Yes, the workflow of compiling to preview 1, then turning that into a component using preview 2 with the component adapter is working now, for both pure Rust as well as using C dependencies compiled with wasi-sdk.</p>\n<p>The preview 2 interfaces themselves are presently release candidates. We expect the latest set of release candidates to be promoted to the release version of preview 2 at the upcoming WASI Subgroup meeting on Jan 25. Once that is complete, we will release wasmtime 17 and the rest of the tooling suite all supporting the released preview 2 interfaces, so you will be able to target stable interfaces there, rather than release candidates that have been changing about once a month.</p>\n<p>Once you have a preview 2 component, wasi-virt may work for your use case. However, it is still very much under development and may not be complete and working for your use case. If it is not, and you require a totally deterministic implementation of preview 2, the wasmtime::component::bindgen tooling makes things much simpler than wiggle ever did for defining host implementations.</p>\n</blockquote>",
        "id": 417540756,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1706049109
    },
    {
        "content": "<p>pchickey edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1907031127\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>Yes, the workflow of compiling to preview 1, then turning that into a component using preview 2 with the component adapter is working now, for both pure Rust as well as using C dependencies compiled with wasi-sdk.</p>\n<p>The preview 2 interfaces themselves are presently release candidates, but we consider wasmtime's implementations production ready. We expect the latest set of release candidates to be promoted to the release version of preview 2 at the upcoming WASI Subgroup meeting on Jan 25. Once that is complete, we will release wasmtime 17 and the rest of the tooling suite all supporting the released preview 2 interfaces, so you will be able to target stable interfaces there, rather than release candidates that have been changing about once a month.</p>\n<p>Once you have a preview 2 component, wasi-virt may work for your use case. However, it is still very much under development and may not be complete and working for your use case. If it is not, and you require a totally deterministic implementation of preview 2, the wasmtime::component::bindgen tooling makes things much simpler than wiggle ever did for defining host implementations.</p>\n</blockquote>",
        "id": 417540817,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1706049126
    },
    {
        "content": "<p>juntyr <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1907405524\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>That's really exciting, thank you so much for the preview of the timeline!</p>\n<p>One current roadblock I just thought of for my usecase is that my WASM+WASI modules need to run both inside Wasmtime and the browser (right now I have a hacky WASI polyfill for the browser) and that I need to do some transformations on the WASM bytecode, for which I currently use walrus. Do you know if there is already a timeline for component model support in web browsers (I only just stumbled across jco)? Is there a walrus-like Rust library (even with less convenience functions) that allows me to re-implement the simple bytecode transformations (like NaN normalization and adding instruction counting) that I'm currently using?</p>\n<p>In the future, most of my usecase will probably be covered by</p>\n<ul>\n<li>having some WASI-requiring component or core WASM module (already working)</li>\n<li>linking in several components that provide WASI features without falling back to the host, e.g. a virtual filesystem (stdio excluded) and a seeded PRNG (from what I understand this is already possible)</li>\n<li>obtaining a WASI component that only requires minimal WASI, e.g. just stdout/stderr printing (does preview2 already support this, i.e. can I run Wasmtime and only provide impls for wasi:cli/stdout and wasi:cli/stderr?)</li>\n<li>running that component in different runtimes (e.g. browser and Wasmtime), for which I now just need to provide minimal WASI support</li>\n</ul>\n</blockquote>",
        "id": 417578416,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1706074240
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776#issuecomment-1908690635\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7776\">issue #7776</a>:</p>\n<blockquote>\n<p>We believe that jco will provide support for the Component Model and WASI Preview 2 in the browser at some point soon. I don't think anyone can commit to an exact time line at the moment. The jco folks have focused hard on getting their node.js preview 2 implementation correct (conforming to the same test suite as wasmtime) for the past few months in order to show that the standard has two separate high quality implementations. With their focus freed up from making that milestone they will be able to devote time to the web embedding next, but I don't think anyone has assessed how much time they are spending on it and how much it needs in order to estimate exactly when that will be ready.</p>\n</blockquote>",
        "id": 417702994,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1706120681
    }
]