[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565#issuecomment-757132114\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565\">Issue #2565</a>:</p>\n<blockquote>\n<p>@yurydelendik, I think I will need your help on this -- it appears that you wrote all of the debug support initially? Two questions:</p>\n<ol>\n<li>\n<p>Is there a reason that the gdb tests are currently marked <code>#[ignore]</code>? Are they known to be broken for other reasons?</p>\n</li>\n<li>\n<p>If not, would you be able to help me debug this? I believe the analysis is generating correct, or mostly correct, mappings of labels to registers; but the <code>debug</code> crate in wasmtime is generating DWARF that uses the vmctx register outside of its valid range and I don't understand enough about DWARF or the code here to say why.</p>\n</li>\n</ol>\n<p>Any help from anyone who is passionate about debuginfo would be appreciated -- this is one of the last pieces needed to enable the switch to the new backend by default in wasmtime, and I've dumped a bunch of time into this and need to context-switch for a little bit :-)</p>\n</blockquote>",
        "id": 222165830,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1610189877
    },
    {
        "content": "<p>yurydelendik <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565#issuecomment-757356793\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565\">Issue #2565</a>:</p>\n<blockquote>\n<blockquote>\n<p>Is there a reason that the gdb tests are currently marked #[ignore]? Are they known to be broken for other reasons?</p>\n</blockquote>\n<p>They are marked as \"ignored\" to not run them on developer's computer: the tests require lldb/gdb/llvm-dwarfdump install. These tests are run on the CI. See <a href=\"https://github.com/bytecodealliance/wasmtime/blob/cacebfb19c721b293c947f9bc8c57643c2763b95/.github/workflows/main.yml#L287-L293\">https://github.com/bytecodealliance/wasmtime/blob/cacebfb19c721b293c947f9bc8c57643c2763b95/.github/workflows/main.yml#L287-L293</a></p>\n<blockquote>\n<p>If not, would you be able to help me debug this?</p>\n</blockquote>\n<p>I'll try to be useful, yes.</p>\n<blockquote>\n<p>but the debug crate in wasmtime is generating DWARF that uses the vmctx register outside of its valid range</p>\n</blockquote>\n<p>To keep vmctx register/value valid as long as possible is a desired functionality, as well as knowing it during stack unwinding to provide Instance information. We talked with @sunfishcode about having fixed location for vmctx some time back.</p>\n<p>If vmctx is not available, there is no way to get a variable value stored in the instances memory and shadow stack. The variables are marked as optimized out in this case. Which is acceptable solution from debugging of optimized code point of view. Of course we have to minimize such cases to make live of developers better.<br>\n</p>\n</blockquote>",
        "id": 222185839,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1610221131
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565#issuecomment-757364899\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2565\">Issue #2565</a>:</p>\n<blockquote>\n<blockquote>\n<p>To keep vmctx register/value valid as long as possible is a desired functionality, as well as knowing it during stack unwinding to provide Instance information. We talked with @sunfishcode about having fixed location for vmctx some time back.</p>\n<p>If vmctx is not available, there is no way to get a variable value stored in the instances memory and shadow stack. The variables are marked as optimized out in this case. Which is acceptable solution from debugging of optimized code point of view. Of course we have to minimize such cases to make live of developers better.</p>\n</blockquote>\n<p>Makes sense; I'll think about ways to do this. Perhaps the simplest would be to just add a hack that emits a <code>value_label</code> psuedo-instruction for <code>vmctx</code> at return -- this would keep it alive and ensure it can be accessed at least from a spillslot if not a register.</p>\n<p>A question: I was struggling to work out the invariants in the code that converts range-associated data. What do <code>start</code> and <code>end</code> denote for the ValueLabelsRanges? Are these open or closed bounds and do they apply to the start or end of instructions? I had noticed some code that skips any \"empty\" ranges (start == end) -- if a value is computable only after one instruction, which ends at offset X, should we encode that as start=X, end=X+1?</p>\n<p>There's something a little more broken going on in this PR right now, as the vmctx value is dead at a certain point, but DWARF info related to its <em>former</em> register is being generated. So I suspect that I'm misunderstanding some of the invariants related to ranges.</p>\n<p>Thanks for the help!</p>\n</blockquote>",
        "id": 222188900,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1610225217
    }
]