[
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/400#issuecomment-928095529\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/400\">issue #400</a>:</p>\n<blockquote>\n<p>Lightbeam was removed in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3390\">https://github.com/bytecodealliance/wasmtime/pull/3390</a> as explained in <a href=\"https://github.com/bytecodealliance/rfcs/pull/14\">RFC 14</a>, so I'm going to close this.</p>\n</blockquote>",
        "id": 255087060,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1632763722
    },
    {
        "content": "<p>alexcrichton closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/400\">issue #400</a>:</p>\n<blockquote>\n<p>So for months now we've had a miscompilation that is preventing us from integrating Lightbeam into Substrate. What we know about what causes the bug:</p>\n<ul>\n<li>It appears to manifest inside the Rust generated runtime for the <code>wasm32-unknown-unknown</code> target</li>\n<li>It appears _not_ to manifest inside any of the testcases created by the fuzzer, but I think that's because the fuzzer isn't very good at generating webassembly modules with valid export sections. Even though I wrote a script to export every function with the correct signature from every module in the corpus, it seems like the fuzzer tries to remove the export section relatively quickly.</li>\n</ul>\n<p>The bug itself appears to be that something (unknown what) causes the stack pointer differential (i.e. the difference between the stack pointer and the stack pointer that the function started with) tracked by the backend to be misaligned with the actual stack pointer differential, so when we try to emit an instruction to put the stack pointer back to where it should be for the <code>ret</code> instruction we add the wrong amount to the pointer and <code>ret</code> jumps to a garbage location, which appears to currently always be <code>0x10</code>. As far as I know, <code>0x10</code> isn't special, it's just that the function just happens to always have that on the stack because the compilation and execution is deterministic on a per-function basis. It's not clear what function is actually causing this, I'm looking into getting <code>wasmi</code> or another interpreter to print out a call tree during execution (far better than a statically-generated calltree because of the kooky semantics of <code>call_indirect</code>) so that we can do a kind of binary search using <a href=\"https://github.com/rustwasm/wasm-snip\"><code>wasm-snip</code></a> or a similar tool. Alternatively, we can just implement emitting debuginfo in Lightbeam so that <code>rr</code> can print a backtrace. The latter is probably more work, but it's something we should do anyway. Once we have it down to a single function we might be able to get a better idea of what is causing this.</p>\n<p>My guess is that it's related to one of the following:</p>\n<ul>\n<li>Our calling convention code with either <code>br_table</code> or <code>br_if</code>. Both have quite complex code to handle calling conventions, and although both have assertions to ensure that we never accidentally ignore the calling convention of a block, it's possible that something is going wrong with it anyway</li>\n<li>Code related to passing arguments, either to functions or to blocks - they use similar, but not identical, code (although the similarities are extracted into separate functions so there shouldn't be unintended differences). One possible suspect is the code to handle cycles in the register allocator, which can push items to the physical stack. This shouldn't be a problem, as we directly set the stack depth after handling cycles, but it's possible that something is wrong here.</li>\n<li>Any generated control flow that isn't reflected by control flow in the Microwasm. Although the calling conventions of the Microwasm control flow should be pretty well-handled, the internal control flow in <code>div</code> and <code>call_indirect</code> (plus maybe some other instructions) can lead to complexity where two control paths that end at the same point after converging could change the stack depths by different amounts, with only one of them (or even neither of them!) being correctly reflected in the <code>stack_depth</code> field. I did a pass that tried to fix any lingering issues with this a month or two ago, but I don't know for sure if I caught everything or if my fixes were bug-free.</li>\n</ul>\n</blockquote>",
        "id": 255087061,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1632763722
    }
]