[
    {
        "content": "<p>afonso360 opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4766\">issue #4766</a>:</p>\n<blockquote>\n<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Hey,</p>\n<h4>Feature</h4>\n<p>This is a follow up to <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4667#issuecomment-1218328143\">https://github.com/bytecodealliance/wasmtime/pull/4667#issuecomment-1218328143</a>, where we discussed removing TestName as an option for Function names.</p>\n<h4>Benefit</h4>\n<p>The biggest benefit is cleaning up our naming interface. TestNames arguably shouldn't belong to the core cranelift infrastructure. Instead the test suite should have an external table as any other embedder would do.</p>\n<p>The other benefit was allowing larger names in test functions, but @jameysharp has fixed that in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4764\">https://github.com/bytecodealliance/wasmtime/pull/4764</a> (Thanks!)</p>\n<p><a href=\"https://github.com/bytecodealliance/wasmtime/pull/4667#issuecomment-1219673349\">@jameysharp tested this</a> and while it does have some performance benefits, they are minimal.</p>\n<p>This also removes some edges such as <code>cranelift-jit</code> not supporting test names which makes for a better experience using it.</p>\n<h4>Implementation</h4>\n<p>I started working on this a few days ago, but I'm putting it on hold to fix some other more prioritary issues. (<a href=\"https://github.com/afonso360/wasmtime/tree/remove-testnames\">in progress branch</a>) If anyone wants to pick this up in the mean time feel free!</p>\n<p>The branch above starts by changing the parser to produce a side table of test names while assigning UserExernalNames to each function.</p>\n<p>Following from that we need to switch the testsuite to use this new side table.</p>\n<p>And after that we should be able to remove the TestName from cranelift.</p>\n<p>This sounds simple, but I think it will end up being quite a big change.</p>\n<h4>Alternatives</h4>\n<p>Do nothing. This has been the state of cranelift for a long time. I think this would also break the interface for pretty much every downstream user since we would probably remove UserFuncName and replace it with UserExernalName directly.<br>\n</p>\n</blockquote>",
        "id": 295006696,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1661332314
    }
]