[
    {
        "content": "<p>YorickPeterse opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>I'm looking into using Cranelift as a backend for <a href=\"https://inko-lang.org/\">a programming language that I'm working on</a>. Other options I have been looking into are compiling to C or using LLVM, but both come with their own set of trade-offs I'm not a fan of. For example, LLVM is generally quite slow, while C compilers tend to not give you enough control (i.e. they may reorder things unless you carefully insert compiler barriers). Cranelift is promising because of the amount of control it gives, and because it's written in Rust.</p>\n<p>Unfortunately, the Cranelift documentation is limited, to a point where I'm overwhelmed/confused about where to even start. In this issue I'll be asking several questions to hopefully clear this up. If there's a better place for asking long-form questions like this, please let me know <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n<p>To set the stage: Inko is a language similar to Go/Erlang in that it has lightweight processes, and these can suspend at more or less any place (technically these spots are known, e.g. when performing IO, but to the user it may as well be \"anywhere\"). This means I need to be able to maintain and swap the stacks, like stackful coroutines. I also need to be able to grow the stack, and maybe shrink it (though figuring out _when_ to do that is really tricky). Bare-metal performance is not a main goal, rather I want something that compiles fast and performs better than a well optimised interpreter (without a JIT), something I think one should be able to achieve with Cranelift.</p>\n<p>Which brings me to the questions I have, in no particular order:</p>\n<ol>\n<li>\n<p>Cranelift offers no way of injecting assembly directly into the IR. Instead it seems you have to define a C/assembly function then bind to that. Is Cranelift able to jump to a naked function defined in C and exposed using <code>#[no_mangle]</code> and <code>extern \"C\"</code>? The idea here is to make these stack fiddling routines naked functions so they don't introduce extra assembly overhead, and to give you full control. By jumping to them directly they essentially act as assembly macros, avoiding the function call overhead.</p>\n</li>\n<li>\n<p>Defining function names in Cranelift is a bit confusing. <a href=\"https://docs.rs/cranelift-codegen/latest/cranelift_codegen/ir/enum.UserFuncName.html\"><code>UserFuncName</code></a> basically takes two arbitrary <code>u32</code> values, and it's not clear what you'd use those for. Then there's <a href=\"https://docs.rs/cranelift-module/latest/cranelift_module/trait.Module.html#tymethod.declare_function\"><code>Module.declare_function</code></a> which takes a <code>&amp;str</code>, and looking at some existing Cranelift projects this seems to be what they use. So which one should I use if I want to expose my function names (potentially mangled)?</p>\n</li>\n<li>\n<p>EBBs take variables as arguments, but it's not clear how you'd determine what variables to pass down to sub blocks. For example, if I have a graph where blocks <code>A</code> and <code>B</code> both jump to <code>C</code>, and <code>C</code> depends on a result produced by these blocks, how would I know what variable to pass? My own IR is already a graph but not in SSA, thus blocks can just use variables defined in some earlier block. My graph does ensure that in the above case the blocks <code>A</code> and <code>B</code> write to any variable needed by <code>C</code> where its value can differ per branch. </p>\n</li>\n<li>\n<p>How would one associate debugger information with their generated code? For example, I would like for a debugger to know about my source code, line numbers, etc. The Cranelift API doesn't seem to offer anything to do things like \"map these instructions to lines X, Y, Z in the source code\". Do I have to fiddle with the likes of e.g. gimli (and whatever the equivalent is for Windows)?</p>\n</li>\n<li>\n<p>Does Cranelift have any routines for detecting integer overflows? Instructions such as <code>iadd</code> seem to wrap around on overflow, so detecting it manually is doable if needed; I just don't want to reinvent this if already provided by Cranelift.</p>\n</li>\n<li>\n<p>Cranelift seems to have this notion of heaps for functions, and the ability to restrict functions to a certain portion of the heap. For my language there are no such restrictions (i.e. processes don't use fixed size heaps. How would I express this in Cranelift?</p>\n</li>\n<li>\n<p>Related to that, I'm seeing various hints about Cranelift performing heap bounds checking in various places. It's not clear to me if this would be needed in my case, and if not if there's a way of opting out (i.e. I don't want redundant heap bounds checking in my generated code). Is there more information on this somewhere?</p>\n</li>\n<li>\n<p>Related to swapping the stacks: if I insert an assembly routine in a function prologue (i.e. the function just starts with a call/jump to such a routine), is there a way to guarantee Cranelift won't move/inject anything before the call/jump? The assembly that might be needed for the system's calling convention should be fine as I can just add some padding to my stacks to account for that, but I don't want Cranelift to think my routine has no side effects and what not and just move it elsewhere.</p>\n</li>\n</ol>\n<p>Thanks for answering any of these questions, and again let me know if it's better to post this elsewhere! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n</blockquote>",
        "id": 306459486,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666880184
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293630383\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<blockquote>\n<ol>\n<li>Cranelift offers no way of injecting assembly directly into the IR. Instead it seems you have to define a C/assembly function then bind to that. Is Cranelift able to jump to a naked function defined in C and exposed using #[no_mangle] and extern \"C\"? The idea here is to make these stack fiddling routines naked functions so they don't introduce extra assembly overhead, and to give you full control. By jumping to them directly they essentially act as assembly macros, avoiding the function call overhead.</li>\n</ol>\n</blockquote>\n<p>Yes, you can jump to functions defined in C.</p>\n<blockquote>\n<ol start=\"2\">\n<li>Defining function names in Cranelift is a bit confusing. <a href=\"https://docs.rs/cranelift-codegen/latest/cranelift_codegen/ir/enum.UserFuncName.html\">UserFuncName</a> basically takes two arbitrary u32 values, and it's not clear what you'd use those for. Then there's <a href=\"https://docs.rs/cranelift-module/latest/cranelift_module/trait.Module.html#tymethod.declare_function\">Module.declare_function</a> which takes a &amp;str, and looking at some existing Cranelift projects this seems to be what they use. So which one should I use if I want to expose my function names (potentially mangled)?</li>\n</ol>\n</blockquote>\n<p>You should probably be using <code>Module::declare_function</code>. <code>UserFuncName</code> is for when you are avoiding cranelift-jit and cranelift-object, but instead write your own code to do whatever you want with individual functions compiled by Cranelift.</p>\n<blockquote>\n<ol start=\"3\">\n<li>EBBs take variables as arguments, but it's not clear how you'd determine what variables to pass down to sub blocks. For example, if I have a graph where blocks A and B both jump to C, and C depends on a result produced by these blocks, how would I know what variable to pass? My own IR is already a graph but not in SSA, thus blocks can just use variables defined in some earlier block. My graph does ensure that in the above case the blocks A and B write to any variable needed by C where its value can differ per branch.</li>\n</ol>\n</blockquote>\n<p>You can use the cranelift-frontend crate to generate SSA form on the fly.</p>\n<blockquote>\n<ol start=\"4\">\n<li>How would one associate debugger information with their generated code? For example, I would like for a debugger to know about my source code, line numbers, etc. The Cranelift API doesn't seem to offer anything to do things like \"map these instructions to lines X, Y, Z in the source code\". Do I have to fiddle with the likes of e.g. gimli (and whatever the equivalent is for Windows)?</li>\n</ol>\n</blockquote>\n<p>For line info if you use cranelift-frontend you can use set_srcloc with a unique value for every source location. You can then map the SourceLoc you passed in back to the source locations after compilation and use gimli to produce the line tables. See for example <a href=\"https://github.com/bjorn3/rustc_codegen_cranelift/tree/master/src/debuginfo\">https://github.com/bjorn3/rustc_codegen_cranelift/tree/master/src/debuginfo</a>. As for getting debuginfo for local variables there is technically support for it, but not very good.</p>\n<blockquote>\n<ol start=\"5\">\n<li>Does Cranelift have any routines for detecting integer overflows? Instructions such as iadd seem to wrap around on overflow, so detecting it manually is doable if needed; I just don't want to reinvent this if already provided by Cranelift.</li>\n</ol>\n</blockquote>\n<p>You probably have to detect it manually for now. There are instructions like iadd_cout, but they are not supported for all integer sizes on all backends. I would like to see it implemented universally myself.</p>\n<blockquote>\n<ol start=\"6\">\n<li>Cranelift seems to have this notion of heaps for functions, and the ability to restrict functions to a certain portion of the heap. For my language there are no such restrictions (i.e. processes don't use fixed size heaps. How would I express this in Cranelift?</li>\n</ol>\n</blockquote>\n<p>These heaps are mostly for use in the translation from wasm to clif ir. You don't have to use them. The load and store instructions can access the entire address space just fine.</p>\n<blockquote>\n<ol start=\"7\">\n<li>Related to swapping the stacks: if I insert an assembly routine in a function prologue (i.e. the function just starts with a call/jump to such a routine), is there a way to guarantee Cranelift won't move/inject anything before the call/jump? The assembly that might be needed for the system's calling convention should be fine as I can just add some padding to my stacks to account for that, but I don't want Cranelift to think my routine has no side effects and what not and just move it elsewhere.</li>\n</ol>\n</blockquote>\n<p>No, Cranelift will always put a prologue first before doing anything. One option I guess would be to insert raw bytes representing the call before the function. You can use <code>context.compile()</code>, get the compiled code and relocations, insert your custom prologue and then call <code>module.define_function_bytes</code> instead of <code>module.define_function</code>.</p>\n<blockquote>\n<p>and again let me know if it's better to post this elsewhere! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n</blockquote>\n<p><a href=\"#narrow/stream/217117-cranelift\">https://bytecodealliance.zulipchat.com/#narrow/stream/217117-cranelift</a> might be a better place.</p>\n</blockquote>",
        "id": 306464214,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666881681
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293674186\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>Hi @YorickPeterse -- thanks for the questions and interest! Apologies for the state of our documentation: we need to do an update pass, and probably develop more tutorial-like material, but we haven't had the time to do that. In any case, we're happy to answer questions here (or on our <a href=\"https://bytecodealliance.zulipchat.com/\">Zulip</a> in the Cranelift stream), so please keep them coming if you have any more.</p>\n<p>(On preview, I see that bjorn3 has answered a bunch so I'll just add to some of them here)</p>\n<blockquote>\n<ol>\n<li>Cranelift offers no way of injecting assembly directly into the IR. Instead it seems you have to define a C/assembly function then bind to that. Is Cranelift able to jump to a naked function defined in C and exposed using <code>#[no_mangle]</code> and <code>extern \"C\"</code>? The idea here is to make these stack fiddling routines naked functions so they don't introduce extra assembly overhead, and to give you full control. By jumping to them directly they essentially act as assembly macros, avoiding the function call overhead.</li>\n</ol>\n</blockquote>\n<p>We currently don't have a way of injecting assembly at all -- #1041 goes over some of the reasons why. Basically, while it seems conceptually simple (\"just emit the assembly I give you!\"), it actually is enormously complex for all the reasons listed there (see especially <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1041#issuecomment-531574394\">this comment</a>).</p>\n<p>When you say \"jump to a function\", not directly; we can <em>call</em> one though, which is actually probably what you'd want. (Otherwise, how does this snippet know where to jump back to?) Perhaps you were thinking the jump would somehow inline the snippet (we don't have this)?</p>\n<p>Popping up a level (in the X-Y problem sense): the goal here is stack-switching and/or segmented stacks, goroutine-style, no? If so, I'll say that we've had good luck in Wasmtime (built on top of Cranelift) doing fiber-style stack switching for async function calls, and that didn't need anything special in Cranelift. (At a yield point in the runtime when called from Cranelift-generated code, call the \"switch back to host stack\" helper; it pushes registers, switches SP, and returns on the other stack.) We also have explicit support in Cranelft for stack bounds checks. Combining the two, I could see a small modification to the Cranelift prologue generator that would say \"if limit reached, call this runtime function\" and that function would essentially allocate a new stack, switch to it, place a little trampoline on the stack to return back to the previous segment on return, and then jump back to the return address in the function that hit the limit. I'd be happy to help design this feature if you're interested.</p>\n<blockquote>\n<ol start=\"5\">\n<li>Does Cranelift have any routines for detecting integer overflows? Instructions such as <code>iadd</code> seem to wrap around on overflow, so detecting it manually is doable if needed; I just don't want to reinvent this if already provided by Cranelift.</li>\n</ol>\n</blockquote>\n<p>In general, no; we just added some opcodes to help us with lowering Wasm heap checks, but for maximal flexibility I'd suggest inserting checks with explicit IR. We have a set of trap instructions you can use for this: <code>icmp</code> to compare, <code>trapnz</code> on the result.</p>\n<blockquote>\n<ol start=\"8\">\n<li>Related to swapping the stacks: if I insert an assembly routine in a function prologue (i.e. the function just starts with a call/jump to such a routine), is there a way to guarantee Cranelift won't move/inject anything before the call/jump? The assembly that might be needed for the system's calling convention should be fine as I can just add some padding to my stacks to account for that, but I don't want Cranelift to think my routine has no side effects and what not and just move it elsewhere.</li>\n</ol>\n</blockquote>\n<p>This gets back to the inline-assembly question (see above); prologues (and epilogues) in particular are even more special because the compiler generates them to set up its stack frame in a careful way, so even if you could insert instructions somehow, we'd prefer that not to be the case (it would create a brittle coupling between our stackframe and prologue design and your inserted code). We actually had a version of this problem earlier with Cranelift's embedding in SpiderMonkey -- we had a mode to generate code without pro/epilogues and the embedder built them and glued things together, but it was not maintainable.</p>\n<p>In general I like the philosophy of adding useful primitives/building blocks so that they come into the world of the compiler IR/settings and we can understand the interactions with the rest of our codegen. So, as above, I think we can design something for the \"new stack segment if hit limit\" case.<br>\n</p>\n</blockquote>",
        "id": 306470466,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666883301
    },
    {
        "content": "<p>cfallin edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293674186\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>Hi @YorickPeterse -- thanks for the questions and interest! Apologies for the state of our documentation: we need to do an update pass, and probably develop more tutorial-like material, but we haven't had the time to do that. In any case, we're happy to answer questions here (or on our <a href=\"https://bytecodealliance.zulipchat.com/\">Zulip</a> in the Cranelift stream), so please keep them coming if you have any more.</p>\n<p>(On preview, I see that bjorn3 has answered a bunch so I'll just add to some of my thoughts here)</p>\n<blockquote>\n<ol>\n<li>Cranelift offers no way of injecting assembly directly into the IR. Instead it seems you have to define a C/assembly function then bind to that. Is Cranelift able to jump to a naked function defined in C and exposed using <code>#[no_mangle]</code> and <code>extern \"C\"</code>? The idea here is to make these stack fiddling routines naked functions so they don't introduce extra assembly overhead, and to give you full control. By jumping to them directly they essentially act as assembly macros, avoiding the function call overhead.</li>\n</ol>\n</blockquote>\n<p>We currently don't have a way of injecting assembly at all -- #1041 goes over some of the reasons why. Basically, while it seems conceptually simple (\"just emit the assembly I give you!\"), it actually is enormously complex for all the reasons listed there (see especially <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1041#issuecomment-531574394\">this comment</a>).</p>\n<p>When you say \"jump to a function\", not directly; we can <em>call</em> one though, which is actually probably what you'd want. (Otherwise, how does this snippet know where to jump back to?) Perhaps you were thinking the jump would somehow inline the snippet (we don't have this)?</p>\n<p>Popping up a level (in the X-Y problem sense): the goal here is stack-switching and/or segmented stacks, goroutine-style, no? If so, I'll say that we've had good luck in Wasmtime (built on top of Cranelift) doing fiber-style stack switching for async function calls, and that didn't need anything special in Cranelift. (At a yield point in the runtime when called from Cranelift-generated code, call the \"switch back to host stack\" helper; it pushes registers, switches SP, and returns on the other stack.) We also have explicit support in Cranelft for stack bounds checks. Combining the two, I could see a small modification to the Cranelift prologue generator that would say \"if limit reached, call this runtime function\" and that function would essentially allocate a new stack, switch to it, place a little trampoline on the stack to return back to the previous segment on return, and then jump back to the return address in the function that hit the limit. I'd be happy to help design this feature if you're interested.</p>\n<blockquote>\n<ol start=\"5\">\n<li>Does Cranelift have any routines for detecting integer overflows? Instructions such as <code>iadd</code> seem to wrap around on overflow, so detecting it manually is doable if needed; I just don't want to reinvent this if already provided by Cranelift.</li>\n</ol>\n</blockquote>\n<p>In general, no; we just added some opcodes to help us with lowering Wasm heap checks, but for maximal flexibility I'd suggest inserting checks with explicit IR. We have a set of trap instructions you can use for this: <code>icmp</code> to compare, <code>trapnz</code> on the result.</p>\n<blockquote>\n<ol start=\"8\">\n<li>Related to swapping the stacks: if I insert an assembly routine in a function prologue (i.e. the function just starts with a call/jump to such a routine), is there a way to guarantee Cranelift won't move/inject anything before the call/jump? The assembly that might be needed for the system's calling convention should be fine as I can just add some padding to my stacks to account for that, but I don't want Cranelift to think my routine has no side effects and what not and just move it elsewhere.</li>\n</ol>\n</blockquote>\n<p>This gets back to the inline-assembly question (see above); prologues (and epilogues) in particular are even more special because the compiler generates them to set up its stack frame in a careful way, so even if you could insert instructions somehow, we'd prefer that not to be the case (it would create a brittle coupling between our stackframe and prologue design and your inserted code). We actually had a version of this problem earlier with Cranelift's embedding in SpiderMonkey -- we had a mode to generate code without pro/epilogues and the embedder built them and glued things together, but it was not maintainable.</p>\n<p>In general I like the philosophy of adding useful primitives/building blocks so that they come into the world of the compiler IR/settings and we can understand the interactions with the rest of our codegen. So, as above, I think we can design something for the \"new stack segment if hit limit\" case.<br>\n</p>\n</blockquote>",
        "id": 306470559,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666883326
    },
    {
        "content": "<p>YorickPeterse <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293676154\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>@bjorn3 Thanks for the answers so far!</p>\n<blockquote>\n<p>Yes, you can jump to functions defined in C.</p>\n</blockquote>\n<p>In the documentation of cranelift_codegen the closest I could find is <a href=\"https://docs.rs/cranelift-codegen/latest/cranelift_codegen/ir/trait.InstBuilder.html#method.jump\">https://docs.rs/cranelift-codegen/latest/cranelift_codegen/ir/trait.InstBuilder.html#method.jump</a>, but this jumps to a block and not a random memory address. Should I perhaps look in a different crate for this?</p>\n<blockquote>\n<p>You can use the cranelift-frontend crate to generate SSA form on the fly.</p>\n</blockquote>\n<p>Looking at the example on <a href=\"https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example\">https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example</a>, it seems to use jumps but leaves out the arguments. Am I correct in thinking that if you use <code>use_var()</code> in a sub block, Cranelift automatically passes its input as an argument when jumping to said block? That is, if you have a graph like this:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"n\">A</span><span class=\"w\">    </span><span class=\"n\">assign</span><span class=\"w\"> </span><span class=\"n\">a</span><span class=\"w\"> </span><span class=\"n\">to</span><span class=\"w\"> </span><span class=\"mi\">42</span><span class=\"w\"></span>\n<span class=\"o\">|</span><span class=\"w\"></span>\n<span class=\"o\">+--------</span>-&gt;<span class=\"o\">---------</span>-&gt; <span class=\"nc\">C</span><span class=\"w\"> </span><span class=\"k\">use</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">)</span><span class=\"w\"></span>\n<span class=\"o\">|</span><span class=\"w\"></span>\n<span class=\"n\">B</span><span class=\"w\">    </span><span class=\"n\">assign</span><span class=\"w\"> </span><span class=\"n\">a</span><span class=\"w\"> </span><span class=\"n\">to</span><span class=\"w\"> </span><span class=\"mi\">50</span><span class=\"w\"></span>\n</code></pre></div>\n<p>Does Cranelift construct the graph such that it passes <code>a</code> in blocks A and B as an argument to block C, such that <code>a</code> in C is whatever value was produced in the branch leading up to it? Or do I have to explicitly set <code>a</code> in A/B as an argument for the jump(s) to C?</p>\n<blockquote>\n<p>No, Cranelift will always put a prologue first before doing anything. One option I guess would be to insert raw bytes representing the call before the function. You can use context.compile(), get the compiled code and relocations, insert your custom prologue and then call module.define_function_bytes instead of module.define_function.</p>\n</blockquote>\n<p>I suspect this would probably get a bit tricky, and maybe break across versions. If I just insert a function call as the first instruction after the prologue, is there anything I can do to prevent Cranelift from moving it around, i.e. is there something like a compiler barrier? If so I think that should be good enough.</p>\n<blockquote>\n<p><a href=\"#narrow/stream/217117-cranelift\">https://bytecodealliance.zulipchat.com/#narrow/stream/217117-cranelift</a> might be a better place.</p>\n</blockquote>\n<p>I thought about the Zulip, but it's too easy to lose track of things in a chat channel unfortunately. But if desired I can ask things over there instead <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n</blockquote>",
        "id": 306470650,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666883354
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293683113\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<blockquote>\n<p>Looking at the example on <a href=\"https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example\">https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example</a>, it seems to use jumps but leaves out the arguments. Am I correct in thinking that if you use use_var() in a sub block, Cranelift automatically passes its input as an argument when jumping to said block?</p>\n</blockquote>\n<p>Correct. Cranelift-frontend automatically appends basic block arguments as necessary to handle SSA form.</p>\n</blockquote>",
        "id": 306471311,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666883515
    },
    {
        "content": "<p>YorickPeterse <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293725669\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>@cfallin</p>\n<blockquote>\n<p>We currently don't have a way of injecting assembly at all -- #1041 goes over some of the reasons why. Basically, while it seems conceptually simple (\"just emit the assembly I give you!\"), it actually is enormously complex for all the reasons listed there (see especially this comment).</p>\n</blockquote>\n<p>I had indeed seen the issue, and I figured it wouldn't be as easy as just dumping assembly in the middle of the IR <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<blockquote>\n<p>When you say \"jump to a function\", not directly; we can call one though, which is actually probably what you'd want. (Otherwise, how does this snippet know where to jump back to?) Perhaps you were thinking the jump would somehow inline the snippet (we don't have this)?</p>\n</blockquote>\n<p>Ah yeah good point, I forgot about actually having to jump back; heh.</p>\n<p>Either way, the function call cost isn't really something to worry about so calling a helper function should be fine.</p>\n<blockquote>\n<p>Popping up a level (in the X-Y problem sense): the goal here is stack-switching and/or segmented stacks, goroutine-style, no?</p>\n</blockquote>\n<p>Pretty much. I was planning on taking the approach outlined in <a href=\"https://graphitemaster.github.io/fibers/\">https://graphitemaster.github.io/fibers/</a> where I'd just define a bunch of routines in assembly (instead of using setjmp/longjmp), then call those in the appropriate places.</p>\n<blockquote>\n<p>Combining the two, I could see a small modification to the Cranelift prologue generator that would say \"if limit reached, call this runtime function\" and that function would essentially allocate a new stack, switch to it, place a little trampoline on the stack to return back to the previous segment on return, and then jump back to the return address in the function that hit the limit. I'd be happy to help design this feature if you're interested.</p>\n</blockquote>\n<p>I can see this being useful, though I currently don't know enough about Cranelift or how exactly I would implement the routine in a cross-platform way. I think it would probably be best to first implement this in my language, then maybe come back to Cranelift to see how/if it makes sense for it to provide a generalised solution.</p>\n</blockquote>",
        "id": 306477895,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666885315
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293740859\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>For segmented stacks following the same abi as <a href=\"https://gcc.gnu.org/wiki/SplitStacks\">https://gcc.gnu.org/wiki/SplitStacks</a> may work. LLVM also implements this and Rust itself used to use it back when it still used green threads.</p>\n</blockquote>",
        "id": 306480426,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666886014
    },
    {
        "content": "<p>YorickPeterse <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293781779\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>@bjorn3 @cfallin Thanks for the info! I'll move this to Zulip and close the issue <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n</blockquote>",
        "id": 306487767,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666888076
    },
    {
        "content": "<p>YorickPeterse closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>I'm looking into using Cranelift as a backend for <a href=\"https://inko-lang.org/\">a programming language that I'm working on</a>. Other options I have been looking into are compiling to C or using LLVM, but both come with their own set of trade-offs I'm not a fan of. For example, LLVM is generally quite slow, while C compilers tend to not give you enough control (i.e. they may reorder things unless you carefully insert compiler barriers). Cranelift is promising because of the amount of control it gives, and because it's written in Rust.</p>\n<p>Unfortunately, the Cranelift documentation is limited, to a point where I'm overwhelmed/confused about where to even start. In this issue I'll be asking several questions to hopefully clear this up. If there's a better place for asking long-form questions like this, please let me know <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n<p>To set the stage: Inko is a language similar to Go/Erlang in that it has lightweight processes, and these can suspend at more or less any place (technically these spots are known, e.g. when performing IO, but to the user it may as well be \"anywhere\"). This means I need to be able to maintain and swap the stacks, like stackful coroutines. I also need to be able to grow the stack, and maybe shrink it (though figuring out _when_ to do that is really tricky). Bare-metal performance is not a main goal, rather I want something that compiles fast and performs better than a well optimised interpreter (without a JIT), something I think one should be able to achieve with Cranelift.</p>\n<p>Which brings me to the questions I have, in no particular order:</p>\n<ol>\n<li>\n<p>Cranelift offers no way of injecting assembly directly into the IR. Instead it seems you have to define a C/assembly function then bind to that. Is Cranelift able to jump to a naked function defined in C and exposed using <code>#[no_mangle]</code> and <code>extern \"C\"</code>? The idea here is to make these stack fiddling routines naked functions so they don't introduce extra assembly overhead, and to give you full control. By jumping to them directly they essentially act as assembly macros, avoiding the function call overhead.</p>\n</li>\n<li>\n<p>Defining function names in Cranelift is a bit confusing. <a href=\"https://docs.rs/cranelift-codegen/latest/cranelift_codegen/ir/enum.UserFuncName.html\"><code>UserFuncName</code></a> basically takes two arbitrary <code>u32</code> values, and it's not clear what you'd use those for. Then there's <a href=\"https://docs.rs/cranelift-module/latest/cranelift_module/trait.Module.html#tymethod.declare_function\"><code>Module.declare_function</code></a> which takes a <code>&amp;str</code>, and looking at some existing Cranelift projects this seems to be what they use. So which one should I use if I want to expose my function names (potentially mangled)?</p>\n</li>\n<li>\n<p>EBBs take variables as arguments, but it's not clear how you'd determine what variables to pass down to sub blocks. For example, if I have a graph where blocks <code>A</code> and <code>B</code> both jump to <code>C</code>, and <code>C</code> depends on a result produced by these blocks, how would I know what variable to pass? My own IR is already a graph but not in SSA, thus blocks can just use variables defined in some earlier block. My graph does ensure that in the above case the blocks <code>A</code> and <code>B</code> write to any variable needed by <code>C</code> where its value can differ per branch. </p>\n</li>\n<li>\n<p>How would one associate debugger information with their generated code? For example, I would like for a debugger to know about my source code, line numbers, etc. The Cranelift API doesn't seem to offer anything to do things like \"map these instructions to lines X, Y, Z in the source code\". Do I have to fiddle with the likes of e.g. gimli (and whatever the equivalent is for Windows)?</p>\n</li>\n<li>\n<p>Does Cranelift have any routines for detecting integer overflows? Instructions such as <code>iadd</code> seem to wrap around on overflow, so detecting it manually is doable if needed; I just don't want to reinvent this if already provided by Cranelift.</p>\n</li>\n<li>\n<p>Cranelift seems to have this notion of heaps for functions, and the ability to restrict functions to a certain portion of the heap. For my language there are no such restrictions (i.e. processes don't use fixed size heaps. How would I express this in Cranelift?</p>\n</li>\n<li>\n<p>Related to that, I'm seeing various hints about Cranelift performing heap bounds checking in various places. It's not clear to me if this would be needed in my case, and if not if there's a way of opting out (i.e. I don't want redundant heap bounds checking in my generated code). Is there more information on this somewhere?</p>\n</li>\n<li>\n<p>Related to swapping the stacks: if I insert an assembly routine in a function prologue (i.e. the function just starts with a call/jump to such a routine), is there a way to guarantee Cranelift won't move/inject anything before the call/jump? The assembly that might be needed for the system's calling convention should be fine as I can just add some padding to my stacks to account for that, but I don't want Cranelift to think my routine has no side effects and what not and just move it elsewhere.</p>\n</li>\n</ol>\n<p>Thanks for answering any of these questions, and again let me know if it's better to post this elsewhere! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n</blockquote>",
        "id": 306487770,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666888076
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293820586\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>As other folks have said, welcome! Although Cranelift is co-developed with Wasmtime which gives Wasmtime a little bit of a privileged position, we explicitly want to support projects like yours. So we're excited to hear from you!</p>\n<p>I especially want to emphasize that we're open to making changes to Cranelift to support new use cases. We have to balance that against making sure we have the resources for ongoing maintenance of every change we merge. But if you find that it's impossible to do something you need using Cranelift, just keep in mind that fixing Cranelift is an option.</p>\n<blockquote>\n<blockquote>\n<p>Looking at the example on <a href=\"https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example\">https://docs.rs/cranelift-frontend/latest/cranelift_frontend/#example</a>, it seems to use jumps but leaves out the arguments. Am I correct in thinking that if you use use_var() in a sub block, Cranelift automatically passes its input as an argument when jumping to said block?</p>\n</blockquote>\n<p>Correct. Cranelift-frontend automatically appends basic block arguments as necessary to handle SSA form.</p>\n</blockquote>\n<p>To clarify, \"as necessary\" is doing double-duty here. Cranelift allows you to use a value in one block that was defined in another block, as long as the definition dominates the use. So <code>cranelift-frontend</code> will avoid adding a block parameter if there's exactly one definition of the variable that reaches the use. You shouldn't have to think about that as long as you use <code>cranelift-frontend</code> but it's good to be aware of if you're reading the generated Cranelift IR.</p>\n<blockquote>\n<p>If I just insert a function call as the first instruction after the prologue, is there anything I can do to prevent Cranelift from moving it around[...]?</p>\n</blockquote>\n<p>I believe, and @cfallin can correct me if I'm wrong, that currently 1) Cranelift won't move side-effecting instructions, and 2) it treats all function calls as side-effecting. It may move pure instructions past effectful ones, but I think it'll never move a pure instruction any _earlier_ in the function. So I think the current state is that if a function call is the first instruction, it will still be the first instruction after all optimizations, and only the prologue will precede it in the final machine code.</p>\n<p>Whether you can rely on that behavior in the future is another question, of course.</p>\n<p>I don't entirely understand what you're trying to do, but I'm curious whether the <code>get_stack_pointer</code> instruction added in #4573 helps your use case at all, and we can always talk about adding more instructions if we have a good motivating use case for them. Since there's ongoing work in the WebAssembly standards world on proposals for stack-switching, it could even be that Wasmtime is going to need something similar to whatever you're looking for. If there are two projects both looking for the same features from Cranelift, then that's especially strong motivation to come up with a good design.</p>\n</blockquote>",
        "id": 306495684,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666890229
    },
    {
        "content": "<p>YorickPeterse <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293966595\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<p>@jameysharp Thanks for the reply! </p>\n<blockquote>\n<p>I don't entirely understand what you're trying to do, but I'm curious whether the get_stack_pointer instruction added in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4573\">https://github.com/bytecodealliance/wasmtime/pull/4573</a> helps your use case at all, and we can always talk about adding more instructions if we have a good motivating use case for them.</p>\n</blockquote>\n<p>Essentially I'd need routines for the following:</p>\n<ol>\n<li>Allocating memory that can be used as stack memory. This is out of the scope of Cranelift I think, and OS/calling convention specific (i.e. Windows of course does things its own way compared to everybody else). This I'd implement in my Rust based runtime library, using the appropriate OS functions.</li>\n<li>A routine that takes a pointer to such a chunk of memory, and turns it into the current OS thread's stack memory. I think this involves mostly changing the stack pointer to point to this chunk of memory.</li>\n<li>A routine for writing all registers to a buffer, using the steps described in <a href=\"https://graphitemaster.github.io/fibers/#getting-the-context\">https://graphitemaster.github.io/fibers/#getting-the-context</a>. For this I'd use an assembly function, or maybe a naked Rust function with inline assembly; I haven't decided yet. This being provided in a reusable manner is something I could see being useful, but I'm not sure it would fit within the scope of Cranelift.</li>\n<li>A routine that takes the current stack pointer and stores it somewhere, so that we can restore this stack later on. </li>\n</ol>\n<p>This is basically what <a href=\"https://graphitemaster.github.io/fibers/#user-space-context-switching\">https://graphitemaster.github.io/fibers/#user-space-context-switching</a> discusses, but in Rust/Cranelift instead of C.</p>\n</blockquote>",
        "id": 306522143,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666898710
    },
    {
        "content": "<p>YorickPeterse <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293975490\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<blockquote>\n<p>A routine for writing all registers to a buffer, using the steps described in <a href=\"https://graphitemaster.github.io/fibers/#getting-the-context\">https://graphitemaster.github.io/fibers/#getting-the-context</a>.</p>\n</blockquote>\n<p>On second though, if Cranelift were to provide this it would be able to only save the registers actually in use at that point, rather that pessimistically having to assume any of them may be used, and thus having to save all of them. </p>\n<p>The inverse would also be true: if we have known wake-up points, Cranelift would know which registers are in use afterwards, and only restore those. This may be less useful though, as based on the register allocator and the code that follows it might just be easier to restore all of them.</p>\n</blockquote>",
        "id": 306523661,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666899246
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141#issuecomment-1293977851\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5141\">issue #5141</a>:</p>\n<blockquote>\n<blockquote>\n<p>On second though, if Cranelift were to provide this it would be able to only save the registers actually in use at that point, rather that pessimistically having to assume any of them may be used, and thus having to save all of them.</p>\n</blockquote>\n<p>That linked code only saves callee saved registers which have to be saved anyway for ABI reasons.</p>\n</blockquote>",
        "id": 306524087,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1666899389
    }
]