[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005120552\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<p>Thanks! I ran a quick sanity-check with <code>bz2</code> and found no perf regressions. A full sightglass run is usually an overnight ordeal if I give it enough iterations to be meaningful and last time I tried it there were still some weird bimodal-performance gremlins, so I'm hesitant to block anything on that. It's certainly the case that this change could regress FP-heavy code that spills registers, though; no benchmarks needed for that conclusion.</p>\n<p>The reason I feel pretty strongly about doing it anyway is that there are \"unknown unknowns\": once I realized that <a href=\"http://regalloc.rs\">regalloc.rs</a> merges all vregs linked by move-elision into one equivalence class and gives us the type of an <em>arbitrary</em> one, that means we need to carefully audit all of our uses of move and move-like instructions for type safety. <code>raw_bitcast</code> is one example, but there may be others. In short, it's an invariant we didn't stick to initially, so now we've lost it and we need to do a lot of work before we can rely on it again.</p>\n<p>This is a safety issue that @julian-seward1 actually pointed out back in Jan 2020 when we were designing the <a href=\"http://regalloc.rs\">regalloc.rs</a> API; I pushed for using the vreg type to use smaller spillslots where possible, but given that this has now caused one real CVE and would have caused another CVE here if we had released SIMD support, I think that was a mistake, or at least we didn't adequately consider how to maintain the type-safety in the IR-to-registers mapping.</p>\n<p>One could reasonably ask: how do other compilers get this right, and use spillslots only as large as necessary? The answer is better discipline in all of the lowering patterns. I think one way of getting this would be to actually require an IR-level type to be passed down into the register allocator for each vreg; it would be opaque to the regalloc, but would be checked for every move (and would cause a panic if a cross-type move occurs). If we do that and fuzz all the panics out, we could probably move back to \"spillslot only as large as actual type\". I'll file an issue for this, and probably the right time to consider it is at the same time as we move over to regalloc2.</p>\n<p>Hopefully that seems reasonable; thoughts?</p>\n</blockquote>",
        "id": 266853991,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641325653
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005135902\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<blockquote>\n<p>A full sightglass run is usually an overnight ordeal [..] so I'm hesitant to block anything on that</p>\n</blockquote>\n<p>cc @fitzgen and @jlb6740  while not super relevant to this PR per-se this seems relevant to sightglass.</p>\n<blockquote>\n<p>Hopefully that seems reasonable; thoughts?</p>\n</blockquote>\n<p>That all sound reasonable to me, yeah, thanks for writing that up! I like the idea of passing opaque types to regalloc and regalloc could also possibly automatically determine that a move between two vregs isn't an equivalence class of vregs if the vregs have different types, assigning them separate live ranges and such.</p>\n</blockquote>",
        "id": 266856697,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641327094
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005137504\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<p>It isn't an overnight thing for me (at least for the realistic benchmarks, I don't run the shootout ones) usually just half an hour or so.</p>\n</blockquote>",
        "id": 266857009,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641327247
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005141368\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<blockquote>\n<p>It isn't an overnight thing for me (at least for the realistic benchmarks, I don't run the shootout ones) usually just half an hour or so.</p>\n</blockquote>\n<p>Ah, OK, it's certainly possible I was holding it wrong; I remember cranking up the iterations and letting it run for a long time to try to get reasonable confidence intervals; and I remember you mentioning something similar (... on some searching, <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3506#issuecomment-966504233\">this comment</a>) but maybe it's improved. Anyway, a separate topic; I'd love to be able to just ping a GitHub bot for this :-)</p>\n</blockquote>",
        "id": 266857716,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641327595
    },
    {
        "content": "<p>abrown <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005152768\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<p>I'm not a big fan of using extra stack space but I guess it makes sense as a temporary measure.</p>\n<blockquote>\n<p>that means we need to carefully audit all of our uses of move and move-like instructions for type safety. <code>raw_bitcast</code> is one example, but there may be others.</p>\n</blockquote>\n<p>I think the existence of <code>raw_bitcast</code> is an indicator of a leaky abstraction in the IR and APIs. Ideally we could resolve that issue and get rid of it. Having to carefully audit moves reinforces this impression for me: whoever is lowering should not need to also worry about regalloc beyond reserving a temporary register once in a while.</p>\n<blockquote>\n<p>One could reasonably ask: how do other compilers get this right, and use spillslots only as large as necessary? The answer is better discipline in all of the lowering patterns.</p>\n</blockquote>\n<p>I don't know if it is \"programmer discipline\" as much as \"abstraction discipline.\" In V8, there are surely ways to make a mistake during lowering but my opinion is that this area is designed to be easier to use (no/less invariants to remember).</p>\n<blockquote>\n<p>I think one way of getting this would be to actually require an IR-level type to be passed down into the register allocator for each vreg; it would be opaque to the regalloc, but would be checked for every move (and would cause a panic if a cross-type move occurs). </p>\n</blockquote>\n<p>An alternate suggestion: perhaps regalloc should be smarter about <code>RegClass</code> and have a way to express that, e.g., \"<code>RegClass::F64</code> fits in the lower bits of <code>RegClass::V128</code>\" and the like. That way the IR types can map 1-to-1 to <code>RegClass</code> and the abstraction will not leak.<br>\n</p>\n</blockquote>",
        "id": 266859934,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641328658
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005157073\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<p>I just ran a few Sightglass benchmarks (<code>blake3</code>, <code>pulldown-cmark</code>, <code>bz2</code>, <code>meshoptimizer</code>) and saw no difference in runtime. I suspect we'd see more if we had benchmarks with lots of live FP values, but we don't seem to have any like that at the moment.</p>\n<p><a href=\"https://gist.github.com/cfallin/25250f6321acccc8ac5976acfe63686b\">results</a></p>\n</blockquote>",
        "id": 266860662,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641329068
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645#issuecomment-1005160353\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/3645\">issue #3645</a>:</p>\n<blockquote>\n<blockquote>\n<p>I don't know if it is \"programmer discipline\" as much as \"abstraction discipline.\"</p>\n</blockquote>\n<p>Yes, absolutely, \"discipline in lowering patterns\" was ambiguous, sorry! We should build guardrails into the abstractions that prevent us from doing the wrong thing by mistake or unknowingly; we clearly didn't do enough here.</p>\n</blockquote>",
        "id": 266861235,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1641329380
    }
]