[
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1141#issuecomment-772719816\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1141\">Issue #1141</a>:</p>\n<blockquote>\n<p>The new backend framework doesn't use recipes.</p>\n</blockquote>",
        "id": 225057968,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612376546
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1141#issuecomment-772750688\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1141\">Issue #1141</a>:</p>\n<blockquote>\n<p>Indeed; we might as well close this one now!</p>\n</blockquote>",
        "id": 225065737,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612379558
    },
    {
        "content": "<p>cfallin closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1141\">Issue #1141</a>:</p>\n<blockquote>\n<p>(Really a meta-issue about the meta-crate!)</p>\n<p>Nobody likes Recipes. They were supposed to contain factored-out fields of the encodings. But they're mostly one indirection layer that's hard to understand, that needs to be explained to newcomers, and doesn't solve the factoring out problem ideally. For instance, if you want to use one recipe, but just one register allocation constraint differs from the one you're looking at, you'll need to duplicate it and change the one constraint. Other things that are always unclear are whether an instruction/ISA predicate should be attached to an Encoding or to the underlying Recipe.</p>\n<p>Let's kill recipes with fire. There's been discussions about this, and a general agreement that it's the right thing to do: it'll make the code easier to understand, more straightforward, and it'll be more pleasant for contributors in general.</p>\n<p>The general plan is backed by the following idea:</p>\n<ol>\n<li>take a subset of related fields in the Recipe</li>\n<li>put them in the Encoding instead</li>\n<li>rinse and repeat step 1 until there's nothing anymore in the Recipe</li>\n<li>???</li>\n<li>fun and profit</li>\n</ol>\n<p>I've thought about this, and I think the following groups can be done in chunks, so they can serve as divides of the work that's needed here:</p>\n<ul>\n<li>[ ] On x86, have the REX byte emission be a runtime decision in the binemit code, rather than a different encoding. That's <a href=\"https://github.com/bytecodealliance/wasmtime/issues/1130\">bytecodealliance/wasmtime#1130</a>. <ul>\n<li>[ ] Once that's done, replace x86's <code>Template</code> by helper functions that take an Encoding and tweak it to return a new encoding.</li>\n</ul>\n</li>\n<li>[ ] Move ISA and instruction predicates over to Encoding (This is likely to make legalization slightly faster, since the ISel interpreter is able to deduplicate tests for a given pair of (ISA, instruction) predicates attached to several encodings.)<ul>\n<li>[ ] Then we can simplify code in the ISel interpreter to not store and check recipe predicates.</li>\n</ul>\n</li>\n<li>[ ] Move register allocation constraints over to Encoding; these are <code>operands_in/operands_out</code> right now, giving constraints to Value inputs and outputs of a given Instruction.</li>\n<li>[ ] Move binemit code + size computation information over to Encoding (<code>base_size/compute_size/branch_range</code>). Note (I think) we don't need to move the <code>format</code> field, because an Encoding is attached to an Instruction that has its own format. (Because of recipes, one could attach different formats to the Instruction / Encoding, causing a runtime error in the build script. Good riddance!)<ul>\n<li>[ ] Create an enum for binemit functions, so they can still be shared across Encodings.</li>\n<li>[ ] Use enums instead of plain function pointers for compute_size, to avoid indirect calls in the codegen crate.</li>\n<li>[ ] (Bonus) Find a way so binemit function bodies are compiled as part of the meta crate itself (macro?).</li>\n</ul>\n</li>\n<li>[ ] Move <code>clobbers_flags</code> to the Encoding.</li>\n</ul>\n<p>Some of these items might not be doable as I expect; I tried to imagine what the could would ideally look like, but the reality of how things are in Cranelift may have us go down a different road.</p>\n<p>Each step will imply some work in the codegen crate too, to make sure it's still working properly, as well as opportunities for simplifications. I haven't put items for each simplification, because it's somewhat unclear in general what these could be, but they may exist. It'd be nice that each step belonged to its own PR (substeps can go in commits), to avoid boiling the ocean at once ;)</p>\n</blockquote>",
        "id": 225065738,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1612379559
    }
]