[
    {
        "content": "<p>uweigand opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<p>In implementing support for struct-args and i128 to enable <code>rustc_codegen_cranelift</code> on s390x, I ran into two features that are not currently available with the common <code>abi_impl</code> implementation.</p>\n<hr>\n<p><strong>Struct arguments using an explicit buffer address</strong></p>\n<p>Many commonly used ABIs have special provisions for (large) struct arguments that cannot be passed in registers.  However, there are two typical flavors of these, and <code>abi_impl</code> only supports one of them.</p>\n<p>Both these flavors have in common that the actual argument is copied by the caller into a buffer on the stack; the callee will then read the argument from that buffer, and is even free to modify it.  However, the two flavors differ in how the address of that buffer is _communicated_ from the caller to the callee:</p>\n<ol>\n<li>Implicit buffer address.   With this flavor, that ABI implicitly defines the location of the buffer, usually by making the buffer part of the same area used for stack slots for overflow scalar arguments.  Both caller and callee can compute the location of the buffer at compile time simply based on the function call signature; the address is not materialized as part of the run-time call sequence.</li>\n<li>Explicit buffer address.  Here, the ABI does not define the location of the buffer itself, but leaves the compiler free to place it anywhere.  The actual location of the buffer is passed at run-time from caller to callee, typically in a register (or overflow stack slot) as if we had a pointer at this place in the function call signature.</li>\n</ol>\n<p>There are pros and cons to either approach, leading to different choices of method across platform ABIs.  In particular, <code>x86_64</code> nearly always uses the implicit buffer address method, with the only exception of structures whose size is not a compile-time constant.  Many other platforms, including <code>s390x</code>, use the the explicit buffer address method always, which allows the opportunity to the compiler to avoid actually copying the structure, e.g. if the original copy can be shown to be unused after the call so it wouldn't matter if the callee clobbers its contents.</p>\n<p>However, the current cranelift <code>abi_impl</code> _only_ supports the implicit buffer address method.   This should mostly be OK for <code>x64_64</code> - I'm not sure if variable-sized structures passed by value even exist with the rustc frontend.   However, even for <code>aarch64</code> I believe the current implementation is already incorrect - as far as I can see, GCC and LLVM use the explicit buffer address method on this architecture.    This is definitely also the case on <code>s390x</code>.</p>\n<p>This should be straightforward to fix, and I already have an implementation.   The main change is to the <code>ABIArg</code> data type, which currently holds <em>either</em> a vector of <code>ABISlot</code>s (registers or overflow stack slots) <em>or</em> a <code>StructArg</code> identifying a buffer location on the stack.  I've changed this to optionally provide <em>both</em> these items - where the semantics of providing both means that the <code>ABISlot</code> identifies the register (or overflow stack slot) needed to hold the address of the buffer at run time.</p>\n<hr>\n<p><strong>Type legalization in the back-end</strong></p>\n<p>If a function signature contains an argument of a type that cannot be directly passed in registers or overflow stack slots, but needs to use the (explicit or implicit) struct-arg buffer method,  the function signature needs to be legalized: this consists of replacing the argument of struct type by a <strong>pointer</strong> to that struct type, and adding code around function call sites as well as prologue and epilogue to convert between the two (taking the address of the struct, or dereferencing the pointer, as appropriate).</p>\n<p>Now, usually this legalization is already done by the language front-end (whether clang or rustc), and by the time the (LLVM or cranelift) IR gets to the back end, we already have a pointer type.  And in fact the current <code>abi_impl</code> assumes that exactly this is the case.</p>\n<p>But this is unfortunately not universally true.  There are a few cases whether the front end does not perform any legalization, but rather relies on the (currently LLVM) back end for that.  This is the case in particular for the <code>i128</code> data type on <code>s390x</code>.   This remains as a scalar integer type in function call signatures, but is actually _implemented_ using a hidden buffer like the struct-arg case.   With LLVM, this legalization is performed in the back-end - and to implement <code>i128</code> in cranelift, we probably need to do the same here.</p>\n<p>Interestingly enough, the <code>AbiParam</code> data type in cranelift contains a <code>legalized_to_pointer</code> flag which would appear to address exactly this situation.  However, as far as I can tell this flag is currently never set or used in all of cranelift.   It is not clear to me how this was originally intended to be used, or where exactly this legalization would have been done.</p>\n<p>I have implemented the functionality for now using yet another flavor of the <code>ABIArg</code> data type, but that seems a bit of a hack.  One problem is that when implementing the pointer dereferencing in the prologue, the <code>ABIArg</code> slots only carry type information for the pointer (usually <code>I64</code>), and possibly the size of the buffer, but not the <em>type</em> of the buffer, so it is a bit unclear which instruction to use to implement the dereferencing.</p>\n<p>Another problem is that if the buffer address is passed explicitly, but in a stack slot, we require a temporary register to load that address in order to dereference it (since the <code>into_regs</code> will hold the final <code>i128</code> value, which lives in the vector register set on <code>s390x</code>, it cannot be used as address).   It's not quite clear how to allocate a temp at this stage in the compilation process.  (I'm using the \"stack limit register\" right now, which appears to work, but I'm not sure this is guaranteed to be OK on all platforms.)</p>\n<p>Finally, this legalization needs to be done not just for function arguments, but also <em>return values</em>.   Here, <code>abi_impl</code> already has code to allocate a buffer in the caller and pass its address to the callee so it can place the return value there.  This is exactly what we need on <code>s390x</code> for a <code>i128</code> return value - except for one implementation detail: cranelift passes that implicit pointer as <em>last</em> argument (because this is expected by wasmtime when used for the multiple return value extension), while the platform ABI requires the implicit pointer as <em>first</em> argument.   To work around this, I'm now passing the return pointer first if the <code>enable_llvm_abi_extensions</code> flag is true, and last otherwise.  This seems to work with both wasmtime and rustc_codegen_cranelift, but also feels like a hack.</p>\n<hr>\n<p>@cfallin these are the problems I mentioned in our last meeting.  I'd be happy to implement a solution, but I'd appreciate some guidance / discussion on what the correct approach should be.<br>\n</p>\n</blockquote>",
        "id": 291492412,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659276337
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1200438175\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<p>For i128 in the C ABI, rustc already performs the pass-by-ref transformation itself, so Cranelift just sees a pointer. For the Rust ABI however you are right that the transformation needs to happen in the backend.</p>\n<blockquote>\n<p>except for one implementation detail: cranelift passes that implicit pointer as last argument (because this is expected by wasmtime when used for the multiple return value extension), while the platform ABI requires the implicit pointer as first argument. To work around this, I'm now passing the return pointer first if the enable_llvm_abi_extensions flag is true, and last otherwise. This seems to work with both wasmtime and rustc_codegen_cranelift, but also feels like a hack.</p>\n</blockquote>\n<p>Wasmtime has a separate call conv variant called <code>WasmtimeSystemV</code> which is documented as affecting the way values are returned. I think you should match on the call conv, not the enable_llvm_abi_extensions flag. Also i128 isn't used at all by wasmtime, so it is probably fine to simply error on i128 returns on <code>WasmtimeSystemV</code>.</p>\n</blockquote>",
        "id": 291493904,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659278301
    },
    {
        "content": "<p>uweigand <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1200457611\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<blockquote>\n<p>Wasmtime has a separate call conv variant called <code>WasmtimeSystemV</code> which is documented as affecting the way values are returned. I think you should match on the call conv, not the enable_llvm_abi_extensions flag. Also i128 isn't used at all by wasmtime, so it is probably fine to simply error on i128 returns on <code>WasmtimeSystemV</code>.</p>\n</blockquote>\n<p>This seems to be working fine for me, and makes sense.   Thanks for the suggestion!</p>\n</blockquote>",
        "id": 291499329,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659285195
    },
    {
        "content": "<p>uweigand <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1201435136\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<blockquote>\n<p>Interestingly enough, the <code>AbiParam</code> data type in cranelift contains a <code>legalized_to_pointer</code> flag which would appear to address exactly this situation. However, as far as I can tell this flag is currently never set or used in all of cranelift. It is not clear to me how this was originally intended to be used, or where exactly this legalization would have been done.</p>\n</blockquote>\n<p>Doing a bit of archaeology on this, this was used to implement <code>ValueConversion::Pointer</code>, which was introduced in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/1670\">https://github.com/bytecodealliance/wasmtime/pull/1670</a> and only ever used by the 32-bit x86 backend.  So after that backend went away, the only user was gone, and when old-style legalization was removed completely a bit later on, support for <code>ValueConversion</code> went away with it, and no equivalent feature was ever added to the new ABI code used by new-style backends.</p>\n</blockquote>",
        "id": 291599742,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659371336
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1201547850\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<p>@uweigand thanks for the detailed writeup on these issues! At this point you will have likely paged in much more of the option-space here than I have; I wrote much of this code but my mental L2 cache has been thrashed many times over. So I'd defer to your suggested approaches above, as they sound reasonable. If my understanding is right, this is kind of a dual to the struct-arg mechanism: for struct args, the IR value is a pointer, and the ABI code allocates the space (implicit location, as you say); while here the IR value is the value stored in memory. That seems like a reasonable option to support.</p>\n<p>I do think that if we can manage it, avoiding a separate legalization <em>pass</em> is ideal; I'd prefer that we handle everything inline in <code>abi_impl</code>, as long as the complexity is not too bad. But it seems that we could consider the large-types-passed-as-pointers when computing the stackframe layout on the <em>caller</em> side, and allocate extra space, and generate the stores (or loads for returns); and on the callee side, load from the pointer (or store to it).</p>\n<p>In any case, happy to look at PRs as a next step!</p>\n</blockquote>",
        "id": 291613350,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659377821
    },
    {
        "content": "<p>uweigand <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1202640694\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<p>@cfallin thanks for the comments!   After some back-and-forth, I've now come up with the following data structure changes:</p>\n<ul>\n<li>To implement the first issue (struct arguments with explicit pointer register), I'm simply adding a field to <code>ABIArg::StructArg</code>:</li>\n</ul>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"w\">        </span><span class=\"sd\">/// Register or stack slot holding a pointer to the buffer as passed</span>\n<span class=\"w\">        </span><span class=\"sd\">/// by the caller to the callee.  If None, the ABI defines the buffer</span>\n<span class=\"w\">        </span><span class=\"sd\">/// to reside at a well-known location (i.e. at `offset` below).</span>\n<span class=\"w\">        </span><span class=\"n\">pointer</span>: <span class=\"nb\">Option</span><span class=\"o\">&lt;</span><span class=\"n\">ABIArgSlot</span><span class=\"o\">&gt;</span><span class=\"p\">,</span><span class=\"w\"></span>\n</code></pre></div>\n<ul>\n<li>To implement the second issue (type legalization in the back end), I'm adding a new enum member <code>ABIArg::ImplicitArg</code>:</li>\n</ul>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"w\">    </span><span class=\"sd\">/// Implicit argument. Similar to a StructArg, except that we have the</span>\n<span class=\"w\">    </span><span class=\"sd\">/// target type, not a pointer type, at the CLIF-level. This argument is</span>\n<span class=\"w\">    </span><span class=\"sd\">/// still being passed via reference implicitly.</span>\n<span class=\"w\">    </span><span class=\"n\">ImplicitArg</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"></span>\n<span class=\"w\">        </span><span class=\"sd\">/// Register or stack slot holding a pointer to the buffer.</span>\n<span class=\"w\">        </span><span class=\"n\">pointer</span>: <span class=\"nc\">ABIArgSlot</span><span class=\"p\">,</span><span class=\"w\"></span>\n<span class=\"w\">        </span><span class=\"sd\">/// Offset of the argument buffer.</span>\n<span class=\"w\">        </span><span class=\"n\">offset</span>: <span class=\"kt\">i64</span><span class=\"p\">,</span><span class=\"w\"></span>\n<span class=\"w\">        </span><span class=\"sd\">/// Type of the implicit argument.</span>\n<span class=\"w\">        </span><span class=\"n\">ty</span>: <span class=\"nc\">Type</span><span class=\"p\">,</span><span class=\"w\"></span>\n<span class=\"w\">        </span><span class=\"sd\">/// Purpose of this arg.</span>\n<span class=\"w\">        </span><span class=\"n\">purpose</span>: <span class=\"nc\">ir</span>::<span class=\"n\">ArgumentPurpose</span><span class=\"p\">,</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"p\">},</span><span class=\"w\"></span>\n</code></pre></div>\n<p>With these, the implementation looks relatively straightforward and resides fully in <code>abi_impl</code> plus the associated ISLE and back-end code parts.</p>\n<p>I'm working on finishing up the PRs and will hopefully submit them soon.<br>\n</p>\n</blockquote>",
        "id": 291713313,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659448975
    },
    {
        "content": "<p>akirilov-arm <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1205306114\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<blockquote>\n<p>In particular, <code>x86_64</code> nearly always uses the implicit buffer address method, with the only exception of structures whose size is not a compile-time constant. Many other platforms, including <code>s390x</code>, use the the explicit buffer address method always [...] However, the current cranelift <code>abi_impl</code> _only_ supports the implicit buffer address method. This should mostly be OK for <code>x64_64</code> - I'm not sure if variable-sized structures passed by value even exist with the rustc frontend. However, even for <code>aarch64</code> I believe the current implementation is already incorrect - as far as I can see, GCC and LLVM use the explicit buffer address method on this architecture.</p>\n</blockquote>\n<p>Interesting; I must admit that I am not really familiar with the relevant ABI code paths because I haven't worked at all on the <code>cg_clif</code> integration, but it looks like there is an issue there. The standard ABI is actually a bit more <a href=\"https://github.com/ARM-software/abi-aa/blob/2022Q1/aapcs64/aapcs64.rst#parameter-passing\">nuanced</a> - structures (or <code>composite types</code>, as the specification calls them) that are 16 bytes or smaller are passed as parameters in registers and/or implicitly on the stack, and via an explicit buffer address otherwise (but I am simplifying things a bit).</p>\n<p><code>I128</code> (integral quad-word) is a fundamental data type according to the ABI and as such never uses an explicit buffer address.</p>\n<blockquote>\n<p>Finally, this legalization needs to be done not just for function arguments, but also _return values_. Here, <code>abi_impl</code> already has code to allocate a buffer in the caller and pass its address to the callee so it can place the return value there. This is exactly what we need on <code>s390x</code> for a <code>i128</code> return value - except for one implementation detail: cranelift passes that implicit pointer as _last_ argument (because this is expected by wasmtime when used for the multiple return value extension)...</p>\n</blockquote>\n<p>Return values either fit fully into registers, or go through an explicit buffer address that is kept in a register, <code>x8</code>, that normally is not used for parameters and return values; it is in fact the next register after the last one used for that purpose.</p>\n</blockquote>",
        "id": 292012239,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659621933
    },
    {
        "content": "<p>uweigand <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565#issuecomment-1205389836\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>In particular, <code>x86_64</code> nearly always uses the implicit buffer address method, with the only exception of structures whose size is not a compile-time constant. Many other platforms, including <code>s390x</code>, use the the explicit buffer address method always [...] However, the current cranelift <code>abi_impl</code> _only_ supports the implicit buffer address method. This should mostly be OK for <code>x64_64</code> - I'm not sure if variable-sized structures passed by value even exist with the rustc frontend. However, even for <code>aarch64</code> I believe the current implementation is already incorrect - as far as I can see, GCC and LLVM use the explicit buffer address method on this architecture.</p>\n</blockquote>\n<p>Interesting; I must admit that I am not really familiar with the relevant ABI code paths because I haven't worked at all on the <code>cg_clif</code> integration, but it looks like there is an issue there. The standard ABI is actually a bit more <a href=\"https://github.com/ARM-software/abi-aa/blob/2022Q1/aapcs64/aapcs64.rst#parameter-passing\">nuanced</a> - structures (or <code>composite types</code>, as the specification calls them) that are 16 bytes or smaller are passed as parameters in registers and/or implicitly on the stack, and via an explicit buffer address otherwise (but I am simplifying things a bit).</p>\n</blockquote>\n<p>Yes, it's similar on most platforms.  The decision which structs are passed in registers/stack slots and which are passed via buffer is made by the front end: the front end decides to either represent the parameter as some scalar type (if passed in registers / stack slots), or as a pointer type with the StructArgument attribute if passed in a buffer.   The back end then simply has to implement that decision.</p>\n<p>This is all unaffected by this particular issue: this issue is only about the case where the front end has already decided to use the StructArgument method.  The question raised here is whether the <em>implementation</em> of that method in the back end is actually correct, because even just this also differs between platforms.  Specifically, some platforms (notably Intel) define the address of the buffer implicitly in the ABI, so caller and callee automatically agree on it - while other platforms allow the caller to choose any address, which is then passed explicitly via register or stack slot to the callee.</p>\n<p>The question I had about AArch64 was that it is currently (in Cranelift) using the implicit method like Intel, while looking at the GCC and LLVM implementation, I see those using the explicit method.  So I suspect this is actually incorrect in Cranelift, but as I have no AArch64 hardware to verify, I didn't implement any change.</p>\n<p>Now that <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4585\">https://github.com/bytecodealliance/wasmtime/pull/4585</a> has landed, it should be straightforward to fix this in the AArch64 back end as well (if indeed something needs to be fixed).</p>\n<blockquote>\n<p><code>I128</code> (integral quad-word) is a fundamental data type according to the ABI and as such never uses an explicit buffer address.</p>\n</blockquote>\n<p>Yes, s390x is really special here, unfortunately.<br>\n</p>\n</blockquote>",
        "id": 292021087,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659625825
    },
    {
        "content": "<p>uweigand closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4565\">issue #4565</a>:</p>\n<blockquote>\n<p>In implementing support for struct-args and i128 to enable <code>rustc_codegen_cranelift</code> on s390x, I ran into two features that are not currently available with the common <code>abi_impl</code> implementation.</p>\n<hr>\n<p><strong>Struct arguments using an explicit buffer address</strong></p>\n<p>Many commonly used ABIs have special provisions for (large) struct arguments that cannot be passed in registers.  However, there are two typical flavors of these, and <code>abi_impl</code> only supports one of them.</p>\n<p>Both these flavors have in common that the actual argument is copied by the caller into a buffer on the stack; the callee will then read the argument from that buffer, and is even free to modify it.  However, the two flavors differ in how the address of that buffer is _communicated_ from the caller to the callee:</p>\n<ol>\n<li>Implicit buffer address.   With this flavor, that ABI implicitly defines the location of the buffer, usually by making the buffer part of the same area used for stack slots for overflow scalar arguments.  Both caller and callee can compute the location of the buffer at compile time simply based on the function call signature; the address is not materialized as part of the run-time call sequence.</li>\n<li>Explicit buffer address.  Here, the ABI does not define the location of the buffer itself, but leaves the compiler free to place it anywhere.  The actual location of the buffer is passed at run-time from caller to callee, typically in a register (or overflow stack slot) as if we had a pointer at this place in the function call signature.</li>\n</ol>\n<p>There are pros and cons to either approach, leading to different choices of method across platform ABIs.  In particular, <code>x86_64</code> nearly always uses the implicit buffer address method, with the only exception of structures whose size is not a compile-time constant.  Many other platforms, including <code>s390x</code>, use the the explicit buffer address method always, which allows the opportunity to the compiler to avoid actually copying the structure, e.g. if the original copy can be shown to be unused after the call so it wouldn't matter if the callee clobbers its contents.</p>\n<p>However, the current cranelift <code>abi_impl</code> _only_ supports the implicit buffer address method.   This should mostly be OK for <code>x64_64</code> - I'm not sure if variable-sized structures passed by value even exist with the rustc frontend.   However, even for <code>aarch64</code> I believe the current implementation is already incorrect - as far as I can see, GCC and LLVM use the explicit buffer address method on this architecture.    This is definitely also the case on <code>s390x</code>.</p>\n<p>This should be straightforward to fix, and I already have an implementation.   The main change is to the <code>ABIArg</code> data type, which currently holds <em>either</em> a vector of <code>ABISlot</code>s (registers or overflow stack slots) <em>or</em> a <code>StructArg</code> identifying a buffer location on the stack.  I've changed this to optionally provide <em>both</em> these items - where the semantics of providing both means that the <code>ABISlot</code> identifies the register (or overflow stack slot) needed to hold the address of the buffer at run time.</p>\n<hr>\n<p><strong>Type legalization in the back-end</strong></p>\n<p>If a function signature contains an argument of a type that cannot be directly passed in registers or overflow stack slots, but needs to use the (explicit or implicit) struct-arg buffer method,  the function signature needs to be legalized: this consists of replacing the argument of struct type by a <strong>pointer</strong> to that struct type, and adding code around function call sites as well as prologue and epilogue to convert between the two (taking the address of the struct, or dereferencing the pointer, as appropriate).</p>\n<p>Now, usually this legalization is already done by the language front-end (whether clang or rustc), and by the time the (LLVM or cranelift) IR gets to the back end, we already have a pointer type.  And in fact the current <code>abi_impl</code> assumes that exactly this is the case.</p>\n<p>But this is unfortunately not universally true.  There are a few cases whether the front end does not perform any legalization, but rather relies on the (currently LLVM) back end for that.  This is the case in particular for the <code>i128</code> data type on <code>s390x</code>.   This remains as a scalar integer type in function call signatures, but is actually _implemented_ using a hidden buffer like the struct-arg case.   With LLVM, this legalization is performed in the back-end - and to implement <code>i128</code> in cranelift, we probably need to do the same here.</p>\n<p>Interestingly enough, the <code>AbiParam</code> data type in cranelift contains a <code>legalized_to_pointer</code> flag which would appear to address exactly this situation.  However, as far as I can tell this flag is currently never set or used in all of cranelift.   It is not clear to me how this was originally intended to be used, or where exactly this legalization would have been done.</p>\n<p>I have implemented the functionality for now using yet another flavor of the <code>ABIArg</code> data type, but that seems a bit of a hack.  One problem is that when implementing the pointer dereferencing in the prologue, the <code>ABIArg</code> slots only carry type information for the pointer (usually <code>I64</code>), and possibly the size of the buffer, but not the <em>type</em> of the buffer, so it is a bit unclear which instruction to use to implement the dereferencing.</p>\n<p>Another problem is that if the buffer address is passed explicitly, but in a stack slot, we require a temporary register to load that address in order to dereference it (since the <code>into_regs</code> will hold the final <code>i128</code> value, which lives in the vector register set on <code>s390x</code>, it cannot be used as address).   It's not quite clear how to allocate a temp at this stage in the compilation process.  (I'm using the \"stack limit register\" right now, which appears to work, but I'm not sure this is guaranteed to be OK on all platforms.)</p>\n<p>Finally, this legalization needs to be done not just for function arguments, but also <em>return values</em>.   Here, <code>abi_impl</code> already has code to allocate a buffer in the caller and pass its address to the callee so it can place the return value there.  This is exactly what we need on <code>s390x</code> for a <code>i128</code> return value - except for one implementation detail: cranelift passes that implicit pointer as <em>last</em> argument (because this is expected by wasmtime when used for the multiple return value extension), while the platform ABI requires the implicit pointer as <em>first</em> argument.   To work around this, I'm now passing the return pointer first if the <code>enable_llvm_abi_extensions</code> flag is true, and last otherwise.  This seems to work with both wasmtime and rustc_codegen_cranelift, but also feels like a hack.</p>\n<hr>\n<p>@cfallin these are the problems I mentioned in our last meeting.  I'd be happy to implement a solution, but I'd appreciate some guidance / discussion on what the correct approach should be.<br>\n</p>\n</blockquote>",
        "id": 292067894,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1659645989
    }
]