[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1691955269\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>I'll offer a point in favor of option 2, with uncertain weight but maybe nonzero: not everyone uses <code>rustup</code> and can easily update their Rust compiler right away. Probably most folks do, and it's certainly the recommended way to use Rust, but the language is also packaged in distros, installed system-wide on shared machines, etc. Also platforms that are Rust tier 3 (hence have no rustup binaries) but have OS-packaged rustc and happen to work (at one point this included various BSDs, especially non-x86). Finally, some projects (e.g. Firefox back when it had an option to use Cranelift) pin on a certain Rust version, and so we're excluding ourselves from use in large software systems that may have more involved Rust upgrade procedures. (Any large company with a monorepo and carefully-packaged toolchains, for example.)</p>\n<p>Many of those probably carry lower weight than e.g. using a sorely-needed feature in a new release; but if the habit is instead to update whenever we have time, with no other particular benefits, maybe we could consider the above?</p>\n</blockquote>",
        "id": 387111653,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692892224
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1691969346\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>For a little more data: the <a href=\"https://blog.rust-lang.org/inside-rust/2022/06/21/survey-2021-report.html\">2021 Rust survey report</a> shows 7585 of 10214 responses use latest stable or nightly Rust in CI (74.2%); 8888 of 10868 responses use Rustup (81.8%). So a majority, but I'm definitely not comfortable excluding folks who don't fit into that \"happy path\", if we can help it, especially if the cases that don't are some of the more interesting ones (big software systems, etc).</p>\n</blockquote>",
        "id": 387113665,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692892757
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1692094884\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>I think personally I just want something clear and easy to follow. I've spent way too much time in my Rust career watching debates about the Rust version either end in \"ok you can only use a version of Rust that's 4 years old\" to the benefit of almost no one or a not-well-defined policy which ends up reigniting discussion every time it comes up.</p>\n<p>I changed CI to pin Rust versions awhile back to avoid breakage from Rust updates (e.g. new warnings or such), and my hope is that future updates would not be blocked on \"settle a MSRV policy\". While developing such a policy is probably inevitable and useful, the lack of community consensus on what to do here makes figuring this out quite slog in my opinion. If you'd like I'm happy to back out the change to <code>rust-version</code> in the manifest and only update CI.</p>\n</blockquote>",
        "id": 387125645,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692896511
    },
    {
        "content": "<p>elliottt <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1692150949\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>I'm generally in favor of staying up-to-date. What about adopting policy 1, and re-examining it if we get a report that it's breaking someone else's workflow?</p>\n</blockquote>",
        "id": 387132930,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692898923
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1692153700\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>Ah, sorry, I didn't mean to reignite any old discussions or scars. AFAIK this is the first time I've been involved in a \"MSRV discussion\"; hopefully I don't have as bumpy a path with them!</p>\n<p>I agree it'd be great to set down an explicit policy for Wasmtime, to avoid any ambiguity. Maybe we should discuss and decide on something in the next Wasmtime meeting? I'll put it on the agenda.</p>\n</blockquote>",
        "id": 387133483,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692899049
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1692157634\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>(My comment raced with @elliottt's; I'm fine with seeing this go through as-is, then we can discuss more at the meeting...)</p>\n</blockquote>",
        "id": 387134258,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692899234
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1692334794\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>Ok sounds good! I'm happy to sit on this until the next meeting. If someone wants to use something from 1.72 I'd be in favor of merging and enabling that, but in the meantime I think it's ok to update locally and otherwise keep CI at 1.71</p>\n</blockquote>",
        "id": 387154551,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692907536
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1701439911\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>We talked about this in the Wasmtime biweekly just now, and reached a good amount of consensus; to summarize: we agreed that it makes sense to support a sliding window of latest stable Rust versions (stable down to stable - N; N is a parameter we still need to choose). This allows flexibility to embedders of Wasmtime by not forcing an upgrade to latest stable immediately after release -- others can design release processes that work within the N-version window. It also gives some flexibility for embedders if they ned to hold a version upgrade temporarily for whatever reason (bug or miscompile elsewhere, etc).</p>\n<p>The main points to be decided are:</p>\n<ul>\n<li>What is N? (Some common choices seem to be 1, 2, 4; ideally not too much more than that?)</li>\n<li>How do we test this in CI?</li>\n</ul>\n<p>On the latter point, discussion revolved around (at least) two main constraints: CI resources are limited, so that we can't simply duplicate the test runs for all Rust versions in the window; and we also would prefer \"CI determinism\", i.e., a PR that previously passed CI should not stop passing if a new Rust version happens to be released between runs. (This is important for the contributor experience but also for e.g. ability to respond quickly without roadblocks to emergency patches and that sort of thing.)</p>\n<p>Given the determinism constraint, we'd likely define the window by pinning two versions of rust -- \"newest supported\" and \"oldest supported\" -- defining our window manually and bumping it manually. We should do these bumps regularly when new releases of Rust occur, and <em>not</em> only when we actually need a feature: otherwise, compatibility pressure builds up, dependencies acrete, and we have more problems when we do bump.</p>\n<p>Given the CI resources constraint, there seem to be two main options: run all tests at newest supported and add one additional job on Linux/x86-64 that runs at oldest supported, or vice-versa. The former catches platform-specific issues due to new Rust features sooner, but does not cover the \"tail\" of the sliding window, so N-1/N-2 Rust could break in platform-specific ways. The latter ensures the tail of the window stays working everywhere, but may catch platform-specific issues later.</p>\n<p>Does this capture everything @alexcrichton, @fitzgen, @tschneidereit, others?</p>\n<hr>\n<p>My own thoughts:</p>\n<ul>\n<li>I think <code>N = 2</code> strikes a reasonable balance; it gives a 12-week window for upgrades if someone is tracking latest Wasmtime.</li>\n<li>It seems to me that emprically, it may be better to pin most platform CI jobs to newest supported Rust, and cover the tail of the window with one Linux/x86-64 job: we've had more issues from new Rust versions (miscompiles mainly) than issues from changes to Wasmtime interacting poorly with older Rust. (Or said another way, the Rust compiler makes large changes more frequently than Wasmtime, so let's test new Rust everywhere, and new Wasmtime features/PRs only on one older Rust.) But I could see us going either way here.</li>\n</ul>\n</blockquote>",
        "id": 388372392,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1693501966
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1701449348\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>Thanks for writing that up @cfallin and that all looks accurate to me! I'd also agree with your conclusions of N=2 and \"test latest, one job msrv\" personally.</p>\n</blockquote>",
        "id": 388373576,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1693502419
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1701543231\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<p>Ok I've updated this with the various variables involved, but this is to showcase what I think enforcing the proposed MSRV policy would look like. Folks should still weigh in on the specifics if they have thoughts!</p>\n<ul>\n<li>The <code>rust-version</code> field in <code>Cargo.toml</code> is now the \"source of truth\" about our MSRV</li>\n<li>CI reads the <code>rust-version</code> field and installs rustc \"msrv+2\" by default</li>\n<li>A new msrv CI builder is added which runs the full test suite on x86_64 Linux on the MSRV</li>\n<li>Documentation is updated about our Rust policy.</li>\n</ul>\n</blockquote>",
        "id": 388382142,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1693505809
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1701580054\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<blockquote>\n<p>Thanks for writing that up @cfallin and that all looks accurate to me! I'd also agree with your conclusions of N=2 and \"test latest, one job msrv\" personally.</p>\n</blockquote>\n<p>+1 on both these things from me as well.</p>\n</blockquote>",
        "id": 388386532,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1693507548
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900#issuecomment-1701624797\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6900\">issue #6900</a>:</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>Thanks for writing that up @cfallin and that all looks accurate to me! I'd also agree with your conclusions of N=2 and \"test latest, one job msrv\" personally.</p>\n</blockquote>\n<p>+1 on both these things from me as well.</p>\n</blockquote>\n<p>And from me, thank you!</p>\n</blockquote>",
        "id": 388390888,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1693509311
    }
]