[
    {
        "content": "<p>sunfishcode <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7090#issuecomment-1741613368\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7090\">issue #7090</a>:</p>\n<blockquote>\n<p>Making input-stream use the same error type as output-stream is nice, however I'm curious why you chose to change <code>read</code> to work like <code>write</code>, instead of changing <code>write</code> to work like <code>read</code>.</p>\n<p>Read returning a <code>tuple&lt;list&lt;u8&gt;, stream-status&gt;</code> on success meant it could report a successful read with data and end-of-stream at the same time. The earlier idea was that hosts could eventually use that to save guests an extra trip through <code>poll_list</code> and <code>read</code> just to find out that the stream is closed. It's admittedly not urgent that we do that optimization right now, but unless there's a reason not to, it seems worth keeping the option in the interface.<br>\n</p>\n</blockquote>",
        "id": 394027678,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696036037
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7090#issuecomment-1743357430\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7090\">issue #7090</a>:</p>\n<blockquote>\n<p>My take on it was, its a very rare corner case that we can indicate the end of stream has been reached while still returning some input, whereas it makes the interface more difficult to understand, use, and implement. As we went through and changed the implementation and tests to this new interface, both \"felt\" more appropriate. It is subjective, and initially I did it the other way because that seemed like an advantage, but now that I've done it both ways I prefer this.</p>\n</blockquote>",
        "id": 394473291,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696264923
    }
]