[
    {
        "content": "<p>cfallin opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060\">issue #9060</a>:</p>\n<blockquote>\n<p>As part of the discussion on #9015 / #9026, we discussed handling of VM data structures -- the vmctx struct, tables, function references, and the like -- that are touched both by runtime code (in Rust) and by generated code compiled from the Wasm. There are issues related to strict pointer provenance because pointers to these data structures are exposed to the generated code, and/or the Pulley interpreter, without strict provenance (either through the Pulley bytecode, or through the machine code we invoke that is entirely outside of the domain of Rust's semantics).</p>\n<p>It occurs to me that one way to solve this would be to make all VM data structures use <em>relative</em> pointers -- e.g., <code>u32</code> offsets -- in an arena (per store? per engine?) whose base pointer is a parameter both to the generated code and to the Pulley interpreter. We then trivially have strict provenance because there is <em>only one pointer</em> -- and whatever we need to do to preserve provenance (keep it as a pointer in the Pulley interpreter loop; and \"expose\" it as we pass it to generated code) is localized and manageable.</p>\n<p>If provenance were the only benefit, that may not be so interesting; but there are a few others as well:</p>\n<ul>\n<li>\n<p>Security: maintaining more discipline around raw pointers, and carefully dereferencing offsets into an arena instead (for which we can reserve guard regions just as we do heaps today), is a layer of mitigation/defense-in-depth against engine bugs. For example, if a miscompile or a bug in the generated CLIF caused a pointer-type confusion in VM data structures today, one could plausibly find a memory-read gadget or control-flow escape more easily. We will still have some raw pointers -- the actual code pointer that we invoke in funcrefs, or the memory base address in an imported or owned memory descriptor -- but fewer of them is less exposure.</p>\n<p>This angle is not new: WebKit has the <a href=\"https://phakeobj.netlify.app/posts/gigacage/\">Gigacage</a>, I believe V8 has something similar, and I had suggested we build (and now we are building) our Wasm GC implementation in the same way with relative-offset-pointers; so it's a proven mitigation and the overhead seems to be minimal.</p>\n<p>Note also that relative-pointer loads/stores can be implemented with fully safe code in the Pulley interpreter. We almost certainly still need unsafe code still for the Wasm heap dereferences and such (though, then again, maybe there's a way around that by either externalizing a table of alternative raw pointer bases, or putting memories in a large gigacage -- teracage? exacage? -- as well).</p>\n</li>\n<li>\n<p>Performance: 32-bit relative-offset pointers are half the size of 64-bit raw machine pointers on 64-bit platforms; this is the basis for the performance gain seen with <a href=\"https://wiki.openjdk.org/display/HotSpot/CompressedOops\">compressed oops (object pointers)</a> in OpenJDK, and also with wasm32 vs. native 64-bit code in some pointer-heavy benchmarks. It's plausible that a 2x shrink on the size of large function tables (for example) might result in slightly better cache residency and performance. Then again carrying the base pointer and adding it has a slight cost (single-digit percentage by analogy to studies on Wasm heap strategies); so maybe overall neutral.</p>\n</li>\n<li>\n<p>There may be some other interesting side-effects: for example, if we fully relativize the core Wasm VM data structures, and externalize the \"raw pointers\" to a table as noted above, it would mean we could snapshot the entire VM state (at the VM level, not the Wasm level).</p>\n</li>\n</ul>\n<p>So it seems we can get (i) fully strict provenance, (ii) better safety, (iii) other interesting new abstractions like whole-engine snapshotting, if we pay this cost. Something to consider later if any of these needs becomes interesting?</p>\n</blockquote>",
        "id": 455739762,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1722540937
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060#issuecomment-2265889905\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060\">issue #9060</a>:</p>\n<blockquote>\n<p>How would this be reflected in CLIF? All loads/stores would have to be derived from a small set of \"base pointers\" such as the base of each linear memory in a module and the arena holding vmctx/tables/etc. For example Pulley might have a load-from-memory-zero instruction or load-from-arena instruction, but how would it know which to choose from a CLIF <code>load</code>?</p>\n<p>(and possibly another area for \"stack memory of this function\", so how to detect loads/stores to the stack)</p>\n</blockquote>",
        "id": 456002329,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1722621777
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060#issuecomment-2265906293\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060\">issue #9060</a>:</p>\n<blockquote>\n<p>There are at least two ways I think:</p>\n<ul>\n<li>Option 1: CLIF, with some mode, has a base pointer for <em>every</em> load and store. (This is the \"tera-cage\" idea above where memories are also within this overall area.) We could specify the base pointer as a special argument in the same way we do for vmctx today. The semantics are then that loads and stores logically access <code>base[ptr]</code> rather than <code>*ptr</code>; from a provenance point of view it's one big array.</li>\n<li>Option 2:  \"externalized table of base pointers\" described above. We represent this structure <em>somehow</em> in CLIF (special arg for base of table, size statically specified in CLIF? not sure) then have effectively \"address space IDs\" on loads/stores, so accesses are to <code>table[aspace_id][ptr]</code>.</li>\n</ul>\n<p>I kind of like the first more -- it's less intrusive to Cranelift (in a way that avoids complexity-footguns around e.g. alias analysis with separate address spaces) at the cost of a little more constraint on memory layout (but then we're already saying we're going to put everything in some arena).</p>\n</blockquote>",
        "id": 456005587,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1722622454
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060#issuecomment-2265915769\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060\">issue #9060</a>:</p>\n<blockquote>\n<p>(For clarity on Option 1: the base pointer is implicit and affects all loads/stores; we wouldn't add an extra argument.)</p>\n</blockquote>",
        "id": 456006949,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1722622870
    },
    {
        "content": "<p>cfallin edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060#issuecomment-2265915769\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9060\">issue #9060</a>:</p>\n<blockquote>\n<p>(For clarity on Option 1: the base pointer is implicit and affects all loads/stores; we wouldn't add an extra argument to load/store instructions.)</p>\n</blockquote>",
        "id": 456007047,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1722622898
    }
]