[
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821#issuecomment-1673485138\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821\">issue #6821</a>:</p>\n<blockquote>\n<p>One part of this is that it defines a hierarchy of types and then provides conversion of WIT and WITX-generated types into this hierarchy of types. That's reasonable for this crate since the set of types is quite small, but for something like <code>wasi-common</code> I'm not sure if that would work well (or larger proposals). In that sense it might make more sense to unconditionally generate WIT bindings (e.g. not a compile time feature) and always use the WIT types generated? That way there'd only be one conversion necessary which is WITX-to-WIT.</p>\n<p>Also one thing to consider is that this has <code>impl WasiNnTrait for WasiNnCtx</code> which means that it's not going to be easily usable from embedders. Currently with <code>bindgen!</code> we're using something that looks like <code>impl&lt;T&gt; WasiNnTrait for T where T: WasiNnView</code> so that way if <code>WasiNnCtx</code> is embedded in a store somewhere the <code>WasiNnView</code> defines how to access it.</p>\n<p>Also as a final thing, it looks like the implementation bodies of WIT and WITX are duplicated? Would it be possible for one to delegate to the other?</p>\n</blockquote>",
        "id": 383676443,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691682550
    },
    {
        "content": "<p>abrown <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821#issuecomment-1674015600\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821\">issue #6821</a>:</p>\n<blockquote>\n<blockquote>\n<p>In that sense it might make more sense to unconditionally generate WIT bindings (e.g. not a compile time feature) and always use the WIT types generated</p>\n</blockquote>\n<p>Yeah, I would prefer that. Is it fine if <code>wasmtime-wasi-nn</code> enables the <code>component-model</code> feature, though, forcing every user of this (e.g., the CLI) to do so too?</p>\n<blockquote>\n<p><code>impl&lt;T&gt; WasiNnTrait for T where T: WasiNnView</code></p>\n</blockquote>\n<p>I saw this over in <code>wasi</code> or <code>wasi-common</code> and didn't really \"get\" it. Let me look into it a bit more.</p>\n<blockquote>\n<p>Also as a final thing, it looks like the implementation bodies of WIT and WITX are duplicated? Would it be possible for one to delegate to the other?</p>\n</blockquote>\n<p>They are duplicated in essence but not all the details are the same; e.g., anywhere we need a slice in <code>witx.rs</code> we do the Wiggle <code>GuestSlice</code> dance. I'll look into this a bit more...</p>\n</blockquote>",
        "id": 383774121,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691707170
    },
    {
        "content": "<p>abrown <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821#issuecomment-1674028318\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6821\">issue #6821</a>:</p>\n<blockquote>\n<p>@alexcrichton: one more thought about your comments is that perhaps some of these improvements could be done as a separate PR. There is clearly more work that needs to be done here (e.g., replace all these temporary WIT files with their upstream versions, implement named models, etc.) so perhaps some of the refactorings you suggest could fit into some of those PRs.</p>\n</blockquote>",
        "id": 383776153,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691708299
    }
]