[
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5004#issuecomment-1267379068\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5004\">issue #5004</a>:</p>\n<blockquote>\n<p>@pepyakin , thanks for this change. However, I'm not sure that we want to take it as-is; or at least, I'd like to see more data.</p>\n<p>The Sightglass runs you provide are all over the place -- in some cases this is better by 5-10%, in other cases <code>main</code> is better by 5-10%. There doesn't appear to be a clear trend to me.</p>\n<p>What's more concerning, the <code>instantiation</code> times have wild swings as well, but this shouldn't have been affected at all by this change. This makes me concerned about the reliability of the measurement setup and confidence-interval computation.</p>\n<p>Would you be willing to take a few of the larger benchmarks (<code>spidermonkey</code> and <code>bz2</code>, say) and run them by precompiling to <code>.cwasm</code>s then measuring time with your tool of choice (I like <code>hyperfine</code>) for a <code>wasmtime run ...</code> command? I'm curious how much variance this sees and what trends we'll get.</p>\n<p>I share @bjorn3's concern about code size here as well. Aligning <em>every</em> loop to a 64-byte granularity is likely to bloat some cases nontrivially. Could you report the effect on code-size (the <code>.text</code> segment of the <code>.cwasm</code>s) for benchmarks as well?</p>\n</blockquote>",
        "id": 302320090,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1664907436
    },
    {
        "content": "<p>pepyakin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5004#issuecomment-1274823122\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/5004\">issue #5004</a>:</p>\n<blockquote>\n<p>That's a good catch. I must admit that I did not notice that it was about instantiation! Probably something was running on my test machine and ruined the measurement. I also agree with the points made by @bjorn3. In retrospect, that seems obvious <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span> </p>\n<p>I had an impression that this PR would be a quick one, but it seems I was wrong = ) I will try to further it, but that won't be my primary focus, so it will likely take some time[^1].</p>\n<p>[^1]: Should anyone feel the acute need/or just want to take over for other reasons, feel free to take it on.</p>\n</blockquote>",
        "id": 303454914,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1665499756
    }
]