[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a> from <code>alexcrichton:lift-lower-types</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>This commit is a large refactor to the component runtime of Wasmtime to shepherd along type information when lifting and lowering values. Previously lifting and lowering would assume type information given context such as \"surely lowering a <code>u32</code> must lower into the type <code>InterfaceType::U32</code>\" or \"lowering a <code>Val</code> works as it knows its own type\". This is still true, and this commit isn't changing these features. The rationale for this commit instead stems from the upcoming implementation of resources in Wasmtime.</p>\n<p>Resources are trickier than all existing types in Wasmtime because what exactly is the type of a resource depends on who you're asking. For example the host might have one type called <code>http::Headers</code> but a component could import it as two distinct types:</p>\n<div class=\"codehilite\"><pre><span></span><code>(component\n  (import &quot;headers1&quot; (type $h1 (sub resource)))\n  (import &quot;headers2&quot; (type $h2 (sub resource)))\n\n  ;; ...\n)\n</code></pre></div>\n\n<p>in the above component the <code>$h1</code> and <code>$h2</code> types will each get their own table at runtime for managing their state. This means that if the host instantiates the component with <code>http::Headers</code> supplied as both types then the same type on the outside maps to two different types inside. This means that the lowering of a host-defined type into the component is now dependent on the \"name\" that the component has for the type, basically if the function used <code>$h1</code> or <code>$h2</code>. This overall means that the type that the component assigned for a function is significant as part of lifting and lowering. Hence the rationale for this commit, threading around this type information.</p>\n<p>The major change in this commit is updates to the <code>Lift</code> and <code>Lower</code> traits. Previously they took a mishmash of parameters and now they needed to take more parameters, so I've updated them with:</p>\n<ul>\n<li>\n<p><code>Lift</code> operations take a <code>&amp;LiftContext&lt;'_&gt;</code> and an <code>InterfaceType</code> as contextual information. The context stores the store, the options, and type information. The <code>InterfaceType</code> is the type that's being lifted, which would indicate which resource table to load from for example.</p>\n</li>\n<li>\n<p><code>Lower</code> operations now take a <code>&amp;mut LowerContext&lt;'_, T&gt;</code> and an <code>InterfaceType</code>. The <code>LowerContext</code> is similar to its lift cousin where it stores the store, options, and type information.</p>\n</li>\n</ul>\n<p>The different context passed in to <code>lift</code> and <code>load</code>, for example, is no longer distinguished and both simply take a <code>&amp;LiftContext&lt;'_&gt;</code> which simplifies things a bit.</p>\n<p>This refactoring was pretty far reaching and touches quite a bit of the component model implementation. This is because basically everything deals with type information as types can be recursively nested in one another. I've taken the liberty to make code continue to be ergonomic/understandable where appropriate so some \"shapes\" of code are now different to continue to accommodate readability and maintainability.</p>\n<p>Finally it's worth noting that this should not have any actual function impact on components running today (or tomorrow). User-facing APIs haven't changed at all here and it's just the guts that are refactored. One unfortunate aspect, though, is that this is going to be a small perf hit on lifting/lowering due to the fact that type information essentially needs to be \"iterated\" over during the lifting/lowering process. This iteration involves index lookups in <code>&amp;ComponentTypes</code> along with assertions that when you lower <code>Vec&lt;T&gt;</code> that the type is <code>InterfaceType::List(i)</code>. These assertions should always succeed, and in theory could become some sort of <code>unreachable_unchecked</code> in the future, but for now it's all left as safe checks/panics for us to optimize at a later date if necessary.</p>\n<p>&lt;!--<br>\nPlease make sure you include the following information:</p>\n<ul>\n<li>\n<p>If this work has been discussed elsewhere, please include a link to that<br>\n  conversation. If it was discussed in an issue, just mention \"issue #...\".</p>\n</li>\n<li>\n<p>Explain why this change is needed. If the details are in an issue already,<br>\n  this can be brief.</p>\n</li>\n</ul>\n<p>Our development process is documented in the Wasmtime book:<br>\n<a href=\"https://docs.wasmtime.dev/contributing-development-process.html\">https://docs.wasmtime.dev/contributing-development-process.html</a></p>\n<p>Please ensure all communication follows the code of conduct:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md\">https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md</a><br>\n--&gt;</p>\n</blockquote>",
        "id": 370588327,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687990825
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a>.</p>",
        "id": 370588328,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687990826
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/fitzgen\">fitzgen</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a>.</p>",
        "id": 370588329,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687990826
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a>.</p>",
        "id": 370590059,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687991580
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a>.</p>",
        "id": 370591979,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1687992471
    },
    {
        "content": "<p>fitzgen submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667#pullrequestreview-1505615803\">PR review</a>:</p>\n<blockquote>\n<p>I like it!</p>\n</blockquote>",
        "id": 370833347,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1688053607
    },
    {
        "content": "<p>fitzgen merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6667\">PR #6667</a>.</p>",
        "id": 370847782,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1688056176
    }
]