[
    {
        "content": "<p>cfallin opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4093\">PR #4093</a> from <code>isle-prio-bug</code> to <code>main</code>:</p>\n<blockquote>\n<p>This PR fixes a bug in the ISLE compiler related to rule priorities.</p>\n<p>An important note first: the bug did not affect the correctness of the Cranelift backends, either in theory (because the rules should be correct applied in any order, even contrary to the stated priorities) or in practice (because the generated code actually does not change at all with the DSL compiler fix, only with a separate minimized bug example).</p>\n<p>The issue was a simple swap of <code>min</code> for <code>max</code> (see first commit). This is the minimal fix, I think, to get a correct priority-trie with the minimized bug example in the last commit.</p>\n<p>However, while debugging this, I started to convince myself that the complexity of merging multiple priority ranges using the sort of hybrid interval tree / string-matching trie data structure was unneeded. The original design was built with the assumption we might have a bunch of different priority levels, and would need the efficiency of merging where possible. But in practice we haven't used priorities this way: the vast majority of lowering rules exist at the default (priority 0), and just a few overrides are explicitly at prio 1, 2 or (rarely) 3.</p>\n<p>So, it turns out to be a lot simpler to label trie edges with (prio, symbol) rather than (prio-range, symbol), and delete the whole mess of interval-splitting logic on insertion. It's easier (IMHO) to convince oneself that the resulting insertion algorithm is correct.</p>\n<p>I was worried that this might impact the size of the generated Rust code or its runtime, but In fact, to my initial surprise (but it makes sense given the above \"rarely used\" factor), the generated code with this compiler fix is <em>exactly the same</em>. I rebuilt with <code>--features rebuild-isle,all-arch</code> but... there were no diffs to commit! This is to me the simplest evidence that we didn't really need that complexity.</p>\n<p>The first commit here makes the minimal fix to the complex algorithm, to show the initial bug for completeness; the second commit deletes the whole mess (and the simpler ISLE compiler generates the same result); and the third commit adds the minimal reproducer that I got from the <code>Amode</code> code that exposed this bug.</p>\n</blockquote>",
        "id": 280971210,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651558089
    },
    {
        "content": "<p><strong>cfallin</strong> requested <a href=\"https://github.com/abrown\">abrown</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4093\">PR #4093</a>.</p>",
        "id": 280971211,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651558089
    },
    {
        "content": "<p><strong>cfallin</strong> requested <a href=\"https://github.com/fitzgen\">fitzgen</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4093\">PR #4093</a>.</p>",
        "id": 280971212,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651558089
    },
    {
        "content": "<p>fitzgen submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4093#pullrequestreview-960611726\">PR review</a>.</p>",
        "id": 281035540,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651593708
    },
    {
        "content": "<p>cfallin merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4093\">PR #4093</a>.</p>",
        "id": 281037762,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1651594605
    }
]