[
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6141#issuecomment-1496396568\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6141\">issue #6141</a>:</p>\n<blockquote>\n<p>I like this commit. (Note for other reviewers, this PR is based on #6140 so at the moment only <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6141/commits/8d4cf54be4460c3a11e6c078b449c1665326c365\">ISLE: simplify select/bitself when both choices are the same</a> is necessary to review here.)</p>\n<p>I'd like to double-check with @cfallin that these new rules are correct, but I think they are. I don't think there's any subtlety to <code>select</code> or <code>bitselect</code> that would make this optimization invalid.</p>\n<p>I think this particular optimization might even be legal for <code>select_spectre_guard</code>, although that definitely has subtlety and also I wouldn't expect such a rule to ever fire.</p>\n<p>There's a typo in the commit message and PR description (\"bitself\"→\"bitselect\") but once #6140 lands and this PR is rebased, I think this is a fine change.</p>\n</blockquote>",
        "id": 346936139,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1680631974
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6141#issuecomment-1496407896\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6141\">issue #6141</a>:</p>\n<blockquote>\n<p>Yep, this looks right to me -- no hidden subtleties!</p>\n<p>I agree that the Spectre-guard variant would also be eligible (and would not lose any speculative safety), but I'm hesitant for us to do that, at least for now; IMHO a better approach for optimizations that touch <code>select_spectre_guard</code> is probably to (i) make changes that affect it only in concert with updates or optimizations to bounds-checking as a whole (i.e., when looking at generated code and improving it), when we're explicitly thinking about these issues; and (ii) do it in a separate PR, with a detailed argument around its speculative safety, probably also adding documentation on the topic.</p>\n</blockquote>",
        "id": 346938046,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1680632524
    }
]