[
    {
        "content": "<p>github-actions[bot] <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121#issuecomment-1742211580\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121\">issue #7121</a>:</p>\n<blockquote>\n<h4>Subscribe to Label Action</h4>\n<p>cc @cfallin, @fitzgen</p>\n<p>&lt;details&gt;<br>\nThis issue or pull request has been labeled: \"cranelift\", \"isle\"</p>\n<p>Thus the following users have been cc'd because of the following labels:</p>\n<ul>\n<li>cfallin: isle</li>\n<li>fitzgen: isle</li>\n</ul>\n<p>To subscribe or unsubscribe from this label, edit the &lt;code&gt;.github/subscribe-to-label.json&lt;/code&gt; configuration file.</p>\n<p><a href=\"https://github.com/bytecodealliance/subscribe-to-label-action\">Learn more.</a><br>\n&lt;/details&gt;</p>\n</blockquote>",
        "id": 394266282,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696196681
    },
    {
        "content": "<p>afonso360 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121#issuecomment-1742843388\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121\">issue #7121</a>:</p>\n<blockquote>\n<p>It looks like the <a href=\"https://github.com/bytecodealliance/wasmtime/actions/runs/6379369760/job/17311713213#step:5:60\">OpenVINO installer may have an outdated package checksum</a>. cc: @abrown </p>\n</blockquote>",
        "id": 394400715,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696246023
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121#issuecomment-1743172795\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121\">issue #7121</a>:</p>\n<blockquote>\n<p>Oh nice, I had totally missed those! Please feel free to do follow-ups, I was going to work on icmp next myself and it seems like you've got a good handle on what needs to fit in here.</p>\n<p>This is interesting though because I'm taking inspiration from the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/270e92225da3acb5b0a583546b2d4598cb59ae2a/cranelift/codegen/src/isa/x64/inst.isle#L2220-L2233\">x64 backend for this PR</a> where it pattern-matches a <code>Value</code> to skip an extension.</p>\n<p>One point also possibly worth mentioning is that we may not, at this time, be able to put most of the logic here in <code>uextend</code> and <code>sextend</code> because extension is requested by many other instructions due to how the architecture works - this is why I wanted to refactor like this because now the backend can request extension outside of those CLIF instructions via <code>sext</code> and <code>zext</code>. That being said it's still a bit weird I think. At least the way it works on x64 is that during an extension operation no instructions are emitted for the operation being extended (e.g. an <code>addw</code> equivalent) but instead the choice to omit an extension instruction is made. This implicitly couples the lowering of 32-bit add plus a sign extension for example. This is not great because if the lowering for a 32-bit add changes then it may not be acompanied with an update to the optimization of skipping the sign extension. This has led to some possible optimizations being omitted in the x64 backend for example because the logic is too complicated to ensure they're in sync on \"both halves\". Basically I think this would be an interesting problem to solve, but as you've pointed out the <code>*w</code> instructions are simple enough to RISC-V it may be good enough to simply have all the lowerings in <code>sext</code> and <code>zext</code> and I think that should work out?</p>\n<p>That would at least work out really well to avoid the problem of having two locations to keep in sync and instead only one has to be looked at. </p>\n</blockquote>",
        "id": 394453155,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696258471
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121#issuecomment-1743179458\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121\">issue #7121</a>:</p>\n<blockquote>\n<p>Alternatively I've also been musing lately due to all this if we should perhaps support target-specific rewrites of CLIF. One way to solve some of these issue is to simply remove lowerings that the backend doesn't support. For example RISC-V 64-bit doesn't support 32-bit comparisons (AFAIK at least) so a target-specific rewrite could change all comparisons to being 64-bit comparisons. Other misc examples include how there's no u8-to-f32 instruction on RISC-V so we're required to sign-extend to u32 and then convert. Doing at this at the CLIF layer would be quite nice since it could even benefit from egraph-based optimizations.</p>\n</blockquote>",
        "id": 394453934,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696258697
    },
    {
        "content": "<p>afonso360 <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121#issuecomment-1743606142\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7121\">issue #7121</a>:</p>\n<blockquote>\n<p>I've had some thoughts about doing something similar but for a slightly different purpose. We have a lot of the unimplemented ops for <code>i128</code> in the various backends and building more complete support is a lot of work. Additionally most of them are fairly similar (<code>idiv.i128</code> is pretty much always going to be a libcall), so we could have the backend request expanded versions of the ops that they would know how to lower.</p>\n</blockquote>",
        "id": 394497168,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696273812
    }
]