[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629\">PR #7629</a> from <code>alexcrichton:fix-wait-notify</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>This commit rewrites and refactors the <code>ParkingSpot</code> implementation in Wasmtime. This is motivated by #7623 primarily which is something I haven't been able to reproduce but it doesn't look like a spurious issue. Additionally in reviewing the previous implementation I'm not sure if it was technically spec-compliant.</p>\n<p>Previously each parking spot was modeled with a single condition variable. All threads blocking on the same address would block on the same condition variable. When waking up N threads the condition variable would either use <code>notify_all</code> or <code>notify_one</code> N times. The part I wasn't so sure about is that each thread, when waking up, would \"consume\" a wakeup notification on the way out, going back to sleep if a notification wasn't available. This was intended to handle spurious wakeups from the OS condition variable in use. This could mean, however, that a spurious wakeup of one thread could consume a notification from another thread. This was documented already as a possibility and \"probably ok\" but my gut is that this behavior led to #7623, although I haven't been able to construct a trace that would lead the test here to deadlock.</p>\n<p>Out of caution, however, this commit rewrites the implementation to be similar to what V8 and SpiderMonkey are doing. Both of those implementations are using a linked list of waiters for threads that are blocked and then notifying N threads dequeues N threads to wake them up. This makes the semantics of knowing which thread is waken up easier to understand from an implementation point of view since each wakeup notification deterministically goes to a specified thread. The tricky part about this implementation is that a doubly-linked-list needs to be maintained within <code>ParkingSpot</code> to handle this.</p>\n<p>While I was here I additionally refactored the interface of <code>ParkingSpot</code> to more closely match the raw interface of WebAssembly. This is intended to scope the problem being solved more narrowly to what wasm needs rather than trying to solve a more general problem at the same time.</p>\n<p>Closes #7623</p>\n<p>&lt;!--<br>\nPlease make sure you include the following information:</p>\n<ul>\n<li>\n<p>If this work has been discussed elsewhere, please include a link to that<br>\n  conversation. If it was discussed in an issue, just mention \"issue #...\".</p>\n</li>\n<li>\n<p>Explain why this change is needed. If the details are in an issue already,<br>\n  this can be brief.</p>\n</li>\n</ul>\n<p>Our development process is documented in the Wasmtime book:<br>\n<a href=\"https://docs.wasmtime.dev/contributing-development-process.html\">https://docs.wasmtime.dev/contributing-development-process.html</a></p>\n<p>Please ensure all communication follows the code of conduct:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md\">https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md</a><br>\n--&gt;</p>\n</blockquote>",
        "id": 405883613,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701712724
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/pchickey\">pchickey</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629\">PR #7629</a>.</p>",
        "id": 405883614,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701712724
    },
    {
        "content": "<p><strong>alexcrichton</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629\">PR #7629</a>.</p>",
        "id": 405883615,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701712724
    },
    {
        "content": "<p>alexcrichton updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629\">PR #7629</a>.</p>",
        "id": 405888986,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701714743
    },
    {
        "content": "<p>pchickey submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629#pullrequestreview-1763724761\">PR review</a>.</p>",
        "id": 405944022,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701737894
    },
    {
        "content": "<p>alexcrichton merged <a href=\"https://github.com/bytecodealliance/wasmtime/pull/7629\">PR #7629</a>.</p>",
        "id": 406107006,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1701796025
    }
]