[
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1670419682\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>Waiting to merge until @elliottt and I add a test to show that waiting for join_background_tasks flushes all output.</p>\n</blockquote>",
        "id": 383095999,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691535250
    },
    {
        "content": "<p>pchickey edited a <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1670419682\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>Waiting to merge until </p>\n<ul>\n<li>@elliottt and I add a test to show that waiting for join_background_tasks flushes all output.</li>\n<li>all uses of wasi in tests and examples use this new method to wait for output to flush, so that when people copy paste existing code they dont miss this important detail</li>\n</ul>\n</blockquote>",
        "id": 383096264,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691535412
    },
    {
        "content": "<p>rylev <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1670778947\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>I don't see a discussion of the alternative approach where background tasks are daemonized by default but there is a method that returns a future which completes when all background tasks are done or cancels the background tasks on <code>Drop</code>. This would allow for opting into cancelation (say after a timeout) rather than opting out of cancelation (which is easy to forget to do). </p>\n<p>Such an approach seems like the ideal approach since it doesn't risk I/O operations not flushing and easily allows users to opt into ensuring that resources are not leaked. If this is really just a question of which default is better (best effort of I/O flushing vs protecting against potential resource leaks), I would personally pick I/O flushing. The approach in this PR seems like it will be a footgun that a lot of users will run into even if the docs are all updated to mention it. </p>\n</blockquote>",
        "id": 383167547,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691564375
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1671928894\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>Oh that's discussed a bit in @pchickey's points above, but I can to help clarify some more. I do realize though that yesterday in our sync we ended up concluding daemonize-by-default was the right option, and both @pchickey and I feel the same way but the code ended up not working out too well. One of the main problems with that is that for embeddings where cancel-by-default is desired then that option needs to be active for the entire lifetime of <code>WasiCtx</code> since cancellation may not only happen at the end when tasks are being joined but also at any time during the execution of a guest. This means that the option of daemonize-or-cancel on drop is an up-front configuration option rather than a when-you-make-the-join-future option.</p>\n<p>One idea would be to make this an option on <code>WasiCtxBuilder</code> but that required a degree of configuration plumbing which we basically weren't quite ready for. (not that it's impossible I think though). One part about daemonize-by-default though is that I'm not sure how that would work in the sync case because it's not clear to me when the Wasmtime CLI, for example, would perform the \"wait\" for background tasks to finish before the CLI exits the process.</p>\n<p>Given all that the conclusion we reached was to go the opposite way and cancel-on-drop rather than daemonize and require these methods to be invoked to ensure output reaches its destination. I don't disagree it's a footgun though but I think that fixing that may need to happen at a different level rather than daemonize-or-cancel perhaps. One example there was what I mentioned yesterday where <code>blocking-write</code> does something different than what it does today, but as we talked about it's not clear what this would be exactly and whether it would actually work.</p>\n</blockquote>",
        "id": 383383988,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691605609
    },
    {
        "content": "<p>rylev <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1673184201\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>That's fine. I do think it would go a long way to make blocking writes only return once wasmtime has handed them off to the underlying host kernel. </p>\n<p>I believe we discussed the possibility of adding a call to <code>ready</code> before <a href=\"https://github.com/bytecodealliance/wasmtime/blob/e6cc402b1be2e7143852ee37a29c215817636748/crates/wasi/src/preview2/preview2/io.rs#L123\">this line</a> to ensure we don't exit <code>blocking_write</code> until we're sure that the previous write has gone all the way through. Would that be possible?</p>\n</blockquote>",
        "id": 383618514,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691672764
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1673948593\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>@pchickey I think there's <a href=\"https://github.com/bytecodealliance/wasmtime/blob/01eb51a800aeb81a25cc49cbbb0a1c813c28acdb/crates/wasi/src/preview2/pipe.rs#L233-L235\">one more block to handle</a> as well (same as input streams)</p>\n</blockquote>",
        "id": 383763209,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691703190
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1673962416\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<blockquote>\n<p>I believe we discussed the possibility of adding a call to ready before <a href=\"https://github.com/bytecodealliance/wasmtime/blob/e6cc402b1be2e7143852ee37a29c215817636748/crates/wasi/src/preview2/preview2/io.rs#L123\">this line</a> to ensure we don't exit blocking_write until we're sure that the previous write has gone all the way through. Would that be possible?</p>\n</blockquote>\n<p>That would make blocking write into blocking write + flush, but only work for the one implementation today where ready also means flush. I don't think we want to make every blocking write include a flush, since the flush could hang if the other end of the pipe stops listening, and I also don't want to make ready mean flush on all writers, which limits the flexibility for future implementations.</p>\n</blockquote>",
        "id": 383765172,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691704077
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1674061453\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>My <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1673948593\">previous comment</a> was incorrect as that's related to input streams, not output streams, which is what this cares about.</p>\n<p>I've additionally pushed up some more commits after some more discussion with @pchickey. The thinking is that it's pretty likely at this point for WASI to gain a \"flush\" on <code>output-stream</code> so we may as well start heading in that direction. Furthermore in local testing I found that the <code>join_background_tasks</code> as-is before my commits wasn't actually sufficient, we needed to literally call <code>.flush()</code> on the output stream before returning from <code>join_background_tasks</code> anyway.</p>\n<p>So I've updated <code>HostOutputStream</code> to have a <code>flush()</code> method and updated it for the <code>AsyncWriteStream</code> adapter. Additionally I've removed <code>join_background_tasks</code> from <code>HostInputStream</code> and renamed the <code>WasiCtx</code> method to <code>flush_output</code>. This way it's now clear that the final operation to do is to flush all output.</p>\n<p>The thinking afterwards, to solve your concern @rylev, is that WASI will gain <code>flush</code> as an inherent method on all output streams. That'll get wired up to the <code>flush</code> I just wrote, and additionally libraries like <code>wasi-libc</code> would be updated to flush at appropriate points. Furthermore the preview1-to-preview2 adapter will probably flush after all writes to stdout since preview1 has no notion of \"flushing\", which would doubly fix the issue you're seeing @rylev </p>\n</blockquote>",
        "id": 383781633,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1691711324
    },
    {
        "content": "<p>pchickey <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823#issuecomment-1683144102\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6823\">issue #6823</a>:</p>\n<blockquote>\n<p>I know that various bca people are on the same page but for onlookers: this is just too sticky of an issue to hack on a fix in the host like this, and we identified other issues with output-stream, so we are going to redesign the way output-stream does backpressure to make this no longer be a problem.</p>\n</blockquote>",
        "id": 385772871,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1692317704
    }
]