[
    {
        "content": "<p>saulecabrera opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178\">issue #5178</a>:</p>\n<blockquote>\n<p>As part of <a href=\"https://github.com/bytecodealliance/rfcs/pull/28\">https://github.com/bytecodealliance/rfcs/pull/28</a> I'm working on factoring out ISLE definitions from <code>cranelift-codegen</code> and moving them to <code>cranelift-asm</code>; concretely, the enum representing each ISA's machine instruction. </p>\n<p>Currently each <code>inst.isle</code>, contains other helpers that use the enum definition, which semantically belong in <code>cranelift-codegen</code> and that ideally shouldn't be moved into <code>cranelift-asm</code>. This poses an interesting question regarding having ISLE dependencies between crates and what's the best way to go about it. </p>\n<p>I had a chat with @cfallin, in which we discussed a couple of possibilities:</p>\n<p><strong>Declaring each <code>MInst</code> as <code>extern</code></strong></p>\n<p>This would require (i) changing the <code>MInst</code> definition in <code>inst.isle</code> in <code>cranelift-codegen</code> to be <code>extern</code> (ii) moving each <code>MInst</code> definition to <code>cranelift-asm</code> and (iii) making the Rust types from the generated code in <code>cranelift-asm</code> available to the environment of the isle-generated code in <code>cranelift-codegen</code>. Similar to what exists for all the the other <code>extern</code> enums. In terms of disadvantages/concerns: whenever there's a change to the <code>MInst</code> enum in <code>cranelift-asm</code> the extern definition in <code>cranelift-codegen</code> needs to be updated too,  which is kind of expected when seeing this from the angle of a dependency upgrade (i.e. sometimes changes are required in the consumer side), but in the end, we are keeping a verbatim copy of the definition and I wonder is this is going to introduce too much complexity when working with these definitions (there might be other disadvantages that I'm not clearly seeing too!).</p>\n<p><strong>Having a single definition, serving both (or multiple) crates</strong></p>\n<p>This idea is half-baked. But in general it would require moving the common ISLE pieces to a central location and copying them at build time to perform code generation. This approach has the potential to solve the definition duplication issue, but the question of how to concretely express dependencies between ISLE definitions remains open: for example, the structure of this new central location could be something like:</p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>- inst.isle\n- inst_enum.isle // MInst definition\n- lower.isle\n</code></pre></div>\n<p>Ideally in this case, we'd be able to express dependency between <code>inst.isle</code> and <code>inst_enum.isle</code> in the language itself; but if there's a fundamental reason why we can't do it, this approach will require at the very least a \"merge\" of some sort between ISLE files, this makes this process less transparent. As a side note: is there a reason why ISLE couldn't be augmented to support a simple form of <code>import</code> directives?</p>\n<hr>\n<p>There are a bunch of pros/cons to both items above, and my objective with this issue is not to decide on which one is better, but instead, make this conversation public to see what others think about this and what could be a sensible path forward.</p>\n<p>In terms of how this affects the development of Winch; I don't think it affects it much. I would've preferred to start with <code>cranelift-asm</code>, but I see value in reducing complexity up-front, and delaying any refactoring until there's a clear picture of how all the pieces interact together.  If there isn't a clear path forward, I'd prefer to keep the <code>winch</code>/<code>cranelift-codegen</code> dependency temporarily and avoid the <code>cranelift-asm</code> refactoring until we have an agreement on what an acceptable solution is here. </p>\n</blockquote>",
        "id": 307524237,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667396223
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178#issuecomment-1300851783\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178\">issue #5178</a>:</p>\n<blockquote>\n<p><a href=\"https://github.com/bytecodealliance/wasmtime/issues/4125\">https://github.com/bytecodealliance/wasmtime/issues/4125</a> was the issue about generating machine instruction definitions that we talked about in the meeting today.</p>\n<p>For the purposes specifically of unblocking a separate <code>cranelift-asm</code> crate, I think we could skip all the bits about collecting operands and basically everything other than what it takes to define the <code>enum</code> itself. Everything else can be added later.</p>\n<p>I also think that yaml or toml would be nice for defining these. I specifically want to keep them declarative, and not programattically generated from \"recipes\" (like CLIF is in <code>cranelift-meta</code>) because it gets really hard to find the one place where an instruction is defined and where all instructions that exist are.</p>\n<p>Straw person:</p>\n<div class=\"codehilite\" data-code-language=\"YAML\"><pre><span></span><code><span class=\"nt\">instructions</span><span class=\"p\">:</span><span class=\"w\"></span>\n<span class=\"w\">  </span><span class=\"nt\">nop</span><span class=\"p\">:</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">len</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">u8</span><span class=\"w\"></span>\n<span class=\"w\">  </span><span class=\"nt\">alu_rmi_r</span><span class=\"p\">:</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">size</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">OperandSize</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">op</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">AluRmiROpcode</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">src1</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">Gpr</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">src2</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">GprMemImm</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"nt\">dst</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"l l-Scalar l-Scalar-Plain\">WritableGpr</span><span class=\"w\"></span>\n<span class=\"w\">  </span><span class=\"c1\"># etc...</span><span class=\"w\"></span>\n</code></pre></div>\n<p>We compile this to ISLE with and without an <code>extern</code> in <code>build.rs</code> depending which crate we are building.</p>\n<p>We can make the data format richer as we add features (collecting operands automatically, etc)</p>\n</blockquote>",
        "id": 307567246,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667406893
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178#issuecomment-1300982668\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178\">issue #5178</a>:</p>\n<blockquote>\n<p>I second the table-driven approach above; we want to do it eventually anyway and it solves this problem, so it seems to be the cheapest and simplest way forward.</p>\n<p>One constraint not mentioned above that's worth naming explicitly here is that, AFAIK, a crate cannot have a dependence on another crate's source tree. So directly using either a yaml/toml <em>or</em> an ISLE file from <code>cranelift-codegen</code> in <code>cranelift-asm</code>, or vice-versa, is not possible. I think probably the cleanest way forward is to put the description in <code>cranelift-asm</code> along with the generator, and give it a mode to produce an \"extern variant\" of the enum definition (this is kind of like a header file for a library). Then we can have a <code>scripts/update-inst-defs.sh</code> or whatever that generates checked-into-git ISLE in both <code>cranelift-asm</code> and <code>cranelift-codegen</code>. Thoughts on that?</p>\n</blockquote>",
        "id": 307579120,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1667410165
    },
    {
        "content": "<p>saulecabrera <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178#issuecomment-1325472308\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178\">issue #5178</a>:</p>\n<blockquote>\n<p>One of the open questions that came out of exploring this approach is: what's the cleanest way to handle the dependencies needed for a successful generation of ISLE types (concretely in this case the <code>MachInst</code> enum). For example it's generally common for <code>MachInst</code> definitions to depend on types defined through ISLE's prelude, like <code>bool</code>, <code>u8</code>; or to depend on other types that are guaranteed to be available in their environment like <code>Gpr</code>.</p>\n<p>According to how the ISLE compiler works today, which requires an inline declaration of some sort of these external types, achieving a fully independent generation process, will require making the generation process aware of such dependencies. I can think of at least two ways to achieve this:</p>\n<ol>\n<li>\n<p>Requiring the configuration definitions to provide entries for all of their dependencies. </p>\n</li>\n<li>\n<p>Deriving the dependencies at generation time. </p>\n</li>\n</ol>\n<p>Although, both avenues are feasible, they introduce questionable level of indirection, which is probably not desirable long term. </p>\n<p>Option 1: Introduces more duplication by requiring the definition of the universe of extern types that a particular generation depends on.</p>\n<p>Option 2: This is only partially possible, and mostly applicable when generating enums, which don't require the definition extern enum arms. Down the road this becomes problematic when synchronizing the extern generation of the <code>MachInst</code> enum in <code>cranelift-codegen</code>. </p>\n<p>After chatting with @cfallin, we concluded that the cleanest approach would be to have a crate-level solution for artifact dependencies; similar to what is proposed here <a href=\"https://github.com/rust-lang/cargo/issues/9096\">https://github.com/rust-lang/cargo/issues/9096</a>. Since this proposal is not ready yet, we concluded that the next cleanest approach might be to go with a feature driven assembler in <code>cranelift-codegen</code>, in which particular features control which compiler capabilities are exposed depending on the consumer: the optimizing pieces for <code>cranelift-wasm</code> and the baseline pieces for <code>winch</code>. </p>\n</blockquote>",
        "id": 311879241,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1669227090
    },
    {
        "content": "<p>saulecabrera edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178#issuecomment-1325472308\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/5178\">issue #5178</a>:</p>\n<blockquote>\n<p>One of the interesting questions that came out of exploring this approach is: what's the cleanest way to handle the dependencies needed for a successful generation of ISLE types (concretely in this case the <code>MachInst</code> enum). For example it's generally common for <code>MachInst</code> definitions to depend on types defined through ISLE's prelude, like <code>bool</code>, <code>u8</code>; or to depend on other types that are guaranteed to be available in their environment like <code>Gpr</code>.</p>\n<p>According to how the ISLE compiler works today, which requires an inline declaration of some sort of these external types, achieving a fully independent generation process, will require making the generation process aware of such dependencies. I can think of at least two ways to achieve this:</p>\n<ol>\n<li>\n<p>Requiring the configuration definitions to provide entries for all of their dependencies. </p>\n</li>\n<li>\n<p>Deriving the dependencies at generation time. </p>\n</li>\n</ol>\n<p>Although, both avenues are feasible, they introduce questionable level of indirection, which is probably not desirable long term. </p>\n<p>Option 1: Introduces more duplication by requiring the definition of the universe of extern types that a particular generation depends on.</p>\n<p>Option 2: This is only partially possible, and mostly applicable when generating enums, which don't require the definition extern enum arms. Down the road this becomes problematic when synchronizing the extern generation of the <code>MachInst</code> enum in <code>cranelift-codegen</code>. </p>\n<p>After chatting with @cfallin, we concluded that the cleanest approach would be to have a crate-level solution for artifact dependencies; similar to what is proposed here <a href=\"https://github.com/rust-lang/cargo/issues/9096\">https://github.com/rust-lang/cargo/issues/9096</a>. Since this proposal is not ready yet, we concluded that the next cleanest approach might be to go with a feature driven assembler in <code>cranelift-codegen</code>, in which particular features control which compiler capabilities are exposed depending on the consumer: the optimizing pieces for <code>cranelift-wasm</code> and the baseline pieces for <code>winch</code>. </p>\n</blockquote>",
        "id": 311879281,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1669227111
    }
]