[
    {
        "content": "<p><a href=\"https://github.com/jameysharp\">jameysharp</a> added the wasmtime label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7669\">Issue #7669</a>.</p>",
        "id": 406867254,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702085079
    },
    {
        "content": "<p><a href=\"https://github.com/jameysharp\">jameysharp</a> added the enhancement label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7669\">Issue #7669</a>.</p>",
        "id": 406867255,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702085079
    },
    {
        "content": "<p>jameysharp opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7669\">issue #7669</a>:</p>\n<blockquote>\n<h4>Feature</h4>\n<p>So far usually a guest has consisted of only one core WebAssembly module, but with the component model on its way, that's changing. For each stack frame in a profile, the guest profiler should indicate which module that frame's function came from. If the same module is instantiated multiple times, ideally the profile would also report which instance was running.</p>\n<h4>Benefit</h4>\n<p>In multi-module guests, seeing only a function name is confusing. Including the module identity will help the user understand which part of their code is running.</p>\n<h4>Implementation</h4>\n<p>I'm not sure how to identify a module in a human-meaningful way. I'm not sure if modules have useful names inside components, or how to find those names if they exist. Similarly I don't think instances have an identity that we can find while stack-walking or that means anything to the user; I believe this is an open issue for our core-dump support as well.</p>\n<h4>Alternatives</h4>\n<p>We could continue to make the user guess which module each frame is from. In many cases probably the important function names are unique across modules anyway. For the moment, while multi-module guests remain unusual, the _status quo_ is probably fine.</p>\n</blockquote>",
        "id": 406867258,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1702085081
    }
]