[
    {
        "content": "<p>afonso360 opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7191\">issue #7191</a>:</p>\n<blockquote>\n<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Hey,</p>\n<p>RISC-V has a number of linker relaxation optimizations that it can perform. These require the <code>R_RISCV_RELAX</code> relocation to be used in order for the linker to be able to apply them.</p>\n<p>This is also a continuation of the discussion in #7047. There we decided that it would not be a good idea to implement compressed conditional branches due to their low offset range. We can instead implement them as normal branches and use <code>RELAX</code> to let the linker compress them if it finds it beneficial.</p>\n<p>All of the possible relaxation sequences are available in the <a href=\"https://github.com/riscv-non-isa/riscv-elf-psabi-doc/blob/master/riscv-elf.adoc#linker-relaxation\">Linker Relaxation</a> section of the RISC-V ELF document.</p>\n<h3>Implementation</h3>\n<p>We can't just apply <code>RELAX</code> to the existing relocations and expect everything to work. Since cranelift has a similar <code>Label</code> mechanism that computes offsets, adding <code>RELAX</code> at any point in the middle of those would cause these offsets to become wrong.</p>\n<p>The easiest way that I can think of to implement this would be to add a flag to cranelift that would preserve all labels that were emitted during lowering and transform all <code>LabelUse</code>'s into their equivalent relocation.</p>\n<p>This would allow the linker to have knowledge of where all the branches are, and adjust them based on what relaxations it has performed.</p>\n</blockquote>",
        "id": 395546916,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696774789
    },
    {
        "content": "<p><a href=\"https://github.com/afonso360\">afonso360</a> added the cranelift:area:riscv64 label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/7191\">Issue #7191</a>.</p>",
        "id": 395546917,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1696774790
    }
]