[
    {
        "content": "<p>tschneidereit opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>People keep running into problems with <code>wasmtime serve</code> because by default it only exposes <code>wasi:proxy</code>, nothing else. I think we should change the behavior here to imply <code>-S common</code> to make default toolchains and in particular the normal Preview1 adapter work.</p>\n<p>One could see it as a downside that <code>wasmtime serve</code> would be a bit less specifically about HTTP, but I can't really come up with compelling arguments for why that'd be a problem.</p>\n</blockquote>",
        "id": 426110424,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710245231
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-1991995704\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>The reason this wasn't done by default originally was because it was seen as desirable to have <code>wasmtime serve</code> by-default work with the <code>wasi:http/proxy</code> world. By enabling <code>-S common</code> by default it means that, I suspect, no provider works with <code>wasi:http/proxy</code> by default.</p>\n<p>Given that I'd personally see two possible routes from here:</p>\n<ol>\n<li>Improve tooling/errors/etc to better guide developers towards success through the proxy adapter. Unsure what this would mean for various tools and such, but there's probably at least something to improve here.</li>\n<li>See this as rationale and pushback for having such a small <code>wasi:http/proxy</code> world and add more imports there (e.g. <code>-S common</code>)</li>\n</ol>\n<p>If possible I think it'd be good to hold the line where <code>wasmtime serve</code> matches <code>wasi:http/proxy</code> by default and the problems with the adapter serve as motivation for rejiggering something else in the system. (although I'm not necessarily 100% opposed to just turning on <code>-S common</code>, I mostly think it'd be good to try to keep this line if we can, but not at all costs)</p>\n</blockquote>",
        "id": 426158928,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710258975
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-1994344146\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>I agree that in principle it'd be good to keep this minimal. I'm not convinced that we'll be able to provide a developer experience here that'll not have people continue to run into roadblocks immediately. Yes, we can make those roadblocks easier to understand (and should, independently, of this particular issue!)</p>\n<p>I think there are two things making this challenging to address: one is that perhaps the reality is that most use cases really do want more of WASI for running a server than is currently contained in <code>wasi:http/proxy</code>. The other though is that most tooling still uses the WASIp1 adapter, and that that adapter just pulls in more requirements than we provide. If there's a way to address the latter somehow, that'd go a long way to a solution. I do not think that forcing people to understand the concept of adapters and making them choose between multiple is a good answer, fwiw.</p>\n<p>If we can't solve this, then that to me indicates that we should make <code>wasmtime serve</code> work with the adapter out of the box, independently from our stance on what should and shouldn't be in <code>wasi:http/proxy</code>.</p>\n</blockquote>",
        "id": 426333014,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710334530
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-1995098180\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>To clarify though I'm not arguing for minimality, I agree that we should turn <code>-S common</code> on by default. This was <a href=\"https://github.com/WebAssembly/wasi-http/issues/79\">discussed a bit while ago</a> as well for some added context.</p>\n<p>My point is that adding <code>-S common</code> by default is, in my opinion, not the best place to fix this. If we did that I think it's admitting that when facing reality the proxy world is too small, and I'd prefer if the <code>wasi:http/proxy</code> world itself admitted to said reality and added more interfaces.</p>\n<p>Or perhaps put another way, can you expand a bit more on why you think it's ok <code>wasmtime serve</code> and <code>wasi:http/proxy</code> diverge? That's what I'm trying to keep aligned, but it sounds like you think it's ok if they diverge.</p>\n</blockquote>",
        "id": 426392866,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710351010
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-1997190418\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<blockquote>\n<p>Or perhaps put another way, can you expand a bit more on why you think it's ok <code>wasmtime serve</code> and <code>wasi:http/proxy</code> diverge? That's what I'm trying to keep aligned, but it sounds like you think it's ok if they diverge.</p>\n</blockquote>\n<p>Yeah, that is a great question, and I agree that it needs an answer if we want to change anything here (that doesn't involve changes to <code>wasi:http/proxy</code>.</p>\n<p>My take is twofold: one part is very pragmatically that, as mentioned above, it's very difficult right now to target a pure <code>wasi:http/proxy</code> environment. If we can truly address that in a reasonable timeframe, I'm all for it. I don't really know what that'd look like, though.</p>\n<p>The second part is that <code>serve</code> indicates something more than <code>proxy</code> does. In fact, I think we should also add the ability to map directories to preopens, as for <code>wasmtime run</code>.</p>\n<p>I guess more generally I'm in this case not too concerned about the availability of more functionality leading developers to expect those to be available in all environments implementing <code>wasi:http/proxy</code>. That's an argument based on intuition of course, so it might well be wrong.</p>\n</blockquote>",
        "id": 426517680,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710414458
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-1998070397\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>Reading over <a href=\"https://github.com/WebAssembly/wasi-http/issues/79\">https://github.com/WebAssembly/wasi-http/issues/79</a> again I think I'm probably the only one advocating for <code>wasi:http/proxy</code> and <code>wasmtime serve</code> being the same thing, and I additionally don't disagree with anything you say. I'll send a PR to update this.</p>\n</blockquote>",
        "id": 426602782,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710440667
    },
    {
        "content": "<p>sunfishcode <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-2004174813\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>Thinking about this more, it seems desirable to avoid a situation where filesystems/sockets come to be seen as \"common\" functionality that's implicitly included in everything.</p>\n<p>One potential problem here is that <code>-S common</code> is confusingly named. My understanding is that the name \"common\" came from \"wasi-common\" which came from having code in common between wasmtime and lucet. But it sounds like \"common functionality\". I've now submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/8166\">https://github.com/bytecodealliance/wasmtime/pull/8166</a> to rename it.</p>\n<p>Another potential problem is that <code>-S common</code>  might be too coarse-grained. Perhaps we should split it up so that users that just need environment variables don't need to pull in the rest.</p>\n<p>Even with the rename, and even if we provide finer-grained flags, there still a question of, what do we want the proxy world to be? And, if we start bundling files/sockets/etc. with it by default, will it be harder in the future t disable it by default again, if we improve the ergonomics and want to start promoting platforms based on the proxy world?</p>\n<p>What if we added a diagnostic to wasmtime for when a program has unsatisfied imports that suggests users add <code>-S</code> flags that would satisfy their imports? Would that be enough, to justify keeping <code>wasmtime serve</code> the same as <code>wasi:http/proxy</code>? There'd still be a papercut when users get the error, and have to add the flag. But at least it'd be clear to users what they need to do.<br>\n</p>\n</blockquote>",
        "id": 427507530,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710774577
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-2004384125\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<blockquote>\n<p>What if we added a diagnostic to wasmtime for when a program has unsatisfied imports that suggests users add <code>-S</code> flags that would satisfy their imports? Would that be enough, to justify keeping <code>wasmtime serve</code> the same as <code>wasi:http/proxy</code>? There'd still be a papercut when users get the error, and have to add the flag. But at least it'd be clear to users what they need to do.</p>\n</blockquote>\n<p>I think having that would to some degree alleviate my concerns here. I'm not sure it would have all that much value though: I'm skeptical that users would take much more away from this than \"oh ok, I guess the way to run these things in the Wasmtime CLI involves adding <code>-S [something]</code>.</p>\n<p>I also don't really think that <code>wasmtime serve</code> is the right place to teach people to target <code>wasi:http/proxy</code>: there are lots of use cases for running a server that have nothing to do with an L7 proxy.</p>\n</blockquote>",
        "id": 427525978,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710779269
    },
    {
        "content": "<p>sunfishcode <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086#issuecomment-2007789070\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/8086\">issue #8086</a>:</p>\n<blockquote>\n<p>For example, on <a href=\"http://crates.io\">crates.io</a> dependencies can include their own wit-bindgen bindings, which then get silently added to the implied world of the final component. It's possible for developers to pick up additional component-model-level dependencies without being aware of it.</p>\n<p>If we want to have small and simple works like wasi-http's <code>proxy</code>, but also things like wasi-cloud-core's <code>http-service</code> and more, and not have filesystems and sockets and environment variables become de-facto dependencies in all the places, where's the time and place to push back?<br>\n</p>\n</blockquote>",
        "id": 427780258,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1710870391
    }
]