[
    {
        "content": "<p><a href=\"https://github.com/alexcrichton\">alexcrichton</a> added the fuzzing label to <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255\">Issue #9255</a>.</p>",
        "id": 470661041,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1726503368
    },
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255\">issue #9255</a>:</p>\n<blockquote>\n<p>One of the things we've struggled with historically in fuzzing is generating interesting enough WebAssembly modules which execute interesting corner cases without trapping almost immediately. For example many wasm-smith modules might immediately have an infinite loop, immediately infinitely recurse, or immediately trap with an out of bounds load. For all of these conditions we have various checks and balances in place to ensure that we get hopefully some better coverage, but I was just thinking of another possible way we could improve it.</p>\n<p>What I'm imagining is that we can leverage libFuzzer's coverage-based feedback with a scheme such as:</p>\n<ul>\n<li>Fix a constant N at a big number, maybe 10_000</li>\n<li>Allocate N bytes extra in all VMContexts when this feature is enabled, and initialize all bytes to zero</li>\n<li>Assign a unique number to all Cranelift lowering rules</li>\n<li>When a lowering I rule is used, then after the lowering rule is matched increment the byte at <code>I % N</code> in the VMContext</li>\n<li>When fuzzing, enable this option (perhaps only sometimes?). After WebAssembly execution is performed take a look at the map on each <code>VMContext</code> (maybe this is a per-store map then instead of per-<code>VMContext</code>?)</li>\n<li>Define N empty functions at compile time with gobbledegook to make sure they don't get optimized away</li>\n<li>For each byte in the map that has been incremented call function N.</li>\n</ul>\n<p>The hope is that this scheme enables libFuzzer to see what actually happened at runtime. It can know that not only was the lowering rule executed in Cranelift but addtionally the generated code was executed at runtime. WIth N being sufficiently high enough we could get pretty good coverage of \"actually executed this lowering rule in a fuzz test case\".</p>\n<p>I'll note that this is similar to #1151 in spirit and that there'd still be a lot of details to work out here. For example how exactly to model this in Cranelift would be tricky as right now there's not an easy notion of \"this lowering rule I was used\" nor would it necessarily be easy to inject code to modify bytes during lowering. In any case though I figured I could note down the issue for possible future exploration.</p>\n</blockquote>",
        "id": 470661043,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1726503370
    },
    {
        "content": "<p>github-actions[bot] <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255#issuecomment-2353361939\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255\">issue #9255</a>:</p>\n<blockquote>\n<h4>Subscribe to Label Action</h4>\n<p>cc @fitzgen</p>\n<p>&lt;details&gt;<br>\nThis issue or pull request has been labeled: \"fuzzing\"</p>\n<p>Thus the following users have been cc'd because of the following labels:</p>\n<ul>\n<li>fitzgen: fuzzing</li>\n</ul>\n<p>To subscribe or unsubscribe from this label, edit the &lt;code&gt;.github/subscribe-to-label.json&lt;/code&gt; configuration file.</p>\n<p><a href=\"https://github.com/bytecodealliance/subscribe-to-label-action\">Learn more.</a><br>\n&lt;/details&gt;</p>\n</blockquote>",
        "id": 470661339,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1726503439
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255#issuecomment-2356876968\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255\">issue #9255</a>:</p>\n<blockquote>\n<p>This is a neat little hack!</p>\n<p>I think it would be relatively straightforward to implement by</p>\n<ul>\n<li>\n<p>Modifying the ISLE compiler to add a <code>on_constructor_rule_fired</code> hook to its generated trait, along with calls to that trait at the appropriate places. This hook would have a default implementation that does nothing. The hook would be given the term name, unique rule ID, ISLE source location, etc...[^0]</p>\n</li>\n<li>\n<p>We implement this hook for lowering, saving a record of which <code>lower</code> rule fired for a particular CLIF instruction's lowering in the ISLE context.</p>\n</li>\n<li>\n<p>After the CLIF instruction is lowered, we inspect that aforementioned record, and emit a canned mach-inst sequence to set the <code>i % N</code>th bit in the bitmap in the vmctx[^1] where <code>i</code> is the global index of this constructor rule and <code>N</code> is the size of the bitmap. Note that because we lower in a backwards pass, emitting the bit-setting code after we lower means the bit-setting code comes before the lowered CLIF instruction. We want this, so that branching instructions or returns or whatever don't prevent their rule's associated bit from getting set.</p>\n</li>\n</ul>\n<p>Note that we also might want to make those dummy functions return a unique integer, just to try and prevent LLVM/the linker from deduplicating them all and defeating our intentions.</p>\n<p>[^0]: Or, instead of symbolicating those things eagerly, it could be given just a unique rule ID, and then provide some mechanism for getting the other bits on demand. I think all we really need for this use case is the rule's term's name.</p>\n<p>[^1]: Insert handwaving about new kind of CLIF global for getting this bitmap's location, similar to stack limits, to make this generic for all Cranelift users rather than specific to just Wasmtime.</p>\n</blockquote>",
        "id": 471088110,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1726605490
    },
    {
        "content": "<p>fitzgen edited a <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255#issuecomment-2356876968\">comment</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/9255\">issue #9255</a>:</p>\n<blockquote>\n<p>This is a neat little hack!</p>\n<p>I think it would be relatively straightforward to implement by</p>\n<ul>\n<li>\n<p>Modifying the ISLE compiler to add a <code>on_constructor_rule_fired</code> hook to its generated trait, along with calls to that trait at the appropriate places. This hook would have a default implementation that does nothing. The hook would be given the term name, unique rule ID, ISLE source location, etc...[^0]</p>\n</li>\n<li>\n<p>We implement this hook for lowering, saving a record of which <code>lower</code> rule fired for a particular CLIF instruction's lowering in the ISLE context.</p>\n</li>\n<li>\n<p>After the CLIF instruction is lowered, we inspect that aforementioned record, and emit a canned mach-inst sequence to set the <code>i % N</code>th bit in the bitmap in the vmctx[^1] where <code>i</code> is the global index of this constructor rule and <code>N</code> is the size of the bitmap. Note that because we lower in a backwards pass, emitting the bit-setting code after we lower means the bit-setting code comes before the lowered CLIF instruction. We want this, so that branching instructions or returns or whatever don't prevent their rule's associated bit from getting set.</p>\n</li>\n</ul>\n<p>Note that we also might want to make those dummy functions return a unique integer, just to try and prevent LLVM/the linker from deduplicating them all and defeating our intentions.</p>\n<p>[^0]: Or, instead of symbolicating those things eagerly, it could be given just a unique rule ID, and then provide some mechanism for getting the other bits on demand. I think all we really need for this use case is the rule's term's name so we can filter for only <code>lower</code> rules and not all the intermediate terms' rules.</p>\n<p>[^1]: Insert handwaving about new kind of CLIF global for getting this bitmap's location, similar to stack limits, to make this generic for all Cranelift users rather than specific to just Wasmtime.</p>\n</blockquote>",
        "id": 471088209,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1726605531
    }
]