[
    {
        "content": "<p>alexcrichton opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>Upon thinking about this recently I believe we can shrink the <code>.addrmap</code> section of compiled artifacts a significant amount. Currently this section is used to translate from machine code addresses to addresses of instructions within the original wasm file itself. This information is used primarily backtraces to go from machine address to wasm address and then via the wasm dwarf from wasm address to filename and line number.</p>\n<p>At this time, though, we have a mapping from machine code address to wasm address <em>for every single wasm instruction in the entire module</em>. I don't actually think that this is necessary. Instead I think we only need mappings for trapping instructions and instructions which call a function (not a wasm function but instead a Cranelift-level call to include things like <code>memory.grow</code> and such). At this time we're not collecting \"asynchronous backtraces\" or anything like that so there's no need to actually have an address map for every single wasm instruction in the module. </p>\n<p>I suspect that this would lead to huge savings on the <code>.addrmap</code> section which is currently sometimes even larger than the <code>.text</code> section. I don't think this will necessarily be trivially implemented, though, and will involve some trickery on the cranelift side of things to correlating the source of all machine instructions, whether they're calling, and whether they can trap.</p>\n</blockquote>",
        "id": 261965107,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637258252
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973133109\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>Great idea!</p>\n<p>I'll note that the line-number-per-wasm-instruction (or actually one really wants line-number-per-compiled-instruction I think) is actually useful if one is single-stepping through code; the infra right now is I guess fully general because of this use-case. But of course backtraces are different, as you say!</p>\n<p>It'd probably be reasonably easy to add a knob implements your suggestion -- I'd do it by returning an <code>Option&lt;SourceLoc&gt;</code> <a href=\"https://github.com/bytecodealliance/wasmtime/blob/4c75616a7cebf01cd26f7b0f32ac52aa2493576c/cranelift/codegen/src/machinst/lower.rs#L1099\">here</a>, probably...</p>\n</blockquote>",
        "id": 261967671,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637259400
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973134985\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>As discussed in private chat, we should actually be able to remove the <code>.addrmap</code> section completely by updating/fixing/special casing our <code>wasm -&gt; source</code> to <code>native -&gt; source</code> DWARF translation so that we can use the relevant DWARF sections directly without any <code>native -&gt; wasm</code> translation that <code>.addrmap</code> is providing.</p>\n</blockquote>",
        "id": 261967949,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637259525
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973135524\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>(The DWARF translation would happen at module compilation time, not runtime.)</p>\n</blockquote>",
        "id": 261968012,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637259562
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973141477\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>DWARF translation only happens when there is DWARF debuginfo in the source modules in the first place. <code>.addrmap</code> is also used for backtraces when there is no DWARF debuginfo at all or when DWARF translation is not enabled.</p>\n</blockquote>",
        "id": 261968946,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637260005
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973152469\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>That's correct. In the mode I am proposing, we would still only include the subset of DWARF that we are querying today to reconstruct backtraces after translating the native PC to a Wasm PC via <code>.addrmap</code>, this wouldn't imply including every DWARF section and all of their contents.</p>\n</blockquote>",
        "id": 261970907,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637260914
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547#issuecomment-973160789\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/3547\">issue #3547</a>:</p>\n<blockquote>\n<p>The DWARF <code>.debug_line</code> section can't encode a native pc -&gt; wasm pc mapping as necessary when there is no debuginfo. It can only encode a native pc -&gt; (file, line, column, flags) tuple mapping. Wasmtime shows module name + wasm pc when there is no debuginfo, right? On one hand if you encode it as native pc -&gt; (file, line=wasm pc, 0, no flags) that would be bigger than what you can do using <code>.addrmap</code> if you were to encode it using deltas. On the other hand <code>.debug_line</code> always encodes it as deltas, which makes lookup much slower than the current scheme as you have to traverse the entire section. On native DWARF this is somewhat less painful as every compilation unit gets it's own <code>.debug_line</code> mapping, but for generated wasm <code>.debug_line</code> you would likely put the entire wasm module in a single compilation unit.</p>\n</blockquote>",
        "id": 261972409,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1637261589
    }
]