[
    {
        "content": "<p>Gurubaseio opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813\">PR #9813</a> from <code>Gurubaseio:wasmtime-guru</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>Hello Team,</p>\n<p>This PR is a friendly notification that the <a href=\"https://gurubase.io/g/wasmtime\">Wasmtime Guru</a> has been added to Gurubase. The Wasmtime Guru uses data from this repository and the <a href=\"https://docs.wasmtime.dev/\">documentation</a> to answer questions by leveraging the LLM.</p>\n<p>Gurubase is a centralized, RAG-based learning and troubleshooting assistant platform. Each \"Guru\" is equipped with custom knowledge to answer user questions based on data collected for that tool. More information can be found in <a href=\"https://github.com/getanteon/gurubase\">this repo</a>.</p>\n<p>This PR updates the README to indicate that Wasmtime users can now ask questions to Wasmtime Guru. As shown in the <a href=\"https://github.com/getanteon/gurubase?tab=readme-ov-file#used-by\">Used By</a> section, over 100 open-source repositories currently showcase their Guru in their README.md.</p>\n<p>By default, there are three possible actions:</p>\n<ol>\n<li>If you dislike it, we can immediately disable Wasmtime Guru in Gurubase and remove this PR.</li>\n<li>If you like it but don’t want to add it to the README, we can remove this PR or include it in another place you prefer.</li>\n<li>If you’re happy with it, we can keep it as is and merge the PR. You can then start managing Wasmtime Guru as described <a href=\"https://github.com/getanteon/gurubase?tab=readme-ov-file#how-to-claim-a-guru\">here</a>.</li>\n</ol>\n<p>Although this PR is created by the Gurubase Notifier account, the team monitors it and will answer any questions you may have.</p>\n<p><strong>Note:</strong> If you consider this PR a time-waster, apologize for the inconvenience. Developers often request us to create a Guru for the tools they use. Once we create it, we notify the maintainers to inform them and seek their approval.<br>\n</p>\n</blockquote>",
        "id": 488820664,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1734089661
    },
    {
        "content": "<p><strong>Gurubaseio</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-default-reviewers\">wasmtime-default-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813\">PR #9813</a>.</p>",
        "id": 488820665,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1734089661
    },
    {
        "content": "<p><strong>Gurubaseio</strong> requested <a href=\"https://github.com/alexcrichton\">alexcrichton</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813\">PR #9813</a>.</p>",
        "id": 488820666,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1734089661
    },
    {
        "content": "<p>fitzgen closed without merge <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813\">PR #9813</a>.</p>",
        "id": 488842055,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1734097136
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813#issuecomment-2541879087\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/9813\">PR #9813</a>:</p>\n<blockquote>\n<p>@Gurubaseio please remove us from your systems and please do not claim to be a \"Guru\" or any other kind of expert on Wasmtime or related systems. We do not want a third-party system claiming to be able to answer questions about our project.</p>\n<p>Speaking bluntly, if you would like feedback: you need a better notion of \"consent\". This should be opt-in, not opt-out. You should not add a project to your systems and claim affiliation just because \"Developers request it\". That's going against the social contract of open-source and is a bad look. Thanks.</p>\n</blockquote>",
        "id": 488884405,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1734109538
    }
]