[
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282#issuecomment-1522593808\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282\">issue #6282</a>:</p>\n<blockquote>\n<p>This PR now produces output that works as expected with <a href=\"https://profiler.firefox.com/\">https://profiler.firefox.com/</a>, and I don't think it's fundamentally missing anything.</p>\n<p>Before merging, I'd like to move the <code>GuestProfiler</code> struct somewhere in the <code>wasmtime</code> crate, instead of leaving it in <code>wasmtime-cli</code> where only <code>wasmtime run</code> can use it.</p>\n<p>I don't think any of the implementation will change though, just move elsewhere, so I'm marking this as ready for review.</p>\n</blockquote>",
        "id": 352663147,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682469150
    },
    {
        "content": "<p>github-actions[bot] <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282#issuecomment-1524083137\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282\">issue #6282</a>:</p>\n<blockquote>\n<h4>Subscribe to Label Action</h4>\n<p>cc @kubkon, @peterhuene</p>\n<p>&lt;details&gt;<br>\nThis issue or pull request has been labeled: \"wasi\", \"wasmtime:api\"</p>\n<p>Thus the following users have been cc'd because of the following labels:</p>\n<ul>\n<li>kubkon: wasi</li>\n<li>peterhuene: wasmtime:api</li>\n</ul>\n<p>To subscribe or unsubscribe from this label, edit the &lt;code&gt;.github/subscribe-to-label.json&lt;/code&gt; configuration file.</p>\n<p><a href=\"https://github.com/bytecodealliance/subscribe-to-label-action\">Learn more.</a><br>\n&lt;/details&gt;</p>\n</blockquote>",
        "id": 352952406,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682545499
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282#issuecomment-1528388208\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282\">issue #6282</a>:</p>\n<blockquote>\n<p>I got rid of the need for <code>Store</code> in <code>sample()</code>. Then I discovered that I can't put a <code>GuestProfiler</code> directly in the <code>Host</code> structure because some of the WASI extensions require that <code>Host</code> must be cloneable.</p>\n<p>As far as I can tell I end up needing an <code>Arc</code> and <code>Mutex</code> anyway. I would love for somebody to tell me how to avoid that.</p>\n<p>It was still worth doing this because now any particular PC is only looked up once per profile and cached by <code>fxprof_processed_profile</code>. Different PCs within the same function need to be looked up separately but since we only collect stack traces at epoch interruption points there aren't so many distinct PCs. This should significantly reduce profiling overhead but I haven't measured how much impact it actually has.</p>\n<p>I struggled with this a bunch because I was trying to make it automatically use all modules which have been registered within the current <code>Store</code>'s <code>ModuleRegistry</code>. But for WASI commands the module isn't registered in the store until you actually try to invoke it, and I tried all sorts of ways to hook into that registration before realizing that the caller knows which modules they care about and I can just make it their problem to tell me.</p>\n<p>Then I decided that it's a feature to be able to exclude modules from profiles: if you have some proprietary module that you're linking with your customer's modules, you may not want to reveal anything about the implementation of your module when providing them with a profile.</p>\n</blockquote>",
        "id": 354121582,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682731326
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282#issuecomment-1529834882\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282\">issue #6282</a>:</p>\n<blockquote>\n<blockquote>\n<p>As far as I can tell I end up needing an Arc and Mutex anyway. </p>\n</blockquote>\n<p>Ah this is due to the integration of <code>wasi-threads</code> where that's modeled by cloning the store's context to duplicate it on another thread. Otherwise though the cloning is not required. You can take a similar route as the <code>WasiNnCtx</code> integration, for example, which additionally does not implement <code>Clone</code> so what it does is it's bundled into an <code>Arc</code> where whenever it's required it calls <code>Arc::get_mut</code>. That fails if there's more than one clone, or more than one thread, and the error message says \"this doesn't support threads yet\". I think that profiling will fall into the same bucket?</p>\n<p>In the long-term future I could imagine that there's a standalone profiler struct where you acquire thread-specific profilers from that structure. The <code>Host</code> could store the standalone profiler (which internally probably has an arc and a mutex) and additionally thread-specific profilers. The <code>Clone for Host</code> impl would then use the standalone profiler to get a new thread-specific profiler, allowing each thread to have mutable access to its profiler but no others. Something like that. No need to do here of course, mostly just modeling how this may look in the future with support for threads.</p>\n<blockquote>\n<p>I can just make it their problem to tell me.</p>\n</blockquote>\n<p>This seems like a neat idea to me! I like the idea of precomputing symbol tables. I do think this has the downside of that it has more setup required, but that's also perhaps not a bad thing and it's not exactly onerous at this time, so it seems fine by me.</p>\n<blockquote>\n<p>I got rid of the need for Store in sample().</p>\n</blockquote>\n<p>Personally I'm a bit wary of this because to me I wouldn't want to commit long-term to being able to capture a stack trace without any input. I'm not sure how we'll ever move away from those thread locals but I sure would love to one day if someone gets a good idea. In such a situation there's no way to start the backtrace without a contextual store being passed  in. All that being said though it's not like we need to get the API 100% prefect to begin with, that's why we have major version bumps after all. I mostly wanted to put this out there, but I additionally think it's fine to land as-is with your current strategy. If and when we remove TLS (fingers crossed) we can figure out how to change this API at this point. I realize that passing the store into something stored within the store is not easy, so let's stick with what you've got.</p>\n</blockquote>",
        "id": 354905788,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682954765
    },
    {
        "content": "<p>jameysharp <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282#issuecomment-1530697634\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6282\">issue #6282</a>:</p>\n<blockquote>\n<p>Thanks for the tips, Alex: that worked!</p>\n<p>Okay, I've addressed most of the issues that you all have raised. What I haven't done is added documentation to the Wasmtime book, or API usage examples to the doc-comments. I'd kind of like to merge the implementation and then come back to that, if that's okay. I hope the doc-comments I've written so far will be a good start for the book, and the usage in <code>run.rs</code> will be a good start for the usage examples…</p>\n<p>There are also still several to-do items, like measuring CPU time and noting wasm entry/leave events, which I also want to defer to future work.</p>\n</blockquote>",
        "id": 355001109,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1682988071
    }
]