[
    {
        "content": "<p>As we're designing the client, I'd like a better idea of what a dependency solve for warg packaged components means for tools like <code>cargo-component</code>. If you have some base component with several dependencies, can they each be resolved independently including their transitives since wasm instantiation semantics allow there to be multiple versions of something at the same time in different places? or do tools like <code>cargo-component</code> want to select one version of a given package to use everywhere if possible? In the independent case, a \"dependency solve\" is just a recursive operation selecting the latest viable candidate for each dependency and then repeating on its dependencies. In the other case, it's a more complicated graph operation.</p>",
        "id": 314263322,
        "sender_full_name": "Robin Brown",
        "timestamp": 1670341295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253989\">@Peter Huene</span> <span class=\"user-mention\" data-user-id=\"253998\">@Luke Wagner</span> <span class=\"user-mention\" data-user-id=\"480579\">@Lann Martin</span></p>",
        "id": 314263370,
        "sender_full_name": "Robin Brown",
        "timestamp": 1670341307
    },
    {
        "content": "<p>I haven't thought about this too deeply yet, but I think a tool like <code>cargo-component</code> would be more geared towards asking the registry for worlds, interfaces, and, perhaps, the \"type\" of a specific component (for its default interface?) so that it can do bindings generation; the user's source builds against the bindings to produce a component that imports/exports instances only. that component can then be published to the registry and used by anything providing or expecting those interfaces.</p>\n<p>I think it'd be in the domain of a tool like <code>wasm-compose</code> where you want to start providing the concrete implementations of the components that comprise your application. Then a registry might be the place to answer \"find me a component (and its transitive dependencies) that satisfies _this_ component's instance imports\"; how an answer to that question translates into a fully linked component that meets the requirements of users for deploying their application, I don't know. it sure seems like there'd still be a lot of manual specification by the user at composition time.</p>",
        "id": 314271774,
        "sender_full_name": "Peter Huene",
        "timestamp": 1670343723
    },
    {
        "content": "<p>to be honest, i struggle with what a good DX is here given how flexible the component model is; we certainly <em>could</em> have one component depend on another directly and define/import that component in the locally produced component for instantiation when building with <code>cargo-component</code>, so it'd need a way of solving dependencies in that case</p>",
        "id": 314273371,
        "sender_full_name": "Peter Huene",
        "timestamp": 1670344211
    },
    {
        "content": "<p>Agreed that the flexibility of component linking raises hard DX questions.  In the fully-general case, I think we'll want a proper <a href=\"https://docs.google.com/presentation/d/11lY9GBghZJ5nCFrf4MKWVrecQude0xy_buE--tnO9kQ/edit#slide=id.gf5785162e3_0_17\">linking language</a> that exposes the full flexibility of linking in a more-ergonomic-than-wat manner.  But I think there are also a bunch of specialized uses of linking where we can follow existing developer conventions and emit a <em>subset</em> of the full linking flexibility (which is fine; we don't have to expose the fullness of component-linking in these cases), and one such example is dep-solving via a traditional dependencies section in a build-config file like <code>package.json</code> or <code>Cargo.toml</code>.  In this context, iiuc, the prevalent developer expectation is to share dependencies by default.  The new opportunity we have is that when a traditional dep-solver would error out due to an unresolvable version conflict, our component-based dep-solve could resolve the conflict by creating multiple instances.  One DX question is whether this is fully automatic and silent or do we think it might surprise the developer and so we want to require the developer to manually resolve the conflict by saying when/where/how to create multiple instances.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://docs.google.com/presentation/d/11lY9GBghZJ5nCFrf4MKWVrecQude0xy_buE--tnO9kQ/edit#slide=id.gf5785162e3_0_17\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/0224ff240f8b497ee1565e15535a1583aa2e17d3\\/68747470733a2f2f6c68362e676f6f676c6575736572636f6e74656e742e636f6d2f73536756657036733339555041526c39655f57707a6e396f4a46416d3733564b585445714b7a6b5556576656526951385a31656475782d30686e7a59526d67414e7a4133382d4d52472d675878673d77313230302d683633302d70)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://docs.google.com/presentation/d/11lY9GBghZJ5nCFrf4MKWVrecQude0xy_buE--tnO9kQ/edit#slide=id.gf5785162e3_0_17\" title=\"Component examples\">Component examples</a></div><div class=\"message_embed_description\">Component examples</div></div></div>",
        "id": 314285300,
        "sender_full_name": "Luke Wagner",
        "timestamp": 1670347732
    }
]