[
    {
        "content": "<p>Just a heads up that I expect to put up a large PR today for warg-server that can conditionally compile-in support for persisting registry data to a PostgresQL instance (you can still use the in-memory store from environments that don't care to persist the registry, e.g. client integration tests, via a CLI option). With this feature, the registry state survives restarts. It won't be everything we need, but it's a step towards getting the server from prototype to a reference implementation.</p>\n<p>It'll also be lacking in tests (general problem with the implementation currently). My goal for the remainder of this week is to focus on adding test coverage for both client and server.</p>",
        "id": 350856089,
        "sender_full_name": "Peter Huene",
        "timestamp": 1681842105
    },
    {
        "content": "<p>hey <span class=\"user-mention\" data-user-id=\"253989\">@Peter Huene</span> that sounds awesome -- any sneak peek how the <code>--content-dir</code> option will change? I'm imagining something like <code>--content-store postgresql://localhost:5432/warg</code> (and makes sense to probably take that via ENV as well), but excited to see what you came up with</p>",
        "id": 350924183,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1681870513
    },
    {
        "content": "<p>Right now the content store isn't changing as part of this PR, but I'm imaging something with similar pluggable backbends for putting the package contents into a blob store, for example, in addition to the existing file system implementation</p>",
        "id": 350928206,
        "sender_full_name": "Peter Huene",
        "timestamp": 1681873314
    },
    {
        "content": "<p>This PR is just for the registry data itself, and you use it like <code>--store postgres</code> with the URL passed via environment (happy to do it another way too)</p>",
        "id": 350928466,
        "sender_full_name": "Peter Huene",
        "timestamp": 1681873499
    },
    {
        "content": "<p>Probably should be named <code>--data-store</code> as the option</p>",
        "id": 350928521,
        "sender_full_name": "Peter Huene",
        "timestamp": 1681873546
    },
    {
        "content": "<p>Ah thanks for the explanation -- I missed that the content store would be unchanged -- I like the ENV pass, I guess the only thing I'd add is that it would be nice to specify the store itself via ENV as well (enabling a no-CLI-arg usage), but not sure if you already have that.</p>\n<p>Also <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> on the rename, though I'll patiently await the PR to read it and learn</p>",
        "id": 350928724,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1681873686
    },
    {
        "content": "<p>FYI, while we'll be able to make many things plug-able using the CLI, there are some things e.g. custom policy that you'll need to extend/configure programmatically by using the server crate as a library.</p>",
        "id": 352345767,
        "sender_full_name": "Robin Brown",
        "timestamp": 1682358664
    },
    {
        "content": "<p>Not with wasm? <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 352345879,
        "sender_full_name": "Lann Martin",
        "timestamp": 1682358694
    },
    {
        "content": "<p>Someday... aren't you in the \"don't boil the ocean\" camp though? <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 352346377,
        "sender_full_name": "Robin Brown",
        "timestamp": 1682358821
    },
    {
        "content": "<p>Yeah but I would put custom policies in that ocean</p>",
        "id": 352346543,
        "sender_full_name": "Lann Martin",
        "timestamp": 1682358857
    },
    {
        "content": "<p>Fair, though that takes us from \"registry reference implementation\" to \"registry framework\" territory which will take a while to flesh out.</p>",
        "id": 352347216,
        "sender_full_name": "Robin Brown",
        "timestamp": 1682359043
    }
]