[
    {
        "content": "<p>I'll be filing a stream of new issues soon on <a href=\"https://github.com/bytecodealliance/registry\">https://github.com/bytecodealliance/registry</a> to add to a github project kanban so we can track progress towards the user stories that comprise the MVP (noted that what's considered \"in\" is still flexible, but some are _clearly_ table stakes).</p>\n<p>My thoughts here are having a \"story\" issue that encapsulates part of one (or more since there's overlap) top-level user stories from the user story document; some stories may depend on other stories. An example story issue would be \"authoring a component from Rust using the registry\", which obviously depends on a lot of pieces in place to work. Story tasks will link their task dependencies.</p>\n<p>Then I'll have task issues that are discrete, actionable implementation work, which may depend on other tasks to complete. Given GitHub doesn't really track issue dependencies (extensions like Zenhub offer it, but let's stick to vanilla GitHub projects for now), I probably won't track these intra-task dependencies explicitly in the issue like we will for stories.</p>\n<p>I think this is a decent basis to start from, but I'm certainly not married to this approach. How does everyone else feel about it?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/registry\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/0ff3fbc2d96fdb65ec4323f474f3de465b2c5190\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f383865316335373733303263643930373336326435383939303239616263316264643033353236646365336261336264623362373034333438353166613036312f62797465636f6465616c6c69616e63652f7265676973747279)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/registry\" title=\"GitHub - bytecodealliance/registry: WebAssembly component registry prototype\">GitHub - bytecodealliance/registry: WebAssembly component registry prototype</a></div><div class=\"message_embed_description\">WebAssembly component registry prototype. Contribute to bytecodealliance/registry development by creating an account on GitHub.</div></div></div>",
        "id": 313191460,
        "sender_full_name": "Peter Huene",
        "timestamp": 1669860131
    },
    {
        "content": "<p>Okay, I've filed the initial set of issues, feel free to add issues for what's being worked on or will be soon; the  GitHub project tracking the issues (<a href=\"https://github.com/orgs/bytecodealliance/projects/7\">https://github.com/orgs/bytecodealliance/projects/7</a>) isn't yet public as I don't have access to make it public</p>",
        "id": 313411856,
        "sender_full_name": "Peter Huene",
        "timestamp": 1669944803
    },
    {
        "content": "<p>Okay, the project is now public (thanks Alex!)</p>",
        "id": 313412136,
        "sender_full_name": "Peter Huene",
        "timestamp": 1669944993
    },
    {
        "content": "<p>I'll be updating the story issues with links to dependent tasks when I get the chance (I'm out tomorrow and Monday)</p>",
        "id": 313413626,
        "sender_full_name": "Peter Huene",
        "timestamp": 1669946079
    }
]