[
    {
        "content": "<p>Hey folks, I was looking for a wasi:http stream but couldn't find one. Just wanted to see if wasi:http had any plans for Websockets, or if that's something that would fall under a different interface</p>",
        "id": 408701518,
        "sender_full_name": "Brooks Townsend",
        "timestamp": 1702941894
    },
    {
        "content": "<p>I think that standardizing wasi:websockets totally makes sense but there are some interesting design questions raised by <span class=\"user-mention\" data-user-id=\"253998\">@Luke Wagner</span> when we had an exchange on this idea. </p>\n<p>IIRC, the most difficult question is how to design the wasi:sockets world given the fact that it's a long-lived connection. Surely we can have a Wasm module that takes \"keepalive\" imports and keeps running for as long as the connection lives (for hours or even for days), but that creates a lot of memory waste. Shall we serialize the states and have an export that acceptes the saved states before that host kills the Wasm instance?</p>",
        "id": 410921550,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1704239170
    },
    {
        "content": "<p>I suspect we'll end up wanting two separate worlds for websockets: one that assumes the guest instance lives as long as the connection, and another (serverless-friendly) one that assumes the guest is only instantiated long enough to handle immediately-available events (e.g. connection initiation and incoming frames) and then shut down until more events are available.  The latter implies that any long-lived state would need to be stored using e.g. <code>wasi:key-value</code> rather than in guest memory.</p>\n<p>I've done a fair amount of design work on the latter world already.  My plan was to experiment with it in Spin and then start working on an official WASI standard based on that experience.  Happy to collaborate in a broader forum if there's interest, though.</p>",
        "id": 411046449,
        "sender_full_name": "Joel Dice",
        "timestamp": 1704300860
    },
    {
        "content": "<p>That separation makes a lot of sense to me; I expect there will be rather-differently-shaped use cases for each of those two worlds and so you want to be somewhat declarative about which one you're targetting.  For the long-lived world, one possibly-useful litmus test I've been thinking about is: it might be a good goal to design WASI WebSockets such that it's possible for componentize-js to implement the CloudFlare <a href=\"https://developers.cloudflare.com/durable-objects/learning/websockets/#websocket-hibernation\">Hibernatable WebSockets API</a>.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://developers.cloudflare.com/durable-objects/learning/websockets/#websocket-hibernation\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/d6f7f10121085d2f36c9eaedcc2c2791a2542d64\\/68747470733a2f2f646576656c6f706572732e636c6f7564666c6172652e636f6d2f6465762d70726f64756374732d707265766965772e706e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://developers.cloudflare.com/durable-objects/learning/websockets/#websocket-hibernation\" title=\"Durable Objects with WebSockets · Cloudflare Durable Objects docs\">Durable Objects with WebSockets · Cloudflare Durable Objects docs</a></div><div class=\"message_embed_description\">WebSockets allow real time communication between a client and server. Both Cloudflare Durable Objects and Workers can act as WebSocket endpoints – …</div></div></div>",
        "id": 411046968,
        "sender_full_name": "Luke Wagner",
        "timestamp": 1704301095
    },
    {
        "content": "<p>FWIW, I've created a proposal to add inbound, serverless-style support for WebSockets to Spin: <a href=\"https://github.com/fermyon/spin/pull/2212\">https://github.com/fermyon/spin/pull/2212</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/fermyon/spin/pull/2212\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/4cb0c3d33df41a6d94f0e260bbc8aba976223acf\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f663863616565653765373163663866623939383136373930636265353864653036663263353665623564343837343536333363333335383937326262356532662f6665726d796f6e2f7370696e2f70756c6c2f32323132)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/fermyon/spin/pull/2212\" title=\"SIP 016 - Inbound WebSocket Support by dicej · Pull Request #2212 · fermyon/spin\">SIP 016 - Inbound WebSocket Support by dicej · Pull Request #2212 · fermyon/spin</a></div><div class=\"message_embed_description\">Spin is the open source developer tool for building and running serverless applications powered by WebAssembly. - SIP 016 - Inbound WebSocket Support by dicej · Pull Request #2212 · fermyon/spin</div></div></div>",
        "id": 411452021,
        "sender_full_name": "Joel Dice",
        "timestamp": 1704499647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> would you like to propose <code>wasi:websockets</code> on WASI subgroup meeting this week? I'd love to get the momentum going.</p>",
        "id": 411801368,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1704741476
    },
    {
        "content": "<p>I'm a \"prototype-first\" kind of person, so I'd prefer to get something working first, fine-tune the interfaces in the process, and then propose the result as a standard.  IMHO, none of the wasi-cloud proposals so far gained much momentum until people started implementing them, so I expect that proposing the standard will not, itself, get momentum going.</p>",
        "id": 411802461,
        "sender_full_name": "Joel Dice",
        "timestamp": 1704741982
    },
    {
        "content": "<p>I certainly won't object if a \"proposal-first\" person wants to step up and get that started, though :)</p>",
        "id": 411803448,
        "sender_full_name": "Joel Dice",
        "timestamp": 1704742382
    },
    {
        "content": "<p>Looks like the proposal pr went in, curious if spin or others had any additional momentum on wasi websockets so far</p>",
        "id": 477288727,
        "sender_full_name": "Milan",
        "timestamp": 1729108129
    },
    {
        "content": "<p>Yeah, the SIP was merged, but no momentum since then.  I haven't been able to link it to a business opportunity or strategic objective yet, so haven't been able to justify working on a prototype or a WASI standard proposal.  I'd love to see someone pick that up if they're motivated.</p>",
        "id": 477289718,
        "sender_full_name": "Joel Dice",
        "timestamp": 1729108467
    },
    {
        "content": "<p>Speaking from wasmCloud, we're essentially in the same boat that Websockets came up as a neat use case, but didn't result in a direct need for someone on the open source side / business side</p>",
        "id": 477292169,
        "sender_full_name": "Brooks Townsend",
        "timestamp": 1729109435
    }
]