[
    {
        "content": "<p>Hey all; I just published a new blog post about how to build an async runtime for WASI 0.2 <a href=\"https://blog.yoshuawuyts.com/building-an-async-runtime-for-wasi/\">https://blog.yoshuawuyts.com/building-an-async-runtime-for-wasi/</a>. Figured this might be a useful reference for the Rust Async ecosystem to add support for WASI 0.2!</p>",
        "id": 424106638,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1709240166
    },
    {
        "content": "<p>The blog and the crate made the <code>Pollable</code> and the <code>poll</code> from WASI 0.2 very approachable. I thought I could understand it all except for a small comment in the code that you also said in the blog, that through careful reading one might find it silly that <code>awake</code> is being called since the WASI 0.2 is single threaded so it can only wake the one waker. </p>\n<p>Couldn't the WASI 0.2 host find multiple <code>Pollables</code>'s ready before returning from <code>poll</code>?</p>\n<p>Do you mean something more specific than the WASM module is single-threaded? Do you mean there could only be one outstanding '.wait' call at any given time in your runtime since there is no notion of <code>spawn</code>? I will admit I'm confused a bit by the ability for the <code>futures</code> crate to allow multiple Futures to be polled concurrently. I thought that would mean there could be multiple wakers present in your runtime but I also have the vague idea that a waker is tied to a runtime task? <span aria-label=\"man shrugging\" class=\"emoji emoji-1f937-200d-2642\" role=\"img\" title=\"man shrugging\">:man_shrugging:</span></p>",
        "id": 429887303,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1711553358
    },
    {
        "content": "<p>I <strong>really</strong>  like your last section that talks about why an executor isn't warranted. And reading through the comment in \"<a href=\"http://reactor.rs\">reactor.rs</a>\" again, you do explain it would be common for libraries to create their own wakers. So maybe I just let myself get confused because I am a novice but it didn't seem silly at all to be waking in a loop.</p>\n<p>The macros in <code>futures</code> and the traits in <code>futures_concurrency</code> make me wonder if a crate I have worked on that had relied on the <code>Tokio</code> <code>current_thread</code> runtime to be able to spawn local tasks could be written to be free of any actual runtime dependency.</p>",
        "id": 429908088,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1711559094
    },
    {
        "content": "<p>There can be multiple wakers even when single threaded. Some future combinators create their own wakers which allow the future combinator to know which sub futures it needs to poll again.</p>",
        "id": 429912389,
        "sender_full_name": "bjorn3",
        "timestamp": 1711560552
    }
]