[
    {
        "content": "<p>Hi, me <span class=\"user-mention\" data-user-id=\"513417\">@Marcin Kolny</span>  and <span class=\"user-mention\" data-user-id=\"619002\">@Enrico Loparco</span>  were discussing that usage of shared memory in WASI increases chances of crashes - if not enough memory was allocated upfront or too much memory was allocated upfront it can cause a crash.</p>\n<p>We discussed an idea of introducing virtual memory when shared memory is used:</p>\n<ol>\n<li>From WASM perspective memory looks linear, engine incapsulates mapping</li>\n<li>Already allocated block of memory doesn't get reallocated so all shared addresses are valid </li>\n<li>If there's not enough memory a new block gets allocated, so there's no crush in such case</li>\n<li>Should cause perf degradation when reading/writing memory written in 2 blocks</li>\n</ol>\n<p>It makes memory non-linear underneath so I wonder if there was a thread or discussion in WASM/WASI sometime ago about it. So far I found only <a href=\"https://github.com/WebAssembly/multi-memory/blob/main/proposals/multi-memory/Overview.md\">https://github.com/WebAssembly/multi-memory/blob/main/proposals/multi-memory/Overview.md</a> that can make usage of shared memory less limiting</p>\n<p><span class=\"user-mention\" data-user-id=\"415404\">@Wenyong Huang</span> <span class=\"user-mention\" data-user-id=\"254110\">@Andrew Brown</span> let me know what your thoughts on that</p>",
        "id": 405134128,
        "sender_full_name": "Georgii Rylov",
        "timestamp": 1701355959
    },
    {
        "content": "<p>The idea reminds me of the memory control proposal, though maybe at a different level: <a href=\"https://github.com/WebAssembly/memory-control/blob/main/proposals/memory-control/Overview.md\">https://github.com/WebAssembly/memory-control/blob/main/proposals/memory-control/Overview.md</a>. Is there a way that could be used to solve the problem you're raising?</p>",
        "id": 405202439,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1701378374
    },
    {
        "content": "<p>(Just to check: the problem you're describing does not have to do with linear memory C stacks managed by the toolchain?)</p>",
        "id": 405203041,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1701378504
    },
    {
        "content": "<p>Hey, thank you for the response Andrew</p>\n<blockquote>\n<p>does not have to do with linear memory C stacks managed by the toolchain?)</p>\n</blockquote>\n<p>It does not (in my understanding)</p>\n<blockquote>\n<p>Is there a way that could be used to solve the problem you're raising?</p>\n</blockquote>\n<p>I'm not sure. I guess this proposal would allow to release some memory if I read it right and that's not exactly what we're looking for. But would it allow to grow WASM memory even if shared memory is used? That is the main interest at the moment as max-memory is a very strict requirement</p>",
        "id": 410294696,
        "sender_full_name": "Georgii Rylov",
        "timestamp": 1703770732
    }
]