[
    {
        "content": "<p>I have some components that use the <code>wasi:http</code> shim to make network calls. I initially assumed these would be totally blocking, but when looking through the <code>@bytecodealliance/preview2-shim</code> code I noticed the <code>lib/io/worker-*</code> files that seem to imply some of the <code>wasi:*</code> backed IO is happening in a <code>Worker</code> and is not blocking. </p>\n<p>Curious if this is all piped in with <code>jco</code>'s functionality by default or if I would need to do some special configuration to use the <code>worker-*</code> versions of the shims? I've been exploring instantiating/calling my components in a <code>Worker</code> thread to avoid blocking, but if it is already non-blocking that would be great!</p>",
        "id": 417329180,
        "sender_full_name": "Landon James",
        "timestamp": 1705963502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"678052\">@Landon James</span> yes we have a \"non-blocking\" polls implementation but this is only currently supported in Node.js. Supporting the browser is the next priority now that this implementation has been completed, but that work will be a little while still.</p>",
        "id": 417330893,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1705964099
    },
    {
        "content": "<p>Ahh great to hear, I am only looking to support Node at the moment. Do I need to do anything to enable that? I see that the <code>nodejs/http.js</code> implementation is only pulling in the <code>worker-io</code> stuff at the moment, so not sure if that is fully non-blocking yet? Happy to contribute some work here once I figure out what needs to be done since this would be more helpful than wrapping all my own stuff in <code>Worker</code>s.</p>",
        "id": 417332574,
        "sender_full_name": "Landon James",
        "timestamp": 1705964757
    },
    {
        "content": "<p>oh, yeah it should all work out in Node.js if you use the default transpile options - http is fully supported</p>",
        "id": 417335574,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1705966227
    }
]