[
    {
        "content": "<p>Hey I sat down with <span class=\"user-mention\" data-user-id=\"653616\">@Wassim Chegham</span> today to ask him some questions about how TypeScript, and some of the mappings we were doing. And it seems there might be some differences between what our TypeScript type generator is generating - and the code we actually want to be writing.</p>",
        "id": 401429873,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1699645581
    },
    {
        "content": "<p>I think what we walked away from was with some questions. To speak for myself, I'm wondering:</p>\n<ul>\n<li>What is the right mapping of WIT -&gt; JS?</li>\n<li>What are the consequences of TypeScript types and JS implementations diverging?</li>\n<li>How would we like to proceed here?</li>\n</ul>",
        "id": 401430145,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1699645762
    },
    {
        "content": "<p>I think one thing we probably want to do is write down the mapping we perform from WIT -&gt; TypeScript in our docs. But separately from that we should evaluate how we want to proceed here in the short term.</p>",
        "id": 401430305,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1699645849
    },
    {
        "content": "<p>(No need to answer this now; it's more to make sure I've raised this ahead of Monday's meeting; that way we get to perhaps think about this a little)</p>",
        "id": 401430385,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1699645921
    },
    {
        "content": "<p>also, I would like to know:</p>\n<ol>\n<li>what is the purpose of these TS definition files? Are they used/imported somewhere? </li>\n<li>in addition (or instead of) these TS definition files, can we directly generate an \"empty\" JavaScript implementation out of these WIT files.</li>\n</ol>\n<p><em>(we can chat about this during our next call)</em></p>",
        "id": 401449263,
        "sender_full_name": "Wassim Chegham",
        "timestamp": 1699659599
    },
    {
        "content": "<p>The current TS bindgen for the preview2-shim project is just the same bindgen as if WASI was implemented as a component itself. But WASI isn't implemented as a single component - instead we split its implementation across multiple modules for each subsystem. Therefore there is a difference between what we generate and the actual package type of the preview2-shim project. Bridging that difference with a wrapper TS file to reexport the right types would be great to see!</p>",
        "id": 401582210,
        "sender_full_name": "Guy Bedford",
        "timestamp": 1699768362
    }
]