[
    {
        "content": "<p>I have a general question regarding wasmtime. Can I call a funtion by its index in the function section in the wasm module file?</p>",
        "id": 320142235,
        "sender_full_name": "Wilson Wang",
        "timestamp": 1673232775
    },
    {
        "content": "<p>AFAIK there is no such option. You have to either look up by name or iterate the exports list (which contains all kinds of exports, not just functions).</p>",
        "id": 320239028,
        "sender_full_name": "bjorn3",
        "timestamp": 1673274138
    },
    {
        "content": "<p>the reason I am asking this is because I want wasmtime host side to call a wasm function which it got from a host call. So in this case, this function is an index into the function section. It can be a function not exported.</p>",
        "id": 320287353,
        "sender_full_name": "Wilson Wang",
        "timestamp": 1673286511
    },
    {
        "content": "<p>in a situation like that you're probably getting a table index for the function, not the actual wasm-binary-encoding function index for the function, so the module will need to export its function table and you can acquire a <code>Func</code> through that</p>",
        "id": 320288391,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1673286802
    },
    {
        "content": "<p>thanks alex, do you have some online document about this?</p>",
        "id": 320288798,
        "sender_full_name": "Wilson Wang",
        "timestamp": 1673286915
    },
    {
        "content": "<p>I do not, sorry</p>",
        "id": 320288877,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1673286935
    },
    {
        "content": "<p>np thanks</p>",
        "id": 320288936,
        "sender_full_name": "Wilson Wang",
        "timestamp": 1673286953
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"573646\">Wilson Wang</span> has marked this topic as resolved.</p>",
        "id": 320531725,
        "sender_full_name": "Notification Bot",
        "timestamp": 1673379987
    },
    {
        "content": "<p>If I can add something although the topic is closed. I don't think it makes logical sense to call a function by index because that function may not be exported. This is probably not specified by the standard since all bets are off during host calls, but it may break some implicit logical contracts between the module and its embedder. What you probably want to do instead is export an \"apply\" function (actually a family of such function, one per different function type) that takes a function index (in the table) of the correct type and the function arguments and apply them to the function. This would essentially just be some call_indirect wrapper. Because you can derive the exported function name from the function type you want to call, you don't have any problem using the usual exported function API. You would simply call this function with the index you got during a previous host call (which is the index into the table, not the index of the function) followed by the arguments the function expects. This is cleaner and actually simpler to implement than trying to call functions by index.</p>",
        "id": 320536603,
        "sender_full_name": "Julien Cretin (ia0)",
        "timestamp": 1673381682
    },
    {
        "content": "<p>thanks for the reply. I am actually thinking if it is possible to update the wasm spec to support de/serializing the function and call it from a remote runtime. Just like python using pickle to de/serialize function/class.</p>",
        "id": 320580699,
        "sender_full_name": "Wilson Wang",
        "timestamp": 1673403602
    }
]