[
    {
        "content": "<p>I am trying to figure out bindings for an immediate mode gui api (eg: imgui), and it uses a lot of repr(C) abi stable types. Some simple examples are glam types like <code>Vec2</code>, <code>Vec3</code>, <code>Vec4</code>, <code>Rect</code>, <code>Rgba</code> etc..</p>\n<p>If the guest queries a <code>Rect</code> of the current viewport, the host fn can take a guest provided pointer (<code>i32</code>), and write to it an repr C Rect struct using  memory from <code>Caller</code> arg. I assume the bottleneck here is getting memory from caller as it needs to look up \"memory\" from exports every single time this fn is called. </p>\n<p>I see that component model finally released experimental support (yay), which supports Record types. From what i remember, records from bindings will be generated as native structs. But idk if they will be directly written to wasm's memory when host passes a type to guest, or if there is some other background bookkeeping going on which will be a bottleneck now. </p>\n<p>I was hoping someone could tell me what the ideal way of creating ffi bindings would be, so that plugins can call into my immediate mode gui api with minimal performance impact (as this calls will happen every frame, for tens of plugins).</p>",
        "id": 395925272,
        "sender_full_name": "code red art",
        "timestamp": 1696957611
    },
    {
        "content": "<p>a component model Rect would be like</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"n\">record</span><span class=\"w\"> </span><span class=\"n\">rect</span><span class=\"w\"> </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"n\">top_left_x</span>: <span class=\"kt\">f32</span><span class=\"p\">,</span>\n<span class=\"w\">    </span><span class=\"n\">top_left_y</span>: <span class=\"kt\">f32</span><span class=\"p\">,</span>\n<span class=\"w\">    </span><span class=\"n\">width</span>: <span class=\"kt\">f32</span><span class=\"p\">,</span>\n<span class=\"w\">    </span><span class=\"n\">height</span>: <span class=\"kt\">f32</span><span class=\"p\">,</span>\n<span class=\"w\">  </span><span class=\"p\">}</span>\n</code></pre></div>",
        "id": 395927562,
        "sender_full_name": "code red art",
        "timestamp": 1696958534
    },
    {
        "content": "<p>When using bindings generation transferring a value like rect happens automatically and the bindings take care of the abi details. In that sense yes they will write to memory for you.</p>\n<p>Bindings generation does not currently support a \"bring your own types\" mode however so you would need to write a conversion from the component types to your preexisting types. LLVM is likely to optimize this away if they have the same structure, and if you really want you can lay out the component struct the same way and unsafely transmute the pointer to avoid conversion</p>",
        "id": 395930052,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1696959664
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"511207\">code red art</span> has marked this topic as resolved.</p>",
        "id": 395940766,
        "sender_full_name": "Notification Bot",
        "timestamp": 1696963275
    }
]