[
    {
        "content": "<p>Maybe everyone here knows this. I built a wasmtime from the main branch of the repo and found it could not parse Wasm components that were built with the 0.11.0 cargo-component. The error reported was <code>Serde Deserialization Error</code>. But building cargo-component from its main branch and rebuilding the individual components, before they were composed with wasm-tools, and then given to <code>wasmtime</code> fixed things. </p>\n<p>I guess there is no binary version of the components at the moment, while things are so fluid? And of course nowhere does it say that building from main in one crate should just work with binaries being built by other crates.</p>",
        "id": 437897650,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715294379
    },
    {
        "content": "<p>You might have actually discovered a bug I think? The binary format for components should be stable for ~1year now at this point so this isn't an expected compatibility error. Would you be able to dig in a bit more and report an issue with your findings?</p>",
        "id": 437897892,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1715294513
    },
    {
        "content": "<p>the trampolines PR that landed recently doesn't change the serialized format, but does change which entries are present in it. just thinking out loud here, not sure if that would be related to what you're observing here</p>",
        "id": 437898021,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1715294592
    },
    {
        "content": "<p>You mean you want me to build the components with 0.11.0 and also with cargo-component out of the tree and see what is different at the binary level?</p>\n<p>The reproducer is super easy. I have not yet made a repo out of it, but it is the <code>composition</code> example that was submitted as a PR to the <code>component-docs</code> repo. It's all very vanilla but since I have a build script that builds the components, then runs the compose steps and then runs wasmtime on the results, it's easy to  kick every time something about the tool chain is updated.</p>",
        "id": 437898198,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715294716
    },
    {
        "content": "<p>Oh I should clarify, it's definitely the case that a version of wasmtime cannot load AOT-compiled components from a different version of wasmtime. If you're dealing with raw wasm from cargo-component, though, that should be stable</p>",
        "id": 437898213,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1715294728
    },
    {
        "content": "<p>Ah well reporting an issue is up to you, if it's difficult to reduce that's ok too. Mostly wanted to flag though that incompatibilities in the binary format of wasm are not expected at this time, so if that's what's happening that's unexpected</p>",
        "id": 437898326,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1715294784
    },
    {
        "content": "<p>That is correct, I'm not compiling to machine code ahead of time. Just the *.wasm that cargo-component can build.</p>\n<p>I bet someone gets an idea what caused this before tomorrow. If not, I'll dig into it somehow, but digging into bytealliance tools is one thing, but understanding why a serde deserialize step is reporting an error is something else. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 437898572,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715294907
    },
    {
        "content": "<p>oh it's also ok to not reduce it too too much, if you've got instructions we can try to dig in further from there</p>",
        "id": 437898670,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1715294967
    },
    {
        "content": "<p>Are there convenient places I can pick up the cargo-component binaries from the published 0.11.0 and then from main/HEAD? So I can build a reproducer that shows working and not working with binaries that everyone else could get too?</p>",
        "id": 437898826,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715295031
    },
    {
        "content": "<p>would the <a href=\"https://github.com/bytecodealliance/cargo-component/releases\">releases page</a> suffice?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/cargo-component/releases\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/ab2fe5fa7e19c997ae5f007c4dbd13a1180f0508/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f653038383433623062393463663435336462396337313432643135663262303935393666353737343337336339653835646239656138633134613339376562362f62797465636f6465616c6c69616e63652f636172676f2d636f6d706f6e656e74&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/cargo-component/releases\" title=\"Releases · bytecodealliance/cargo-component\">Releases · bytecodealliance/cargo-component</a></div><div class=\"message_embed_description\">A Cargo subcommand for creating WebAssembly components based on the component model proposal. - bytecodealliance/cargo-component</div></div></div>",
        "id": 437898923,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1715295105
    },
    {
        "content": "<p>If not, I guess the reproducer script can checkout the old version, built it locally, then checkout the new version in another directory, build it locally, and then run the apples to apples test. No prob. </p>\n<p>But if I ran into it with my first try, I bet others will before tomorrow too. Anyway, I'm happy to do it tomorrow.</p>",
        "id": 437899111,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715295231
    },
    {
        "content": "<p>To spare anyone from trying what I said and not seeing it fail. </p>\n<p>When I rebuilt the Wasm components with the binary from the 0.11.0 release (for x86_64 Darwin), it just worked. That was irksome. At least I still had copies of the Wasm binaries that didn't pass Serde Deserialization I thought.</p>\n<p>I tried a few more things and then I remembered having rebuilt cargo-component with the --forced flag yesterday and voila! The built Wasm binaries against didn't pass muster with the latest wasmtime.</p>\n<p>I will package this up tomorrow and get back to you.</p>",
        "id": 437902498,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715297526
    },
    {
        "content": "<p>I may have to leave this problem unresolved, but it was a very temporary one.</p>\n<p>I have three pieces of new information but they aren't particularly helpful.</p>\n<p>The first is even though the wasmtime that had had the serdes deserialization error was one I built from source, I was unable to recompile the wasmtime from the same directory and have it fail again. I had the earlier binary though so I could still use it to see the failure happen for other a/b tests. I tried rebuilding from the same git commit and those around it (and saw the same git hash in the reported version from the two I expected to match).</p>\n<p>The second is even if I used the wasmtime binary that would report the serdes deserialize error for a given command.wasm file, I was unable to rebuild the command.wasm file from parts and have the new version fail. But I had the earlier command.wasm so I could always test with that too.</p>\n<p>And third, I could take the wasmtime that would produce the failure along with the command.wasm that was needed for the failure, and run the wasmtime on the <code>wat</code> version of the <code>wasm</code> file, and that did <em>not</em> produce the error. So just converting the failing wasm file to a wat file allowed the wasmtime that does fail on the wasm file to succeed on the wat file.</p>\n<p>I built the <code>wat</code> file by running <code>wasm-tools print command.wasm</code>. I don't know of a command that would go the other way, rebuild the wasm file from the wat file, so was unable to see if a rebuilt wasm would work or not work.</p>\n<p>I thought I could diff the wat version of the failing command.wasm with the wat version of a passing command.wasm, but the only diff was the version string of the cargo-component in the various <code>producers</code> sections of the component files. But as both forms of wat file actually passed, I didn't know how to draw any conclusions from those differences.</p>\n<p>I am attributing the difference to one of three things, the updated rust toolchain from one day to another, the updates to <a href=\"http://crates.io\">crates.io</a> for dependencies used in the build, or my forgetting something else about the build settings or the checked out branch that I built with.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"http://crates.io\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/75f8c66509c680a2345cca9b6adaf7e2cdb6f41b/68747470733a2f2f6372617465732e696f2f6173736574732f6f672d696d6167652e706e67&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"http://crates.io\" title=\"crates.io: Rust Package Registry\">crates.io: Rust Package Registry</a></div></div></div>",
        "id": 438179998,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1715515112
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"704709\">Frank Rehwinkel</span> has marked this topic as resolved.</p>",
        "id": 438225505,
        "sender_full_name": "Notification Bot",
        "timestamp": 1715562642
    }
]