[
    {
        "content": "<p>Hi folks,</p>\n<p>This is my first time on Zulip, so sorry in advance if I'm doing it wrong. :)</p>\n<p>I have a bunch of questions about fuel and async execution in Wasmtime.</p>\n<ol>\n<li>\n<p>Is async execution via <a href=\"https://docs.rs/wasmtime/0.33.0/wasmtime/struct.Config.html#method.async_support\">Config::async_support</a> the only way to interrupt execution of Wasm code and then later resume it? I'm aware of <a href=\"https://docs.rs/wasmtime/0.33.0/wasmtime/struct.Store.html#method.out_of_fuel_trap\">Store::out_of_fuel_trap</a> but if I'm reading it right it is not suitable for preemptive concurrency because it aborts the computation rather than suspending it. If async execution is not the only way, is it at least the recommended way?</p>\n</li>\n<li>\n<p>Is async execution the only way to have concurrently executing Wasm using the same <code>Store</code>? If not, is it at least the recommended way?</p>\n</li>\n<li>\n<p>How does <a href=\"https://docs.rs/wasmtime/0.33.0/wasmtime/struct.Config.html#method.consume_fuel\">fuel consumption</a> actually work? Is it based on some processor feature that allows efficiently interrupting based on some counter that the CPU manages itself, or is it completely synthesized by decrement instructions peppered throughout the compiled code by Wasmtime? What things actually consume fuel — i.e. is it wall time, CPU time, instructions executed, or something else? If the Wasm code sleeps for a long time, does that consume much fuel? What happens with host functions — are they assumed by default to be effectively \"instant\"?</p>\n</li>\n</ol>\n<p>I've been tinkering with Wasmtime and have just gotten to the point where I really need to start thinking about the overall architecture of my program. So I'd like to know what I'm getting myself with sync vs async execution modes.</p>\n<p>Many thanks in advance for any guidance! And let me know if you think the answers to some of these questions would be worth rolling into the docs and I can try my hand at a PR for that.</p>\n<p><span aria-label=\"sparkling heart\" class=\"emoji emoji-1f496\" role=\"img\" title=\"sparkling heart\">:sparkling_heart:</span></p>",
        "id": 267564865,
        "sender_full_name": "Jeff Parsons",
        "timestamp": 1641898457
    },
    {
        "content": "<p>Fuel was implemented in <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2611\">https://github.com/bytecodealliance/wasmtime/pull/2611</a>. You may want to read that PR.</p>\n<blockquote>\n<p>or is it completely synthesized by decrement instructions peppered throughout the compiled code by Wasmtime?</p>\n</blockquote>\n<p>This is the way it is implemented.</p>\n<blockquote>\n<p>What things actually consume fuel — i.e. is it wall time, CPU time, instructions executed, or something else?</p>\n</blockquote>\n<p>Except for a couple of special instructions each wasm instruction consumes one unit of fuel. That is the only deterministic quantity across multiple executions on the same or different cpus and between different versions of wasmtime.</p>\n<blockquote>\n<p>If the Wasm code sleeps for a long time, does that consume much fuel? What happens with host functions — are they assumed by default to be effectively \"instant\"?</p>\n</blockquote>\n<p>AFAIK host functions need to manually consume fuel, or else they will only consume a single unit of fuel from the call wasm instruction.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/2611\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/2dd096977e044aea5a31c708b2b5c44ee388f055\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f313961393733616638613537323133396562636631363939313666373835383636613237383636393836316136303566663234663434663533336536393032612f62797465636f6465616c6c69616e63652f7761736d74696d652f70756c6c2f32363131)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/2611\" title=\"Implement limiting WebAssembly execution with fuel by alexcrichton · Pull Request #2611 · bytecodealliance/wasmtime\">Implement limiting WebAssembly execution with fuel by alexcrichton · Pull Request #2611 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">This PR lifts a feature from Lucet to wasmtime where generated code can count instructions or account for &quot;fuel&quot; during execution. The purpose of this feature is similar to the interrupt ...</div></div></div>",
        "id": 267576976,
        "sender_full_name": "bjorn3",
        "timestamp": 1641905980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"470250\">@Jeff Parsons</span> you're correct in that <code>async_support</code> is the only way in Wasmtime to interrupt execution and resume it. The current APIs and implementation don't actually allow concurrent execution within the same <code>Store</code> because the <code>Store</code> is borrowed for the entire duration of the call. Concurrenly executing wasm is quite tricky and typically needs guest cooperation as well so supporting this natively in Wasmtime is unlikely to happen in the near future (unless something major changes I guess?)</p>\n<p>For fuel consumption it's implemented as roughly each instruction consuming one unit of fuel. Loop and function headers check if there is no more fuel and take an action on the lack of fuel. This is all implemented with code instrumentation in the generated Cranelift code. If a host function blocks indefinitely then that will block the wasm indefinitely, it's up to the embedder to make sure host functions \"behave well\" in the sense of not exceeding the budget of the guest.</p>",
        "id": 267634402,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1641930135
    },
    {
        "content": "<p>Many thanks to both of you, <span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> and <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span>. I think I understand how all of this fits together a lot better now. (And that PR was a lot easier to read than I expected, for something that I was imagining to be very esoteric!)</p>",
        "id": 267853991,
        "sender_full_name": "Jeff Parsons",
        "timestamp": 1642072213
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"470250\">Jeff Parsons</span> has marked this topic as resolved.</p>",
        "id": 269095256,
        "sender_full_name": "Notification Bot",
        "timestamp": 1643025771
    }
]