[
    {
        "content": "<p>Hello - I have noticed that FiberStack uses mmap to allocate memory, in general the application I'm embedding wasmtime in allocates most of the system memory upfront for various reasons. Would there be any opposition to a custom allocator for these stacks?</p>",
        "id": 395709016,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1696860937
    },
    {
        "content": "<p>Although it looks like windows does something...different. I've never had the privilege to work on windows, but it looks like the async_stack_size config option is ignored on windows anyways, so presumably it'd be fine if this API was unused on windows too?</p>",
        "id": 395709749,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1696861145
    },
    {
        "content": "<p>I think that'd be reasonable, yeah, and yes it's ok to basically ignore windows for fibers because we are required to use certain APIs on Windows for fibers with no alternatives, so mmap and customization can only be applied on non-windows</p>",
        "id": 395713255,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1696862203
    },
    {
        "content": "<p>Cool - have any thoughts on an API? Otherwise I can take a stab at this and point a proposal here (or should I open an issue for this?)</p>",
        "id": 395713680,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1696862348
    },
    {
        "content": "<p>Feel free to give it a stab and/or open an issue! I've not thought about this myself, but it'd probably look similar-ish to the <code>MemoryCreator</code> type</p>",
        "id": 395716297,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1696863095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"610749\">Tyler Rockwood</span> has marked this topic as resolved.</p>",
        "id": 395737453,
        "sender_full_name": "Notification Bot",
        "timestamp": 1696870830
    }
]