[
    {
        "content": "<p>Hello! I'm looking at running wasmtime within <a href=\"https://seastar.io\">seastar</a>. A big concern for me as an embedder is controlling CPU + Memory usage of Wasm functions that run. Async support has everything I need for CPU throttling with gas meter yielding, but memory usage is tricker. Seastar allocates all memory at application start and divides it up per core, then each core has it's own <a href=\"https://en.wikipedia.org/wiki/Buddy_memory_allocation\">buddy allocator</a>. As the processes runs this memory space can become quite fragmented, and there are situations where there is not a contiguous chunk of  of couple MB available (even if there are GBs of memory available on the system). How difficult would be to add support for disjoint sets of pages to map to a single Wasm memory? I'm thinking you'd need a page table like component.</p>",
        "id": 351082272,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1681917996
    },
    {
        "content": "<p>My guess would be that adding this would be a significant project and likely have a large perf impact. If you're working on a system with virtual memory though you may be able to achieve the same results using the limiter built-in to stores</p>",
        "id": 351083484,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1681918239
    },
    {
        "content": "<p>For example if wasm wants 1M of memory you could allocate that from the system allocator but not use it. The rss would be the same and you'd just have resident memory elsewhere</p>",
        "id": 351083718,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1681918289
    },
    {
        "content": "<p>As a proxy for performance impact, the \"softmmu\" page table emulation in qemu might give some idea of the impact this would have. <a href=\"https://dl.acm.org/doi/10.1145/2686034\">This paper</a> claims qemu's softmmu is 38% of emulation time, even with TLB implemented in software. I'd second the suggestion to find a way to use virtual memory if at all possible!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://dl.acm.org/doi/10.1145/2686034\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/665014dad437352af4b1fb61ef3a6896c0de744f\\/68747470733a2f2f646c2e61636d2e6f72672f636d732f61737365742f34373832643838612d343663622d343934312d386136612d3462336462663361626532662f323639353538332e636f7665722e6a7067)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://dl.acm.org/doi/10.1145/2686034\" title=\"Optimizing Memory Translation Emulation in Full System Emulators | ACM Transactions on Architecture and Code Optimization\">Optimizing Memory Translation Emulation in Full System Emulators | ACM Transactions on Architecture and Code Optimization</a></div><div class=\"message_embed_description\">\n\t\tThe emulation speed of a full system emulator (FSE) determines its usefulness. This\nwork quantitatively measures where time is spent in QEMU [Bellard 2005], an industrial-strength\nFSE. The analysis finds that memory emulation is one of the most heavily ...</div></div></div>",
        "id": 351088543,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1681919317
    },
    {
        "content": "<p>I'm not sure of the details but does Wasmtime's pooling allocator help here?</p>",
        "id": 351094468,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1681920618
    },
    {
        "content": "<p>Thanks for the suggestions (and the paper link!) - very helpful. There are ways around to use the system alloc (and virtual memory) and seems like that would be a better path forward.</p>\n<p>Preallocating memory on startup and pooling it <strong>is</strong> an option, but a very limiting one for a various number of reasons (which I'm happy to expand on if you're interested).</p>",
        "id": 351108783,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1681924271
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"610749\">Tyler Rockwood</span> has marked this topic as resolved.</p>",
        "id": 351181168,
        "sender_full_name": "Notification Bot",
        "timestamp": 1681957817
    }
]