[
    {
        "content": "<p>Hi there! I'm using <code>wit-bindgen</code> to define host functions that are called by my guest code. At present, I'm calling my guest code through a function <code>fn runtime_exec()</code>; however, I'd like to pass some structured data to that function for the guest runtime to do something with.</p>\n<p>The way I'm thinking of doing this is serializing my data with bincode, and deserializing it on the guest side. However, to do this, I need a way to call the function with the serialized data as a byte-array; I'm not entirely sure how to do this, and I was studying what <code>wit-bindgen</code> generates, but I don't see where the guest memory address comes from.</p>\n<p>To summarise my query: I'd like to define <code>fn runtime_exec(data: &amp;[u8])</code> (or similar on the guest side), and call that from the host side with a byte array (some serialized data). What would be the easiest way to do this?</p>",
        "id": 308494270,
        "sender_full_name": "Philpax",
        "timestamp": 1667864500
    },
    {
        "content": "<p>In the same way that the host functions are modeled with <code>*.wit</code> the general intention is that you model guest functions the same way, so instead of needing bincode you could do something like <code>runtime-exec: func(your: u32, structured: data)</code> which would automatically generate bindings for the host as well to pass in structured data</p>",
        "id": 308498526,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1667866997
    },
    {
        "content": "<p>if you need to model using <code>bincode</code>, though, you can do <code>runtime-exec: func(data: list&lt;u8&gt;)</code></p>",
        "id": 308498562,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1667867037
    },
    {
        "content": "<p>Ah, I'd completely forgotten that was a viable option! I'd ruled out defining guest functions because my version of wit-bindgen doesn't have a way to share definitions between wit files, but as I only need a bytearray here that's fine. (Can't use structured definitions anyway as the data is somewhat freeform and varies between guests)</p>\n<p>I'm running into some other issues, but at least I have a way forward. Thanks for the pointer! <span aria-label=\"bow\" class=\"emoji emoji-1f647\" role=\"img\" title=\"bow\">:bow:</span></p>",
        "id": 308682441,
        "sender_full_name": "Philpax",
        "timestamp": 1667945343
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515290\">Philpax</span> has marked this topic as resolved.</p>",
        "id": 308682445,
        "sender_full_name": "Notification Bot",
        "timestamp": 1667945346
    }
]