[
    {
        "content": "<p>Hey there,<br>\nI'm experimenting with wasmtime to dynamically call modules based on an event stream in Rust.<br>\nMy events come in async and get handled in parallel wherever possible.<br>\nUntil just now I had a single store per module and just tried to wire that up but am running into the Store not being threadsafe.</p>\n<p>What's the best practice here? Is it intended that I make a store per invocation of my event handler (inside my WIT component) or is there a way for me to share things. What's the most efficient way of dealing with module instances?</p>",
        "id": 471802508,
        "sender_full_name": "Kevin Wiesmüller",
        "timestamp": 1726857004
    },
    {
        "content": "<p>Efficiency here is sort of second to the desired runtime semantics of what you want. For example do you want two events over time to be able to go to the same instance? If so you're required to use the same <code>Store</code> for that, but if not then the two events won't be able to have state persisted between them (since the two wasm instances won't share state). Depending on your use case one might be more appropriate than another.</p>\n<p>If you go the instance-per-event route though that's well supported in the sense that a <code>Store&lt;T&gt;</code> should be cheap to create and through <code>InstancePre&lt;T&gt;</code> you can quickly create a module instance</p>",
        "id": 471803146,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1726857191
    },
    {
        "content": "<p>I see. Let me give the instance-per-event a try as indeed any call to my modules should be hermetic.</p>",
        "id": 471807812,
        "sender_full_name": "Kevin Wiesmüller",
        "timestamp": 1726858245
    },
    {
        "content": "<p>You do still have the option of persisting state in that scenario but it'll have to be done on the host instead of the module itself. Something like a key/value store that each instance gets access to or something like that (figured I'd mention)</p>",
        "id": 471808237,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1726858381
    }
]