[
    {
        "content": "<p>Hi! Just a quick question: Is it fine to cache an <code>InstancePre</code> over multiple invocations, potentially being invoked by different users?<br>\nSince this is pre passing in the store, I assume it just allows us to cache the compilation/linking step, but if there are any caveats or things to be aware of why I <em>wouldn't</em> want to do this, I'd appreciate it. Thanks!</p>",
        "id": 472649146,
        "sender_full_name": "Ben Brandt",
        "timestamp": 1727255652
    },
    {
        "content": "<p>Yes, that is it't intended use case.</p>",
        "id": 472660956,
        "sender_full_name": "bjorn3",
        "timestamp": 1727259626
    },
    {
        "content": "<blockquote>\n<p>Since this is pre passing in the store</p>\n</blockquote>\n<p>According to the docs:</p>\n<blockquote>\n<p>Note that an <code>InstancePre</code> may not be tied to any particular <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Store.html\"><code>Store</code></a> if none of the imports it closed over are tied to any particular <a href=\"https://docs.rs/wasmtime/latest/wasmtime/struct.Store.html\"><code>Store</code></a>.</p>\n</blockquote>",
        "id": 472660993,
        "sender_full_name": "bjorn3",
        "timestamp": 1727259641
    },
    {
        "content": "<p>Perfect thanks! If there is any code that happens at initialization, would this still happen then once it is actually turned into an <code>Instance</code>? Again, I assume so, but don't want to be making any false assumptions. Thanks again for the quick response</p>",
        "id": 472664184,
        "sender_full_name": "Ben Brandt",
        "timestamp": 1727260677
    },
    {
        "content": "<p><code>InstancePre</code> doesn't run or cache the results of any wasm code; it mostly just early-binds imports and massages a few data structures, so that we don't have to do things like string-based import look ups at instantiation time</p>",
        "id": 472704535,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1727272814
    },
    {
        "content": "<p>Perfect, thanks!</p>",
        "id": 472709753,
        "sender_full_name": "Ben Brandt",
        "timestamp": 1727274226
    }
]