[
    {
        "content": "<p>Silly Q, but my boss made me ask it anyway :)</p>\n<p>If i take 2 component models, A and B, A depeneds on B, they don't have any other dependancies, and link them together into module C, where C doesn't have any WIT style exports, just regualar exports, can I convert that wasm into an old Core Wasm, I'm assuming the answer is no here, I think its because:</p>\n<ol>\n<li>There will be 2 core modules in C, which are A and B</li>\n<li>A and B inside C have its own memorys</li>\n<li>Other reasons I'd like to know about</li>\n</ol>\n<p>thanks</p>",
        "id": 407467284,
        "sender_full_name": "Mirror Mystic",
        "timestamp": 1702385037
    },
    {
        "content": "<p>The terminology you're asking with is somewhat imprecise and it's making it difficult to answer from my perspective, so before I go much further answering this I want to help confirm/clarify some terminology you're using:</p>\n<ul>\n<li>\"If i take 2 component models, A and B\" - I believe you're referring to components here as opposed to \"component models\". A component is a <code>*.wasm</code> binary whereas the component model is the name of the whole proposal to WebAssembly.</li>\n<li>\"and link them together into module C, where C doesn't have any WIT style exports, just regualar exports\" - if C is a core WebAssembly <code>*.wasm</code> then there's no defined way to link a component to a core wasm module. This would require engaging other possible conventions/idioms/tools, so it's not clear to me what this operation would be. I'm also assuming \"regular exports\" here in this case are exported functions from core wasm using integers and such.</li>\n<li>\"can I convert that wasm into an old Core Wasm\" - if you set aside the \"well core wasm is turing complete\" argument then, no, there's no general way to decompile a component into core wasm at this time. That would require a relatively fancy tool which doesn't currently exist.</li>\n</ul>",
        "id": 407499165,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1702393898
    },
    {
        "content": "<p>So I think overall the answer is \"no\", but moreso because there's a mismatch in what you're trying to do in terms of components and core wasms</p>",
        "id": 407499293,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1702393930
    }
]