[
    {
        "content": "<p>I read through the documentation of the current component model implementation in wasmtime. Is it somehow possible to access a components imports? I did not figure out a way on how to do it. For module there it is possible by calling .imports on a module. A component, does not provide this method. Was there any reason behind doing that? I tried to use modules for my implementation, but I realised I needed interface types and I am somewhat dissappointed that I cant access a components imports like a modules imports.</p>",
        "id": 362515491,
        "sender_full_name": "Michael V.",
        "timestamp": 1685551948
    },
    {
        "content": "<p>Just not yet implemented I believe: <a href=\"https://github.com/bytecodealliance/wasmtime/issues/4593\">https://github.com/bytecodealliance/wasmtime/issues/4593</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/issues/4593\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/20638085195640e75bf451cd275249fde9a96d1c\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f393562376164666639336138623266653533303461353864363633343930323532646336643737383532323333616464393136333765623132393237613762302f62797465636f6465616c6c69616e63652f7761736d74696d652f6973737565732f34353933)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/issues/4593\" title=\"components: Implement type reflection for component imports/exports 路 Issue #4593 路 bytecodealliance/wasmtime\">components: Implement type reflection for component imports/exports 路 Issue #4593 路 bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Similar to Module::{imports,exports} it should be possible to call Component::{imports,exports} and inspect, at runtime, the types used within a component.</div></div></div>",
        "id": 362522881,
        "sender_full_name": "Lann Martin",
        "timestamp": 1685553602
    },
    {
        "content": "<p>thats correct, it is not implemented currently. You can provide component imports via a component::Linker, but there is no way to access them.</p>",
        "id": 362532009,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1685555779
    },
    {
        "content": "<p>We will get around to implementing it at some point but right now it isnt high on our priorities. If you can share your use case, that could help motivate moving it up in priority</p>",
        "id": 362532264,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1685555844
    },
    {
        "content": "<p>Thank you for your answers. I dont think that my use case is too interesting for you. I am writing my master thesis in the field of embedded distributed computing. So I will basically work full time on this for the next 7-8 months on this topic. I thought about using webassembly and tried to understand webassembly by reading parts of the specifications and some papers about it. I recently started using wasmtime and I thought it seems perfect, but realised, that  I would need the interface types from the component model. I would also consider contributing to wasmtime / changing some code, but right now I feel like this is somewhat out of scope and I would have to try again in the future. It would be nice if someone of you could give their opinion about the feasability of it.<br>\nJust some more thoughts about the plan in my head: Distributed computing should be as easy as possible. Exporting a function makes the host register it to one main node that manages the control flow. The main node can simply call any function and use their return values. Instead of sending large structures (interface types like lists or records), the hosts would usually just send \"references\" to these types such that these values can be used to do other function calls. If a host does require such a reference for computation, it would pull the data from the owner and provide it to the wasm runtime. So the main work for distributed computing is done in the hosts while the code that is compiled to wasm does not need to worry too much about distributed computing.</p>\n<p>Sorry that the message got that long. I got kind of hyped the last week about wasm, but at the end I just hit a wall when I realised interface types are not yet widly supported. So can someone confirm: What I thought is likely pretty hard to implement right now, correct? :/ Maybe I could work on it in the future as a side project.</p>",
        "id": 362569692,
        "sender_full_name": "Michael V.",
        "timestamp": 1685566353
    },
    {
        "content": "<p>I hope what I wrote was not too confusing.</p>",
        "id": 362569777,
        "sender_full_name": "Michael V.",
        "timestamp": 1685566388
    },
    {
        "content": "<p>ok. that seems like the sort of thing you could accomplish with wasmtime and the component model, yes. afaik, there are only two host implementations of the component model at this time: wasmtime, and the <code>jco transpile</code> javascript generator <a href=\"https://github.com/bytecodealliance/jco/\">https://github.com/bytecodealliance/jco/</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/jco/\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/eb8a00963727babdefc1a525e4692badeabe1244\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f623835363636376665653366653361646563613835313232383434383064376235613735663861386230353838313739353734323665643064626539663732322f62797465636f6465616c6c69616e63652f6a636f)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/jco/\" title=\"GitHub - bytecodealliance/jco: JavaScript tooling for working with WebAssembly Components\">GitHub - bytecodealliance/jco: JavaScript tooling for working with WebAssembly Components</a></div><div class=\"message_embed_description\">JavaScript tooling for working with WebAssembly Components - GitHub - bytecodealliance/jco: JavaScript tooling for working with WebAssembly Components</div></div></div>",
        "id": 362584040,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1685571259
    },
    {
        "content": "<p>you might end up having better luck using jco because it generates js structures which are more amenable to reflection? not clear</p>",
        "id": 362584160,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1685571312
    },
    {
        "content": "<p>hmm, I am not too convinced about using javascript for embedded programming. Apart from a couple of lines of code for wasm, I never used it. As far as I know it introduces quite a bit of overhead. Additionally, I also cooperate with two rather large companies for my master thesis and I am not sure if I can convince them that javascript is the way to go (my thesis is part of a larger project).<br>\nAnyways, I will take a look at jco in the afternoon. I will definitly write some pages about wasm and maybe I can even manage to build a small prototype or demonstrator with it.</p>",
        "id": 362639332,
        "sender_full_name": "Michael V.",
        "timestamp": 1685600635
    }
]