[
    {
        "content": "<p>Hey there, </p>\n<p>I am thinking about a host feature where it automatically determines if a wasm component targets a <code>wasi:cli/command</code> world or a <code>wasi:http/proxy</code> world, which I believe will be the most popular worlds that most components target to. Has anyone done similar work in wasmtime before?</p>\n<p>I know <code>wasm-tools component wit</code> will output the WIT from a wasm component and it makes it really easy to compare if its wasi-http or wasi-cli or neither. But this approach does not extend to a component that targets wasi-http + some other imports (e.g. wasi-keyvalue), because it's not a match to wasi-http. Perhaps we should only check the exports of the components?</p>",
        "id": 404963085,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1701298059
    },
    {
        "content": "<p>You might be interested to explore <code>wasm-tools component targets</code></p>",
        "id": 404963533,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1701298260
    },
    {
        "content": "<p>Oh cool didn't know this exists!</p>",
        "id": 404964353,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1701298662
    },
    {
        "content": "<p>I conjecture that in order for the host to execute a component , the following should satisify</p>\n<ol>\n<li>The component WIT world INTERSECTS a known world (cli / http) is equal to that known world</li>\n<li>The component WIT world UNIONS the host world is equal to that host world</li>\n</ol>\n<p>The first rule makes sure the component at least targets a known world to the host. It allows the host to select an export function (e.g. <code>run</code> for wasi-cli and <code>handler</code> for wasi-http) to execute. </p>\n<p>The second rule allows the host to satisify all the imports of the component so it can instantiate the component and execute.</p>",
        "id": 404966202,
        "sender_full_name": "Mossaka (Joe)",
        "timestamp": 1701299433
    }
]