[
    {
        "content": "<p>Is there a way to go from wit-parser types that you would find in <code>wit_parser::WorldItem</code> to <code>wasmtime::component::values::Val</code> types? I'm trying to call into components that I don't know the world definition until runtime.</p>",
        "id": 389889800,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694182381
    },
    {
        "content": "<p>For now, I'm doing lining up the types myself - would be nice to not have to do that.</p>",
        "id": 389889872,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694182410
    },
    {
        "content": "<p>I have looked before and I'm pretty confident there is not, at least in wasm-tools or wasmtime.</p>",
        "id": 389890798,
        "sender_full_name": "Lann Martin",
        "timestamp": 1694182747
    },
    {
        "content": "<p>This would be useful to have, no? Especially with custom types, it's a lot of book keeping to have to chase type ids through to the definition and build up the <code>wasmtime::component::values::Val</code> from that. If it seems generally useful I can look into separating this out into reusable logic.</p>",
        "id": 389891436,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694182961
    },
    {
        "content": "<p>I guess it's a bit hard to make generic since you're going from type to value, and it's not really obvious what the values should be in all cases. For my usage right now, I just need a \"default\" value since these will be written over by result values from the function call</p>",
        "id": 389892566,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694183374
    },
    {
        "content": "<p>Ah actually just realizing now that the results don't need to be of the same type..</p>",
        "id": 389892816,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694183458
    },
    {
        "content": "<p>Whats the default value of a resource handle? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 389894018,
        "sender_full_name": "Lann Martin",
        "timestamp": 1694183870
    },
    {
        "content": "<p>Yea exactly - there is none - but luckily I was just thinking about things wrong, and I don't actually need defaults. I just need a placeholder val of any kind so I can just use <code>Val::Bool(false)</code> to all return values</p>",
        "id": 389894792,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1694184115
    }
]