[
    {
        "content": "<p>If I have only a reference to a store, and a type index (not an internal index, a wasm type index), can I retrieve the actual type instance?   How?</p>\n<p>Context:<br>\n<span class=\"user-mention\" data-user-id=\"500204\">@Daniel Hillerström</span>  and I are implementing the typed continuations proposal in wasmtime.     In the proposal, the distinction between a continuation ref type and a function ref type is not explicit in ValType, which rather includes an index to the store which should hold the variant (function or continuation) and the type (function type / another type index).    Stores do hold this information in the current spec.     This comes up in Val::from_raw when we have a raw RawVal value and a ValType (and a store) and need to turn it into a tagged Val value.</p>",
        "id": 305199579,
        "sender_full_name": "Luna Phipps-Costin",
        "timestamp": 1666286381
    },
    {
        "content": "<p>The answer probably depends on how y'all are writing this proposal, currently the embedding API of wasmtime gives out type information as object moreso than indices so it sounds like you're adding a new notion of a type index?</p>",
        "id": 305201289,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666286955
    },
    {
        "content": "<p>The only type-level information currently neeeded is function types  which all live at the <code>Engine</code> level with a <code>VMSharedSignatureIndex</code> to index, currently there are no store-level internal type index</p>",
        "id": 305201434,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666287000
    },
    {
        "content": "<p>Yes, the proposal adds a new continuation type, which is parameterised by a function type, i.e. a type index.</p>",
        "id": 305229920,
        "sender_full_name": "Daniel Hillerström",
        "timestamp": 1666296983
    },
    {
        "content": "<p>in that case if you have a <code>VMSharedSignatureIndex</code> you'll look that up in <code>Engine</code></p>",
        "id": 305230495,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666297173
    },
    {
        "content": "<p>although dealing with types is done quite carefully to avoid the locks on <code>Engine</code> or clones as much as possible, so things aren't always straightforward</p>",
        "id": 305230558,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666297199
    },
    {
        "content": "<p>Thanks Alex!   You've pointed out some important things I missed.   Types <em>weren't</em> in the store prior to function references, despite what I said.    And they in fact are <em>not</em> referenced by indices in the spec.    They are translated to addresses, which I believe corresponds to the internal wasmtime indices in Store.    So we need to implement the static vs dynamic types addition to function references.    We need to allocate all static types into dynamic types with an internal wasmtime store index (Stored&lt;T&gt;, right?) during module allocation.      I can keep looking around for this, but if you happen to have this on hand, do you know where we would do that allocation?    I believe it would occur right before we populate store.store_data.funcs, which I can't find (it's not in allocate where I would expect it).</p>",
        "id": 305237601,
        "sender_full_name": "Luna Phipps-Costin",
        "timestamp": 1666299822
    },
    {
        "content": "<p>hm I'm not sure I quite follow, but for any <code>Store</code>-related stuff you can shove it directly in <code>StoreData&lt;T&gt;</code> .. . actually lemme get a link</p>",
        "id": 305237796,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666299899
    },
    {
        "content": "<p>anything internal to Wasmtime itself can get <a href=\"https://github.com/bytecodealliance/wasmtime/blob/0959f907552e0f947c82641d552737e89f37f542/crates/wasmtime/src/store.rs#L245-L330\">stored here</a> since most internal operations work with <code>&amp;StoreOpaque</code></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/0959f907552e0f947c82641d552737e89f37f542/crates/wasmtime/src/store.rs#L245-L330\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/9c3ca658523a8c22b3bca56dbc05c5c5941de25d\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f656435653631613739323261353562633366653038343861326438653036323736393264313937303636616338323136616662343066346532323132626332652f62797465636f6465616c6c69616e63652f7761736d74696d65)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/0959f907552e0f947c82641d552737e89f37f542/crates/wasmtime/src/store.rs#L245-L330\" title=\"wasmtime/store.rs at 0959f907552e0f947c82641d552737e89f37f542 · bytecodealliance/wasmtime\">wasmtime/store.rs at 0959f907552e0f947c82641d552737e89f37f542 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A fast and secure runtime for WebAssembly. Contribute to bytecodealliance/wasmtime development by creating an account on GitHub.</div></div></div>",
        "id": 305237886,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666299946
    },
    {
        "content": "<p>you won't want to use <code>Stored&lt;T&gt;</code> since that's mostly just for public-facing API details like <code>struct Instance(Stored&lt;InstanceData&gt;)</code> (unless this is public-facing in which case it may be useful)</p>",
        "id": 305237988,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666299977
    },
    {
        "content": "<blockquote>\n<p>So we need to implement the static vs dynamic types addition to function references</p>\n</blockquote>\n<p>I think this is the bit I don't quite follow, by static types I think you mean more-or-less the type section of the wasm module (right?) but for dynamic types I'm not sure what you mean here. The answer may be as simple as \"alex please go read the spec\" too</p>",
        "id": 305238178,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666300062
    },
    {
        "content": "<p>Thanks for all the help.     After messing around for a while longer, I've decided that I can't do what I need from the Store.     I believe I must attain a reference to the Module in wasmtime::Val::from_raw (or its caller, wasmtime::Func::call_impl, etc) in order to access types indexable by a wasm (static) type index (It looks like a Module does have this information).     I believe this because as I understand, the wasmtime Store is shared across modules and therefore cannot store or access data particular to a single module.      Sound about right?    Is there any way to access the Module from either of those functions?</p>\n<p>Feel free to ignore my ramblings about the spec, I think what I was saying was totally wrong, sorry :)</p>",
        "id": 305448595,
        "sender_full_name": "Luna Phipps-Costin",
        "timestamp": 1666388921
    },
    {
        "content": "<p>You're right in that a <code>Store</code> can have many modules instantiated within it, and while it currently has handles to modules for other reasons I don't think there's an identifier per-se to go from a local module's type index to some identifier which can be used to acquire the <code>Module</code> and then map the local type index. Instead though for these sorts of use cases of type information you'll want to probably use <code>VMSharedSignatureIndex</code> and <code>Engine</code>-level type information. Basically once you get past the compilation phase you typically don't want to deal with module-local indices any more if possible.</p>\n<p>That all being said I'm not quite sure what the end goal of this is or what embedder API you're envisioning for the use case here, so I could also be totally off in how this would need to work.</p>",
        "id": 305564467,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1666459833
    }
]