[
    {
        "content": "<p>Does anyone have any recommendations on wasmtime support in Java?  We have been using this library <a href=\"https://github.com/kawamuray/wasmtime-java\">https://github.com/kawamuray/wasmtime-java</a> but it has several compatibility issues on different architectures and we are looking for something that has broader support.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/kawamuray/wasmtime-java\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/c0a71b3d14cc031e50293783c97b7feb56fd7e8e\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f323036653437663138353438633635306431343666666633643534626165626563386632313964656161326336356161383664643663626264373035656462312f6b6177616d757261792f7761736d74696d652d6a617661)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/kawamuray/wasmtime-java\" title=\"GitHub - kawamuray/wasmtime-java: Java or JVM-language binding for Wasmtime\">GitHub - kawamuray/wasmtime-java: Java or JVM-language binding for Wasmtime</a></div><div class=\"message_embed_description\">Java or JVM-language binding for Wasmtime. Contribute to kawamuray/wasmtime-java development by creating an account on GitHub.</div></div></div>",
        "id": 373335632,
        "sender_full_name": "Chris Hoefgen",
        "timestamp": 1688766766
    },
    {
        "content": "<p>Can you elaborate on the architecture limitations of <code>wasmtime-java</code>?  Wasmtime doesn't support a lot of architectures to begin with (e.g. no 32-bit arch support), so any Java wrapper is going to inherit that limitation.</p>",
        "id": 373336487,
        "sender_full_name": "Joel Dice",
        "timestamp": 1688767057
    },
    {
        "content": "<p>Sure, the main issues we are running into right now is that it is limited to x86 architectures and that it is linked to GLIBC 2.31 which is newer than some of the older, but heavily used, linux distros out there. We are building SDKs for our product that integrate with other infrastructures across multiple languages and built our core logic in wasm to rapidly deploy new language support. </p>\n<p>We noticed that some of the official wasmtime projects have better compatibility with more systems as we don't have the same issues with python or C#.</p>",
        "id": 373997042,
        "sender_full_name": "Chris Hoefgen",
        "timestamp": 1689002189
    },
    {
        "content": "<p>If you are just looking to add support for some architecture that wasmtime already supports (e.g. aarch64), you could compile wasmtime-java yourself or work with wasmtime-java's maintainer(s) to add support to their release process.</p>",
        "id": 374000315,
        "sender_full_name": "Lann Martin",
        "timestamp": 1689002731
    },
    {
        "content": "<p>Supporting glibc &lt;2.31 when building with github actions is somewhat complicated because the oldest linux distro image they support is ubuntu-20.04. This can be worked around, but again requires building yourself or working with maintainers.</p>",
        "id": 374001679,
        "sender_full_name": "Lann Martin",
        "timestamp": 1689002951
    },
    {
        "content": "<p>Cool. I figured we would have to go that route, i was just hoping that someone might know of another Java implementation of wasmtime that was more robust.</p>",
        "id": 374006056,
        "sender_full_name": "Chris Hoefgen",
        "timestamp": 1689003773
    }
]