[
    {
        "content": "<p>Hello I was looking at <a href=\"https://docs.wasmtime.dev/api/wasmtime/struct.GuestProfiler.html\">GuestProfiler</a> the other day and was wanting to tie the results into our existing profiling infrastructure. Having the ability to grab raw stacktraces and tie those into our existing profiling results would be great - is <a href=\"https://docs.wasmtime.dev/api/wasmtime/struct.WasmBacktrace.html#method.force_capture\">WasmBacktrace::force_capture</a> the right thing to do in this case? The GuestProfiler is a little too high level in our case since it's output is raw JSON.</p>",
        "id": 433537061,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1713278131
    },
    {
        "content": "<p>I think that morally that would work but practically it may be a bit too expensive. The underlying <code>Backtrace</code> is captured the same way but the symbolication and attaching of metadata I think is a bit more expensive. If that still works for your use case then no worries, but if it's too pricy to use then it'd be fine to add some lower-level methods to <code>WasmBacktrace</code> to make it cheaper to capture and/or defer symbolication/etc</p>",
        "id": 433537743,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1713278320
    },
    {
        "content": "<p>I think at the end we'd want to symbolize the backtrace - would it be cheaper to batch that operation? I guess it just moves when that step happens to be out of the signal handler... I guess there is also the question of if that's async-signal-safe (I'm going to assume no?)</p>",
        "id": 433540197,
        "sender_full_name": "Tyler Rockwood",
        "timestamp": 1713279005
    },
    {
        "content": "<p>oh definitely not async-signal-safe, no, if you need that you'll need to take extreme care</p>",
        "id": 433540588,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1713279107
    },
    {
        "content": "<p>and it may also be the case that <code>WasmBacktrace</code> just collects too much data for your use case, e.g. names of stuff you don't care about</p>",
        "id": 433540720,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1713279134
    },
    {
        "content": "<p>I'd probably start with <code>force_backtrace</code> and profile-the-profiler to see if it's too expensive</p>",
        "id": 433540812,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1713279159
    }
]