[
    {
        "content": "<p>I am trying to reduce copies of data in the c# wit-bindgen (<a href=\"https://github.com/bytecodealliance/wit-bindgen/issues/1080\">https://github.com/bytecodealliance/wit-bindgen/issues/1080</a>) and make sure we aren't leaking memory (<a href=\"https://github.com/bytecodealliance/wit-bindgen/issues/1116\">https://github.com/bytecodealliance/wit-bindgen/issues/1116</a>) after calls to the host. I would like to verify that the changes did make some improvements.   </p>\n<p>Is there a way to profile the memory usage of a component with wasmtime?  I was looking into <a href=\"https://docs.wasmtime.dev/examples-profiling.html\">https://docs.wasmtime.dev/examples-profiling.html</a> but these mostly seem focused on cpu related scenarios.</p>",
        "id": 492835191,
        "sender_full_name": "James Sturtevant",
        "timestamp": 1736463360
    },
    {
        "content": "<p>currently the only way to do this without extra instrumentation is to look at the final heap size which you can track via <code>StoreLimits</code> and isn't accessible via the CLI. (or at least not that I can remember). Otherwise tracking this would require instrumentation on the wasm side I think (and I'm not aware of anything easily/robustly available in this regard)</p>",
        "id": 492836412,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1736463898
    },
    {
        "content": "<p>time to find a good location, make an issue, and eventually make this possible, <span class=\"user-mention\" data-user-id=\"625613\">@James Sturtevant</span> :-P</p>",
        "id": 492903842,
        "sender_full_name": "Ralph",
        "timestamp": 1736499424
    },
    {
        "content": "<p>Happy to create an issue, Would wasmtime be the right place? I don't really know enough as two where the correct place is to place the hooks to make this possible.</p>\n<blockquote>\n<p>currently the only way to do this without extra instrumentation</p>\n</blockquote>\n<p>In wasmtime? or somewhere else?</p>\n<blockquote>\n<p>instrumentation on the wasm side I think (and I'm not aware of anything easily/robustly available in this regard)</p>\n</blockquote>\n<p>so the component would track this?  or something else?</p>",
        "id": 492996409,
        "sender_full_name": "James Sturtevant",
        "timestamp": 1736530878
    },
    {
        "content": "<p>For the <code>wasmtime</code> CLI itself we could have an issue for something like <code>--print-max-memory-at-the-end-of-execution</code> or something like that which prints out how many bytes the execution consumed at its maximum. I'll warn you though that this is quite coarse where it's in multiples of 64k so it's unlikely to help much in terms of tracking down leaks or proving reduced memory usage.</p>\n<p>Otherwise having something closer to valgrind is much more intrusive to the wasm module itself and would necessarily have to make lots of assumptions. For example it would have to assume that <code>malloc</code> and <code>free</code> are exclusively used to allocate memory, it would assume that there's a <code>name</code> section to identify where those functions are, and then it would have to assume that they have a particular signature. Even then injecting instrumentation into a module after-the-fact is not easy -- one option is wizer-style where you take a module and generate a module with instrumentation, and another option is wmemcheck-style where it's baked directly into the host itself.</p>\n<p>For the latter choice here, a more accurate per-module view of fine-grained memory usage, I'm not sure where such an issue would reside as it's a substantial new project that might even warrant its own repository</p>",
        "id": 492998814,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1736531781
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"625613\">James Sturtevant</span> <a href=\"#narrow/channel/217126-wasmtime/topic/memory.20profiling.20of.20components.20in.20wasmtime/near/492996409\">said</a>:</p>\n<blockquote>\n<p>Happy to create an issue, Would wasmtime be the right place? I don't really know enough as two where the correct place is to place the hooks to make this possible.</p>\n<blockquote>\n<p>currently the only way to do this without extra instrumentation</p>\n</blockquote>\n<p>In wasmtime? or somewhere else?</p>\n</blockquote>\n<p>yes, probably in the <code>wasmtime</code> CLI here because the crate itself already has support</p>",
        "id": 492998901,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1736531816
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>instrumentation on the wasm side I think (and I'm not aware of anything easily/robustly available in this regard)</p>\n</blockquote>\n<p>so the component would track this?  or something else?</p>\n</blockquote>\n<p>yeah that's the rough idea, the component language runtime itself would have support ideally for tracking this sort of statistic</p>",
        "id": 492999020,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1736531877
    }
]