[
    {
        "content": "<p>Is there a way to create an instance of <code>Linker</code> without generic parameters? If not, then does it make sense to introduce some <code>UntypedLinker</code> struct that will implement From/Into&lt;Linker&gt;?</p>\n<p><em>Context</em><br>\nI have a task to improve performance by reusing the same linker between different Wasmtime Instances (we have a lot of func_wrap calls there =) ).<br>\nThe issue is that Linkers may have different <code>T</code> params in our case (some of which may even capture non-static references), thus we're unable to store them in some sort of a shared, reusable cache. </p>\n<p>The ability to make some UntypedLinker from Linker and Linker from UntypedLinker (under unsafe context) would really help us. Especially, given the fact that does not really need it (at least on the level of struct fields)</p>\n<p>Note: I know that mem::transmute should, probably, work here, but it looks pretty dangerous to me)</p>",
        "id": 393911662,
        "sender_full_name": "Olexiy Kulchitskiy",
        "timestamp": 1695986450
    },
    {
        "content": "<p>It's not currently possible to do this today, and it's definitely not safe to do in general. The main problem with this is that functions are given <code>Caller&lt;T&gt;</code> and that <code>T</code> is the same as the <code>Linker&lt;T&gt;</code>. </p>\n<p>From a technical perspective if none of your functions use the <code>Caller&lt;T&gt;</code>, however, then it would be possible to provide a non-generic linker. That way the underlying type in the store would be erased. That would require a fair bit of implementation work in Wasmtime, however.</p>\n<p>One solution I'd recommend is to perhaps store your state as an <code>enum</code>, but dealing with non-<code>'static</code> state can be tricky with that.</p>",
        "id": 393932374,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1695994508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> thanks for quick reply)</p>",
        "id": 393946431,
        "sender_full_name": "Olexiy Kulchitskiy",
        "timestamp": 1695999105
    }
]