[
    {
        "content": "<p>Hi everyone! I am developing a testing framework to find performance problems in WebAssembly runtimes. This framework is part of a research proposal. I'm wondering whether I can request a collaboration letter from you, showing that once the proposal is funded I can use the developed framework to test Wasmtime to find its potential performance problems. Or, could you please tell me who should I contact regarding this issue? Thank you very much!</p>",
        "id": 375753463,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689513176
    },
    {
        "content": "<p>Can you say more what this entails? From whom are you hoping to have a letter (we are a loose association of various contributors), what would it say, etc? Are you hoping for a formal promise that we would collaborate or…? Without knowing more about what you would be working on and without some history of discussion with us I’m not sure we could offer such a formal thing, though of course we’re always happy to actually collaborate on relevant projects.</p>",
        "id": 375890611,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1689571041
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"254389\">Chris Fallin</span> <a href=\"#narrow/stream/217126-wasmtime/topic/Request.20a.20collaboration.20letter/near/375890611\">said</a>:</p>\n<blockquote>\n<p>Can you say more what this entails? From whom are you hoping to have a letter (we are a loose association of various contributors), what would it say, etc? Are you hoping for a formal promise that we would collaborate or…? Without knowing more about what you would be working on and without some history of discussion with us I’m not sure we could offer such a formal thing, though of course we’re always happy to actually collaborate on relevant projects.</p>\n</blockquote>\n<p>Thank you so much for your prompt response, Chris! Sure, of course, I can talk about more details of the project and the collaboration letter. Is it okay to send you DM?</p>",
        "id": 376011003,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689598216
    },
    {
        "content": "<p>No, I'd prefer not to take this to DMs -- mostly I'm trying to get the discussion in the public channel going in the right direction, so the right folks can see it (that's likely not me, I would not be the person to write such a letter)</p>",
        "id": 376052933,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1689605425
    },
    {
        "content": "<p>No problem. I will talk about them here. </p>\n<p>The techniques I will develop are mainly performance testing for Wasm runtimes. Specifically, we will generate various Wasm binaries to stress a Wasm runtime to find its performance problems, e.g., performance bugs, missed optimizations, and improperly implemented optimizations. We will also generate WASI test programs to test the performance of WASI implementations in Wasm runtimes. Finally, we will generate well-focused Wasm binaries to detect code commits that can cause potential performance regression issues during the development of a Wasm runtime.</p>\n<p>Regarding the letter, I would like to have the letter from the project manager of Wasmtime if possible. It would be great if it can indicate the support for the project and a collaboration intention if it is get funded, e.g., testing Wasmtime to find its performance problems or using/evaluating the developed testing framework in daily development.</p>",
        "id": 376112019,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689614608
    },
    {
        "content": "<p>So, we currently have Sightglass which seems to cover a lot of the same needs -- how does this work differ?</p>",
        "id": 376113918,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1689615085
    },
    {
        "content": "<p>Thanks for your question, Chris! I think the key difference is that we plan to generate a large number of Wasm binaries to test the performance, instead of using existing benchmarks, which may not achieve good coverage in terms of performance testing. Also, we use several carefully designed test oracles to determine the existence of performance problems. For example, we generate performance-similar Wasm binaries to check whether a Wasm runtime exhibit similar performances when running the Wasm binaries. I think the techniques developed in our project can complement Sightglass to achieve better testing effectiveness and efficiency.</p>",
        "id": 376117328,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689615905
    },
    {
        "content": "<p>I'll echo what Chris already mentioned about we're sort of a loose collaboration, there's no single project manager for Wasmtime for example. It's developed by a number of different companies so there's not a single manager at a single company who's \"in charge\" for example.</p>\n<p>Personally I think it's interesting to collect data points in lots of various ways about performance, but I think doing so in a robust fashion can be quite challening. Additionally benchmarks have a way of not always aging very well, too. I'd echo here again what Chris mentioned with Sightglass where it's a system that Wasmtime already, so it'd be the most useful to us to integrate with what we already have (and in theory that can cover other runtimes as well too).</p>\n<p>That being said though as an open source project you're more than welcome to take Wasmtime and analyze it and benchmark it however you'd like, you don't really need explicit consent from us to do that. Could you perhaps clarify what our role as a project in this would be? Are we basically saying we'd find such analysis interesting or are you thinking we would have a much more active role in shaping the benchmark suite and such?</p>",
        "id": 376117792,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1689616011
    },
    {
        "content": "<p>Many thanks for your response, Alex! Your suggestions are very helpful to me! Perhaps, I should clarify that the letter is used to indicate that Wasmtime developers are interested in the performance testing techniques developed in the project and would like to provide comments and feedback from an industry perspective about the developed techniques if a usable research prototype is available, and potentially integrate the techniques into existing testing framework Sightglass if possible. What do you think about this?</p>",
        "id": 376120479,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689616643
    },
    {
        "content": "<p>My perspective at least is that we're always interested in discussions, but a letter is a bit heavyweight and feels somehow like it's making a commitment out of turn: the amount to which we can collaborate really depends on how the project turns out, how much time we have at any given point, etc. Maybe we can collaborate a bit more informally first?</p>",
        "id": 376121104,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1689616814
    },
    {
        "content": "<p>Hello, I am not a contributor to wasmtime, but I am working on a project that might be interesting to have a look at if you are looking to measure performance of wasm modules and their runtimes.</p>\n<p>I am working on <a href=\"https://github.com/kajacx/wasm-bridge\">wasm-bridge</a>, a Rust crate that would allow you tu load and run wasm modules in Rust on the web with the same code that you use on the desktop.</p>\n<p>It might be interesting to compare the performance of the same waam module in these situations:</p>\n<ul>\n<li>executed from wasmtime in Rust on desktop</li>\n<li>executed from js (web browser, node, deno, etc.)</li>\n<li>executed from Rust on the web/node/deno using wasm-bridge.</li>\n</ul>\n<p>I have not optimized the code for performance yet (in fact, I have not even measured the difference), so I would be interested to see the results.</p>\n<p>As a side note, wasmer is doing basically the same thing with their \"js\" feature. The wasm module is executed by the js runtime, you can interact with it from Rust the same way.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/kajacx/wasm-bridge\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/58ce2924dce6902d9f7870f47c343ad31dfd6835\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f366333363631623965383063336361323663356262353738386165626261393236393530336130333830313632663532343262356237356563646531303966392f6b616a6163782f7761736d2d627269646765)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/kajacx/wasm-bridge\" title=\"GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys.\">GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys.</a></div><div class=\"message_embed_description\">Provides a single unified API to run WASM modules on the desktop using wasmtime, or on the web using js-sys. - GitHub - kajacx/wasm-bridge: Provides a single unified API to run WASM modules on the ...</div></div></div>",
        "id": 376135357,
        "sender_full_name": "Karel Hrkal (kajacx)",
        "timestamp": 1689620480
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"254389\">Chris Fallin</span> <a href=\"#narrow/stream/217126-wasmtime/topic/Request.20a.20collaboration.20letter/near/376121104\">said</a>:</p>\n<blockquote>\n<p>My perspective at least is that we're always interested in discussions, but a letter is a bit heavyweight and feels somehow like it's making a commitment out of turn: the amount to which we can collaborate really depends on how the project turns out, how much time we have at any given point, etc. Maybe we can collaborate a bit more informally first?</p>\n</blockquote>\n<p>Thanks, Chris! I understand your concerns. To be clear, I don't think the letter requires any commitment from your side. It is actually a kind of support letter to show Wasmtime developers' interest in the proposed research project. We can definitely collaborate first, but I need to submit the proposal (deadline: July 26) to secure a grant to support our development.</p>",
        "id": 376144588,
        "sender_full_name": "Wenwen Wang",
        "timestamp": 1689623122
    },
    {
        "content": "<p>OK. At least from my side, I am not able to supply such a letter. Best of luck.</p>",
        "id": 376145322,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1689623325
    }
]