[
    {
        "content": "<p>Wasmtime now includes features to attach state to a store, which is useful, however host APIs which depend on this are inherently unvirtualizable.</p>",
        "id": 230896780,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616085362
    },
    {
        "content": "<p>I wonder if anyone has ideas about how best to communicate that this feature is available and useful, but it's important to be aware of the implications</p>",
        "id": 230896875,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616085391
    },
    {
        "content": "<p>Could you expand upon how using state from a store vs. from a closure capture (i.e. with <code>Func</code>) impacts virtualization so that I can understand the implications?  The biggest problem I see is that state in a store is shared between all instances of that store, but users can still link in a <code>Func</code>-based host function implementation at instantiation time when needed.  At the bare minimum, we should be properly conveying to users that these <code>Store</code> functions mean every instance in the store has access to the state assuming they also share the same host function import.</p>",
        "id": 230902855,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087445
    },
    {
        "content": "<p>That's a good point, that closure state is effectively in the same category.</p>",
        "id": 230903161,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616087552
    },
    {
        "content": "<p>That is also to say the problem of shared state isn't new with config-defined host functions; I can define a <code>Func</code> with state and import that same function into multiple instances.</p>",
        "id": 230903176,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087559
    },
    {
        "content": "<p>yeah</p>",
        "id": 230903180,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087561
    },
    {
        "content": "<p>config-defined host functions definitely made it easier to implicitly share that state though</p>",
        "id": 230903337,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087635
    },
    {
        "content": "<p>so something that needs to be documented properly</p>",
        "id": 230903410,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087652
    },
    {
        "content": "<p>Yeah. I'm starting to think about where and how we should document that</p>",
        "id": 230903498,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616087691
    },
    {
        "content": "<p>The doc comments for the <code>Store</code> functions are woefully inadequate in conveying this :( that's my fault</p>",
        "id": 230903628,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616087744
    },
    {
        "content": "<p>No worries :-). We're all figuring this stuff out as we go here</p>",
        "id": 230903708,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616087766
    },
    {
        "content": "<p>I'm happy to do a follow-up PR to document this properly; besides calling out that the state in the store may be accessible to all the instances in the store (I can go into lots of detail so there aren't surprises), are there other concerns relating to virtualization I should convey?</p>",
        "id": 230904429,
        "sender_full_name": "Peter Huene",
        "timestamp": 1616088043
    },
    {
        "content": "<p>One question that I don't know the answer to yet is, \"who needs to worry about virtualization?\"</p>",
        "id": 230905503,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616088401
    },
    {
        "content": "<p>Otherwise, I think that's it.</p>",
        "id": 230905562,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1616088428
    }
]