[
    {
        "content": "<p>Hi! I have a problem. I built a c++ module with emscreepten. It uses ICU lib (ported to emcc). I have an error on instantiation of a WASI linker like :<code>unknown import: `env::__syscall_stat64` has not been defined</code> How to link these syscalls properly?</p>",
        "id": 342057398,
        "sender_full_name": "Mikhail Natalenko",
        "timestamp": 1678887005
    },
    {
        "content": "<p>You can't mix emscripten and wasi together. That is like trying to run a linux program on windows. You will either have to compile for wasi using wasi-sdk and run in a runtime supporting wasi like wasmtime, or you have to compile using emscripten and run it in the browser or any wasm runtime implementing the emscripten abi.</p>",
        "id": 342067050,
        "sender_full_name": "bjorn3",
        "timestamp": 1678889158
    },
    {
        "content": "<p>are you sure you not missing something? I thought that WASI is something like a concept of importing system API. EMSCREEPTEN and WASI-SDK are just variants of this implementation</p>",
        "id": 345316898,
        "sender_full_name": "Mikhail Natalenko",
        "timestamp": 1680075303
    },
    {
        "content": "<p>I have researched a bit. Now i see. There is a WASI and emscreepten use it a little bit (it explaines why i can run minimal examples)</p>",
        "id": 345329218,
        "sender_full_name": "Mikhail Natalenko",
        "timestamp": 1680078785
    },
    {
        "content": "<p>Thank you for the help</p>",
        "id": 345329466,
        "sender_full_name": "Mikhail Natalenko",
        "timestamp": 1680078832
    },
    {
        "content": "<p>Emscripten does use some of the wasi interfaces internally, but it also uses a lot of emscripten specific interfaces and doesn't implement many wasi interfaces.</p>",
        "id": 345450251,
        "sender_full_name": "bjorn3",
        "timestamp": 1680105862
    },
    {
        "content": "<p>One way to put it is that wasi and emscripten are kind of like linux and freebsd. There is overlap in terms of the api, but if you compile for one OS, it likely won't run correctly on another OS even if a small subset of the programs may actually happen to work correctly if both OSes are from the same OS family.</p>",
        "id": 345450780,
        "sender_full_name": "bjorn3",
        "timestamp": 1680105979
    }
]