[
    {
        "content": "<p>Hi there!<br>\nJust dealing with this... simplifying:</p>\n<p>Let's say I have a native C program that <code>fopen()</code> a file, writes a few KBs but it doesn't call to <code>fflush()</code> nor <code>fclose()</code> before it exits.<br>\nAs a rule of thumb, you cannot count on the buffered data being part of the file (especially if the program is externally terminated).</p>\n<p>But in some other scenarios, if the program completes its execution without any interruption, the OS may flush the buffered data and close all file descriptors implicitly as part of its housekeeping function. So, if you are lucky, the file may contain the data even if the file was not explicitly closed.</p>\n<p>Assuming the above is right, let's say we compile that program with WASI_SDK and run it in Wasmtime.<br>\nWasmtime (process) will own file descriptors on behalf of the C program at the eyes of the OS, right? Once the Wasm program execution is done, what would Wasmtime do with the still-open file descriptors? Will it flush and close them (maybe as part of the Store object deallocation)? Or is there any other optimization mechanism in place that group file descriptors and flushes/closes them altogether?</p>",
        "id": 340632385,
        "sender_full_name": "Jesús González",
        "timestamp": 1678374526
    },
    {
        "content": "<p>If you're using C standard file I/O (<code>fopen</code>, <code>fwrite</code>, etc) then libc typically buffers writes in userspace memory. I'm assuming the same is true for wasi-libc, in which case the buffers would be in the wasm instance's linear memory. When the wasm instance exits, nobody else knows where to find those buffers in the linear memory. So I expect that the usual rule applies here: you can't count on the buffered data being written unless you call <code>fflush</code> or <code>fclose</code>.</p>",
        "id": 340650052,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1678378394
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"504918\">@Jamey Sharp</span> . It makes sense.</p>\n<p>But I'd add... \"unless the Wasm engine performs housekeeping on behalf of the binary\", isn't?</p>",
        "id": 340659583,
        "sender_full_name": "Jesús González",
        "timestamp": 1678380567
    },
    {
        "content": "<p>The host engine can't perform housekeeping on behalf of the guest binary, because it doesn't know where the guest kept its buffers or its <code>FILE*</code>, or even if the guest did any buffering at all. The guest could have been calling the unbuffered POSIX <code>write</code> function instead of the C library's <code>fwrite</code> function; the host has no way to figure out which.</p>",
        "id": 340660997,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1678380942
    },
    {
        "content": "<p>Oh, I see what you mean.<br>\nI was looking at how <em>wasi-common</em> manages file descriptors (through the table) and thought it could help there.</p>",
        "id": 344021728,
        "sender_full_name": "Jesús González",
        "timestamp": 1679586512
    }
]