[
    {
        "content": "<p>I was thinking about <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6557\">https://github.com/bytecodealliance/wasmtime/pull/6557</a> and <a href=\"https://github.com/bytecodealliance/wasmtime/pull/6531\">https://github.com/bytecodealliance/wasmtime/pull/6531</a> and it got me wondering about Winch and target features (mostly for x86). At a high level, how should Winch deal with target feature support? Depending on the answer to this, there's a number of sub-questions:</p>\n<ul>\n<li>Should Winch declare a \"baseline\" and support nothing below that? For example with the SIMD proposal should Winch only support SSE 4.2 and above? </li>\n<li>If Winch has a baseline should it support anything above the baseline? For example should it support AVX-512 lowerings?</li>\n<li>Should Winch support all CPU configurations like Cranelift strives to do?</li>\n</ul>\n<p>To me these don't necessarily have obvious answers. A knee-jerk reaction might be to support everything in the limit of time, but that I feel like is quite a lot of duplication with Cranelift which already handles all of this sort of target-feature-specific lowerings. I feel like \"support everything\" in the long term is probably only viable if more is shared with Cranelift rather than duplicating the lowering rules effectively.</p>\n<p>The other alternative of \"support exactly this one feature set\" seems most reasonable to me from a maintainability point of view, but it has the obvious drawback of supporting less hardware or not going out of its way to support better lowerings (but I suppose Winch isn't \"all about speed\" anyway).</p>\n<p>I suppose more-or-less these PRs got me thinking about all the lowering rules we have for various supported CPU features on x86 and if there's a way it can be supported in Winch without duplication. I don't think this is trivial do to at the moment, but was curious if others had thought about this too.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"411395\">@Saúl Cabrera</span> <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/6557\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/cfecee42a99c3ff606e6197b1ab0e9a1054689bd\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f326231373438333837653339653463383933633133616633346539363838393238383363323664633836616666643462353234313430363232323562333334332f62797465636f6465616c6c69616e63652f7761736d74696d652f70756c6c2f36353537)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/6557\" title=\"Add clz and ctz instructions to Winch by jeffcharles · Pull Request #6557 · bytecodealliance/wasmtime\">Add clz and ctz instructions to Winch by jeffcharles · Pull Request #6557 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Add support for clz and ctz instructions to Winch. Also adds passing CPU flags to filetests.</div></div></div><div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/6531\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/16b7d25d097553b72921a5d55b0abf483c82e1e2\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f663433383865616639393866303831646634396238383837313839333364636233353137356132333865303865383266353064333339346535353638303761362f62797465636f6465616c6c69616e63652f7761736d74696d652f70756c6c2f36353331)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/6531\" title=\"wip - add i32.popcnt and i64.popcnt to winch by itsrainy · Pull Request #6531 · bytecodealliance/wasmtime\">wip - add i32.popcnt and i64.popcnt to winch by itsrainy · Pull Request #6531 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A fast and secure runtime for WebAssembly. Contribute to bytecodealliance/wasmtime development by creating an account on GitHub.</div></div></div>",
        "id": 365636753,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1686591985
    },
    {
        "content": "<p>One thought that occurs to me: the way that SpiderMonkey handles some of this duplication is to put some lowering sequences into the MacroAssembler, and then share that between tiers. So one could in theory do <code>masm.tricky_simd(regA, regB, regTemp)</code> in both baseline and optimizing backends. One way of adopting that idea could be to have MachInst variants that are pseudoinsts encapsulating some whole sequence. I'm not sure how much I like that but it is one direction that could work</p>",
        "id": 365677056,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1686602194
    },
    {
        "content": "<p>Regarding concrete support-points in the configuration space: I do think it'd be nice to at least support base-SSE2 and SSE4.2; maybe those two are enough overall for a baseline tier</p>",
        "id": 365677238,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1686602258
    },
    {
        "content": "<p>if we have to pick one, \"just SSE4.2\" seems OK; we already have the ability to run Wasmtime on SSE2 (or will shortly anyway) with Cranelift</p>",
        "id": 365677318,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1686602281
    },
    {
        "content": "<p>At least from my experience porting all the simd stuff to SSE2 is probably not worth the effort to put in two locations. It's somewhat error-prone and was \"questionably worth it\" the first time around and almost certainly not worth it to do again. </p>\n<p>I do like though that today temporary registers are internal details of the lowerings where the masm approach would have to burn a register to reserve it for temporary use or, as you mentioned, expose it as an API implementation detail that a temporary is needed. That being said I don't really see an alternative to share code here.</p>",
        "id": 365678345,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1686602646
    },
    {
        "content": "<p>Those are good points Alex, thanks for bringing this up.  The ideal state that I've had in my mind is one in which Winch has full parity with Cranelift, so in this case my expectations lean towards the \"support everything\" approach that you've described. I'm not coming at this from the speed angle necessarily, but mainly from the embedder's usability and developer experience. To me it seems that giving the embedder a guarantee that both compilers behave the same under the same set of circumstances would be the ideal one. On the other hand, I must admit that I haven't put a lot of thought on how to get there, it was not until I started exploring these instructions when I realized that my assumptions were wrong, since initially I expected that <code>x86_64</code> backend's  <code>emit</code> module would handle any fallback implementations. All that said, I'm curious to know if you or Chris have any ideas on how we could share some of these lowerings; even though I think that the duplication introduced by the two PRs above is not as heavy today, my expectation is that with the introduction of proposals like SIMD, a more manageable solution is desirable,  so I'd be open to exploring any potential avenues. </p>\n<p>One thought that I had, which I haven't dived too deep into, but I thought it could work: would introducing pseudo instructions that handle any alternative emission of instructions make sense, something similar to what we have for Division? <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/cranelift/codegen/src/isa/x64/inst/emit.rs#L667\">https://github.com/bytecodealliance/wasmtime/blob/main/cranelift/codegen/src/isa/x64/inst/emit.rs#L667</a></p>\n<p>I can also add an agenda item for next week's meeting so that we can discuss this in a bit more detail if everyone is ok with that.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/main/cranelift/codegen/src/isa/x64/inst/emit.rs#L667\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/e2d4b34f270e176abae1894da4f496627dd5e6f3\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f616634663235613038323661393732626535643237346431313133633639386532653063626364623836313430313330643662363731636266373937303734392f62797465636f6465616c6c69616e63652f7761736d74696d65)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/cranelift/codegen/src/isa/x64/inst/emit.rs#L667\" title=\"wasmtime/emit.rs at main · bytecodealliance/wasmtime\">wasmtime/emit.rs at main · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A fast and secure runtime for WebAssembly. Contribute to bytecodealliance/wasmtime development by creating an account on GitHub.</div></div></div>",
        "id": 365678493,
        "sender_full_name": "Saúl Cabrera",
        "timestamp": 1686602702
    },
    {
        "content": "<p>(I posted this without noticing Chris's answer, sorry)</p>",
        "id": 365678696,
        "sender_full_name": "Saúl Cabrera",
        "timestamp": 1686602769
    },
    {
        "content": "<p>Yup, glad to see we're thinking along the same lines :-)</p>",
        "id": 365678861,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1686602839
    },
    {
        "content": "<p>nah that all definitely makes sense, so I guess I would phrase my thinking as we shouldn't duplicate the lowerings across both winch and cranelift while still trying to achieve full support in both</p>",
        "id": 365680129,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1686603239
    },
    {
        "content": "<p>Pseudo-instructions are probably the way to go but I think we may want to explore better ways of defining and modelling them as right now you've got to edit a lot of files to add a pseudo-instruction, but if they were more ergonomic and/or easier to understand I think it'd make more sense to have more \"macro instructions\" like this</p>",
        "id": 365680277,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1686603290
    }
]