[
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> I just wanted to ask if there are news regarding .so files and wasi python, I'm pretty sure wasi-sdk 21 and 22 already have all changes from your fork. Componentize-py still is using your python fork from 4 months ago, are there any news since then?</p>",
        "id": 434349779,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1713528984
    },
    {
        "content": "<p>my use case is a rust binary that uses python internally as a scripting language, so I can't use componentize-py, and upstream cpython can't load the wheel .so files</p>",
        "id": 434349936,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1713529051
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"550770\">@Ramon Klass</span>.  You're correct that <code>wasi-sdk</code> 21 and 22 both have stub <code>dlopen</code> support which libraries like CPython can be built against.  However, the stubs are trivial and just return errors unconditionally; the intention is that the stub <code>libdl.so</code> would be replaced with a working version at runtime (or component creation time).</p>\n<p>I've spoken with Brett Cannon and others about what it would look like to upstream my (fairly trivial) patch to CPython to enable <code>dlopen</code> support, and but we didn't come to any definite conclusion.  The issue is that there's currently no way to test <code>dlopen</code> in CPython without pulling in a dependency on either <code>wasm-tools</code> or <code>componentize-py</code>, neither of which Brett felt were appropriate.  There's also the issue of messaging to users: unlike traditional platforms, WASI doesn't have a standard for <code>dlopen</code> in the sense of an open-world, truly dynamic, whatever-you-want, whenever-you-want runtime code loading mechanism.  Instead, you need to use e.g. <code>wasm-tools component link</code> to bundle the libraries ahead of time and create the illusion of runtime code loading (which is really just symbolically resolving code that's already loaded).  Communicating to users that they can use .so files but not the way they're used to will be a challenge.</p>\n<p>One possibility is to add <code>dlopen</code> or equivalent to WASI and implement it in WASI-capable runtimes like Wasmtime.  That could be a tough sell, though, given that an open-world version of <code>dlopen</code> (like <code>fork</code>) would be \"magic\" and fundamentally require special host powers.  I.e. it couldn't be virtualized and would thus be unlike any other WASI standard.  <span class=\"user-mention\" data-user-id=\"253998\">@Luke Wagner</span> suggested that we could standardize it, but outside of WASI.  I'm not sure what umbrella it would fall under, though.  Core Wasm?</p>\n<p>Anyway, to address your specific problem: I think I understand why you can't use <code>componentize-py</code> -- it's because you've got a Rust program that happens to use Python internally, but it's the Rust code that provides the interface to the host and outside world, correct?  If that's the case, I'd suggest you use <code>wasm-tools component link</code> directly in combination with a <code>libpython312.so</code> built from my fork.  That will require building your Rust code as a .so also, which is a bit arcane to do at the moment, but certainly possible (and is what <code>componentize-py</code> does internally).</p>",
        "id": 434377915,
        "sender_full_name": "Joel Dice",
        "timestamp": 1713537928
    },
    {
        "content": "<p>thank you for the detailed answer, is there any documentation or examples of the arcane incantations required?</p>",
        "id": 434378430,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1713538089
    },
    {
        "content": "<p><a href=\"#narrow/stream/235408-rust-toolchain/topic/Rust.20cdylib/near/424769116\">https://bytecodealliance.zulipchat.com/#narrow/stream/235408-rust-toolchain/topic/Rust.20cdylib/near/424769116</a></p>",
        "id": 434378533,
        "sender_full_name": "Joel Dice",
        "timestamp": 1713538125
    }
]