[
    {
        "content": "<p>The concept about core:module have no dependency, so is clear; but this is not the case about a component, if a component required some others, but been assigned as default to load, which will not working, but what should do in such case? If a component should be a start point, does it must have start function?</p>",
        "id": 412055751,
        "sender_full_name": "林子篆",
        "timestamp": 1704856955
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"623212\">@林子篆</span>. I'm not entirely sure I understand the question, so I'll try my best to answer you. </p>\n<p>With components, a component may have a dependency on (i.e. import) another component one of two ways: by an _instance_ of a component  (i.e. instance type) or by a component itself (i.e. component type).</p>\n<p>When importing an instance, the importing component has no control over how its dependency is instantiated; it is simply provided when the component is itself instantiated.</p>\n<p>When importing a component, the importing component has complete control over how the dependency is instantiated and can satisfy the dependency's dependencies however it sees fit. </p>\n<p>Like modules, components may have a start section that defines what function to call and what values to pass the start function; however, that functionality relies on supporting importing of values, which is not currently implemented in Wasmtime (in fact, components with a start section will trigger an <code>unimplemented!</code> panic in Wasmtime at the moment).</p>\n<p>At this time, most of the component model ecosystem is relying on the <a href=\"https://github.com/bytecodealliance/wasmtime/blob/b546a5f2579f69dca24af5f1dbb82beb1cd5eec3/crates/wasi/wit/deps/cli/run.wit#L3\">wasi:cli/run</a> interface as the common, known start function to call to to \"begin\" a WASI CLI application.</p>",
        "id": 413039365,
        "sender_full_name": "Peter Huene",
        "timestamp": 1705358431
    }
]