[
    {
        "content": "<p>Hi! Apologies if I'm on the wrong channel or I didn't post this properly, I'm still getting this Zulip thing figured out :)</p>\n<p>I've been checking out Cranelift as a potential backend to build a toy language. The main focus of the language is to support runtime compilation to native code via a JIT (no interpreter+JIT, just the JIT) and to have a very strong focus on hot reloading. Initially I was considering Inkwell (LLVM), but somone pointed me at cranelift and I must say after a quick look it looks like a great fit!</p>\n<p>Anyway, I wanted to ask about the hotswapping feature in cranelift, which I actually stumbled upon when browsing through the code. There's this function:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"w\">    </span><span class=\"sd\">/// Enable or disable hotswap support. See [`JITModule::prepare_for_function_redefine`]</span>\n<span class=\"w\">    </span><span class=\"sd\">/// for more information.</span>\n<span class=\"w\">    </span><span class=\"sd\">///</span>\n<span class=\"w\">    </span><span class=\"sd\">/// Enabling hotswap support requires PIC code.</span>\n<span class=\"w\">    </span><span class=\"k\">pub</span><span class=\"w\"> </span><span class=\"k\">fn</span> <span class=\"nf\">hotswap</span><span class=\"p\">(</span><span class=\"o\">&amp;</span><span class=\"k\">mut</span><span class=\"w\"> </span><span class=\"bp\">self</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">enabled</span>: <span class=\"kt\">bool</span><span class=\"p\">)</span><span class=\"w\"> </span>-&gt; <span class=\"kp\">&amp;</span><span class=\"nc\">mut</span><span class=\"w\"> </span><span class=\"bp\">Self</span><span class=\"w\"> </span><span class=\"p\">{</span>\n</code></pre></div>\n<p>And what this (and the documentation for prepare_for_function_redefine) seems to indicate, is that if I keep a JITModule around at runtime, when there are changes for a function, I can simply update the code for that function and redefine it inside the module without having to throw away the whole module and recompile that plus every module it's linked to from scratch?</p>\n<p>In general, I'd appreciate it if someone could point me at some piece of documentation that discusses this. I've not been able to figure out much after a few google searches <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 350589051,
        "sender_full_name": "Setzer22",
        "timestamp": 1681755833
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> ; I'll note that <code>cranelift-jit</code> is a layer on top of the core compiler (<code>cranelift-codegen</code>) that you don't <em>have</em> to use, and e.g. Wasmtime has its own JIT code management. But it's probably a good start if you have no other specific requirements and we should fix any gaps in the documentation you find!</p>",
        "id": 350589868,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1681756088
    },
    {
        "content": "<p>The hotswap feature of cranelift-jit allows you to swap out individual functions at runtime such that all future calls will call the new function, while calls that are still on the stack will use the old version. Note that it will currently never deallocate old functions and if you are doing many memory allocations before hot swapping, you may get a panic. I introduced it for an experiment to add hotswap support to rustc_codegen_cranelift, but haven't worked on the experiment since. I don't know if it will be suitable for your use. If not, you could either try improving cranelift-jit or write something from scratch. There is no need to use cranelift-jit. cranelift-codegen is the actual core of Cranelift and compiles individual functions. cranelift-jit and cranelift-object merely glue the codegen results together into executable memory and object files respectively.</p>",
        "id": 350591786,
        "sender_full_name": "bjorn3",
        "timestamp": 1681756685
    },
    {
        "content": "<p>Thanks for the quick replies!</p>\n<blockquote>\n<p>I'll note that cranelift-jit is a layer on top of the core compiler (cranelift-codegen) </p>\n</blockquote>\n<p>Right, that makes sense! For now I'm going to use it since it's convenient to have, but it's really good to know that the jit crate is not that huge and could be customized if needed.</p>\n<blockquote>\n<p>if you are doing many memory allocations before hot swapping, you may get a panic</p>\n</blockquote>\n<p>Sorry for the ignorance <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>  But when you say memory allocations here, I assume you don't mean the runtime program allocating stuff on the heap (e.g. via malloc)? I assume you mean constants that are stored in the executable at compile time will not get freed? That sounds fair, and I can probably live with that.</p>\n<blockquote>\n<p>I don't know if it will be suitable for your use. If not, you could either try improving cranelift-jit or write something from scratch. (...) cranelift-jit and cranelift-object merely glue the codegen results together into executable memory and object files respectively.</p>\n</blockquote>\n<p>Thanks! That helps me see the whole picture a lot better. I was confused by the multiple cranelift crates at first. I'm going to start with cranelift-jit since it looks like a good starting point.</p>",
        "id": 350696747,
        "sender_full_name": "Setzer22",
        "timestamp": 1681803932
    },
    {
        "content": "<p>I mean memory allocated using malloc. The issue is that all memory used by cranelift-jit needs to be within 2GB of each other to allow using signed 32bit relative relocations. Doing memory allocations can push new memory allocated by cranelift-jit outside of this range.</p>",
        "id": 350874634,
        "sender_full_name": "bjorn3",
        "timestamp": 1681848044
    },
    {
        "content": "<p>To fix this, cranelift-jit would either need to reserve the entire 2GB range or allocate the GOT (the table containing pointers to all functions that hotswapping writes to) and code pages together and duplicate GOT entries between the GOT of multiple allocated ranges.</p>",
        "id": 350875241,
        "sender_full_name": "bjorn3",
        "timestamp": 1681848248
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"610681\">Setzer22</span> has marked this topic as resolved.</p>",
        "id": 351138768,
        "sender_full_name": "Notification Bot",
        "timestamp": 1681933040
    }
]