[
    {
        "content": "<p>We archived #cranelift-new-backend just a few hours ago, but now I've discovered a possible downside to archival (vs... something else?): there's no way to view the history, as far as I can tell. That's a lot of valuable design discussion lost. Possibly we could bring it back and just rename to something else? cc <span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span></p>",
        "id": 258277226,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1634679750
    },
    {
        "content": "<p>Hmm, actually, a bit more searching (for message content I knew should be there) shows that the stream exists at this hidden URL: <a href=\"#narrow/stream/fd9a1d4!DEACTIVATED.3Acranelift-new-backend\">here as fd9a1d4!DEACTIVATED!cranelift-new-backend</a>. Maybe we could rename it to \"cranelift-backends-2020\" or something similarly date-stamped to make clear it's obsolete?</p>",
        "id": 258277725,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1634679994
    },
    {
        "content": "<p>hum, that is indeed unfortunate—it'd be much nicer if Zulip had a way to prevent posting in a channel, but without making it so hard to find. Even more unfortunate is that currently there's no way to undo the archiving, see this help entry: <a href=\"https://zulip.com/help/archive-a-stream\">https://zulip.com/help/archive-a-stream</a></p>\n<p>I wish I had seen this before, including the \"In most cases, we recommend renaming streams rather than archiving them\" <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://zulip.com/help/archive-a-stream\" style=\"background-image: url(https://zulipchat.com/static/images/logo/zulip-icon-128x128.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://zulip.com/help/archive-a-stream\" title=\"Archive a stream (Zulip Help Center)\">Archive a stream (Zulip Help Center)</a></div><div class=\"message_embed_description\">Archiving a stream will immediately unsubscribe all users from the stream, remove the stream from search and other typeaheads, and remove the stream's messages from All messages. | Archiving a stream does not delete a stream's messages. Users will still be able to find any given message by searching for it. However, links to messages and topics in the stream may or may not continue to work. | In most cases, we recommend renaming streams rather than archiving them. | We're here to help! Email us at support@zulip.com with questions, feedback, or feature requests.</div></div></div>",
        "id": 258341254,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1634724002
    },
    {
        "content": "<p>could you mail support to see if they can manually undo it?</p>",
        "id": 258346163,
        "sender_full_name": "bjorn3",
        "timestamp": 1634726544
    },
    {
        "content": "<p>At least worth a try, yes. I emailed support, so we'll see if there's anything they can do</p>",
        "id": 258348835,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1634728077
    }
]