[
    {
        "content": "<p>(moving discussion from slack to accessible space)</p>\n<p><span class=\"user-mention\" data-user-id=\"254393\">@Benjamin Bouvier</span>:</p>\n<blockquote>\n<p>i was wondering if dependabot had been disabled? (maybe during the move to the bytecode alliance?)</p>\n</blockquote>\n<p>I am not sure if I was the one who set up dependabot in the first place. I don't think I have admin rights for the repo, maybe it was <span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span>? In any case, I can definitely believe that the org move broke it. FWIW, I do think it is worth setting up again.</p>\n<p>We talked last week a bit about which settings to use for it, and I think we came to the conclusion that we should only auto-merge for sec updates (although this was in the context of wasmtime rather than cranelift specifically) to balance keeping deps up-to-date vs supply chain attacks. We would manually review the other dep updates, IIRC. Not sure if we want this same policy for cranelift or not.</p>",
        "id": 183576229,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1576520969
    },
    {
        "content": "<p>The discussion about switching to security fixes only is the only conversation I remember about this. I do vaguely remember <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> saying something about dependabot updates having changed, though. Dan, is there something else going on regarding dependabot for Cranelift?</p>",
        "id": 183602567,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1576539299
    },
    {
        "content": "<p>I don't know what the rest of the context is here.</p>",
        "id": 183602710,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1576539412
    },
    {
        "content": "<p>I do know that dependabot has been something of an experiment, and so far, my experience is that it's far too \"busy\". I don't need to wake up to 15 dependabot emails with minor-rev-bump pull requests.</p>",
        "id": 183602750,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1576539461
    },
    {
        "content": "<p>So changing it to be sec update only sounds good to me.</p>",
        "id": 183602766,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1576539481
    },
    {
        "content": "<p>(Also, dependabot doesn't seem to understand when one of my dependencies has a dependency on another that requires both to be updated at the same time, so not only does it submit many small PRs when one big one would be easier to review and manage, those small PRs are often broken.)</p>",
        "id": 183602984,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1576539713
    }
]