[
    {
        "content": "<p>Hello :) apologies for all the questions this weekend. I'm currently working on locating live references in the call stack for garbage collection in my Cranelift compiled lisp. I'm successfully <a href=\"https://github.com/ZekeMedley/lust/blob/0b86eb8655e45c3ec80d6ee27172af20e1705041/lustc/src/gc.rs#L65\">locating stack variables</a> but realizing is not sufficient because Cranelift will often store values in registers making them invisible when generating stack maps. Is there a known way people have worked around this in the past for cranelift-jit?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/ZekeMedley/lust/blob/0b86eb8655e45c3ec80d6ee27172af20e1705041/lustc/src/gc.rs#L65\" style=\"background-image: url(https://opengraph.githubassets.com/aaf8cb4eb57fd5dfbaadfac4e5a653c4edba3ff8732c741defabbf6544a10bc8/ZekeMedley/lust)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/ZekeMedley/lust/blob/0b86eb8655e45c3ec80d6ee27172af20e1705041/lustc/src/gc.rs#L65\" title=\"ZekeMedley/lust\">ZekeMedley/lust</a></div><div class=\"message_embed_description\">A lisp compiler and interpreter I've been working on - ZekeMedley/lust</div></div></div>",
        "id": 242526105,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623611694
    },
    {
        "content": "<p>Shouldn't these values be spilled to the stack on calls? Or does it keep r32/r64 values in callee saved registers?</p>",
        "id": 242527599,
        "sender_full_name": "bjorn3",
        "timestamp": 1623614072
    },
    {
        "content": "<p>Wasmtime only looks at the stack when performing gc of wasm <code>externref</code>s: <a href=\"https://github.com/bytecodealliance/wasmtime/blob/b506bc30b1c8692995e3297fcf1a5d498d4d36d6/crates/runtime/src/externref.rs#L869-L914\">https://github.com/bytecodealliance/wasmtime/blob/b506bc30b1c8692995e3297fcf1a5d498d4d36d6/crates/runtime/src/externref.rs#L869-L914</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/b506bc30b1c8692995e3297fcf1a5d498d4d36d6/crates/runtime/src/externref.rs#L869-L914\" style=\"background-image: url(https://opengraph.githubassets.com/bcb9d1908bed8f23c305d789fd58f6767626c28b11f4f22c577cf22f04920cbc/bytecodealliance/wasmtime)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/b506bc30b1c8692995e3297fcf1a5d498d4d36d6/crates/runtime/src/externref.rs#L869-L914\" title=\"bytecodealliance/wasmtime\">bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Standalone JIT-style runtime for WebAssembly, using Cranelift - bytecodealliance/wasmtime</div></div></div>",
        "id": 242527618,
        "sender_full_name": "bjorn3",
        "timestamp": 1623614125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372562\">@Zeke Medley</span></p>",
        "id": 242527668,
        "sender_full_name": "bjorn3",
        "timestamp": 1623614194
    },
    {
        "content": "<p>Hmm that's interesting. Let me look into that. Part of what suggests to me that this is the issue is that when generating a stackmap from a list of values only values that have locations on the stack <a href=\"https://docs.rs/cranelift-codegen/0.75.0/src/cranelift_codegen/binemit/stack_map.rs.html#94\">are added</a>.</p>",
        "id": 242528390,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623615347
    },
    {
        "content": "<p>The way that I generate my stackmaps is that I collect all of the values that are used in local variables and then generate a <a href=\"https://github.com/ZekeMedley/lust/blob/zeke/unwind/lustc/src/procedures.rs#L236\">stackmap from that list</a>. Some debugging shows that the values that get added here aren't deterministic which suggests to me that sometimes Cranelift is choosing to keep a value in a register instead of a stack location. Is it possible that there is a different time in the compilation process that I should be doing this generation so that that \"spill\" information is available?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/ZekeMedley/lust/blob/zeke/unwind/lustc/src/procedures.rs#L236\" style=\"background-image: url(https://opengraph.githubassets.com/aaf8cb4eb57fd5dfbaadfac4e5a653c4edba3ff8732c741defabbf6544a10bc8/ZekeMedley/lust)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/ZekeMedley/lust/blob/zeke/unwind/lustc/src/procedures.rs#L236\" title=\"ZekeMedley/lust\">ZekeMedley/lust</a></div><div class=\"message_embed_description\">A lisp compiler and interpreter I've been working on - ZekeMedley/lust</div></div></div>",
        "id": 242528569,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623615572
    },
    {
        "content": "<p>Oh, you are making your own stackmaps? Using Cranelift generated ones should work better. All live values with a reference type (r32/r64) are included in those stackmaps. I don't think the cranelift-module interface allows you to pass in a StackMapSink though, so you may need to manually call the compile_and_emit function on Context and then use declare_function_bytes instead of declare_function.</p>",
        "id": 242530088,
        "sender_full_name": "bjorn3",
        "timestamp": 1623617546
    },
    {
        "content": "<p>I have been - but happy to change it up :) I'll need to make some changes to how I compile things for that likely because currently I'm just representing everything as a tagged pointer so everything has type i64. I'm unfamiliar with how sinks work. If I make a StackMapSink where will those resulting maps get emitted?</p>",
        "id": 242530504,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623618132
    },
    {
        "content": "<p>StackMapSink is a trait with a method that gets called for every stack map. You could collect the stack maps directly into a vec (or map) you store inside the type implementing StackMapSink, you could store a reference to a global vec/map of stack maps or you could do something completely different.</p>",
        "id": 242530935,
        "sender_full_name": "bjorn3",
        "timestamp": 1623618820
    },
    {
        "content": "<p>Ah got it. Thanks so much again for the help.</p>",
        "id": 242531174,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623619122
    },
    {
        "content": "<p>no problem</p>",
        "id": 242531750,
        "sender_full_name": "bjorn3",
        "timestamp": 1623619955
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372562\">@Zeke Medley</span> -- to add one additional detail (thanks @bjorn3 for covering answers above!), re: \"does Cranelift only generate GC root info for values in stack locations\": yes, this is an invariant that comes from our definition of \"stackmaps\" (which ultimately derives from the history of Cranelift as an intended JIT backend for Firefox and so SpiderMonkey's GC design, but that's tangential): we assume that the GC can only trace values on the stack, and not values that happened to be in registers at the time the GC was invoked. For a synchronous invocation that'd mean a special prologue in the GC entry-point that saves all registers, at least, and for an async GC (stop a thread and examine its state) it would be even more complex. So we ensure that we spill all reference-type (pointer) values to the stack at every safepoint, and reload from the same slot before using again (i.e. the old value if still in a register is considered stale).</p>\n<p>To use this functionality it should be enough to (i) use the reference types (r32 or r64 -- the type has to match the target machine's pointer width) for your GC pointers, (ii) make sure the places where GC could be invoked are safepoints -- this is currently hardcoded to all calls, but could be changed if needed; and (iii) consume the stack-maps, which are lists of offsets from the stack pointer at the safepoint.</p>",
        "id": 242556446,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1623651654
    },
    {
        "content": "<p>Anyway, happy to answer more! And if we need to make this a little more flexible to fit your use-case, we can definitely work something out as well. Right now reference-types in Wasm are the main forcing function for this support but it would be nice to prove it to be more general!</p>",
        "id": 242556480,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1623651715
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> :) thanks for the additional info here. From some hairbrained initial thoughts it seems like this ought to be manageable from my end. I think there will be some tricks in integrating reference types with my current tagged values / pointers but I suspect this will be doable. This is currently just a side project so it might not be until this weekend when I can think more about it but I'll follow up with more questions as they come along!</p>",
        "id": 242633084,
        "sender_full_name": "Zeke Medley",
        "timestamp": 1623691984
    },
    {
        "content": "<p>Great! One specific note re: tagging that might be helpful: Cranelift doesn't actually care what the bits are in an r32/r64; it never actually tries to dereference a pointer or anything like that. So if e.g. your tagging is \"biased\" toward non-pointers (pointers have some bits set that need to be masked out first), that's fine; CL will just give you a list of locations of live refs, nothing more.</p>",
        "id": 242636201,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1623693387
    },
    {
        "content": "<p>That has the potential problem that the ref value isn't live between the bitcast to an int and the use of the pointer. If a gc happens in between (due to say optimizations), that can cause problems with unrooted objects potentially being gced.</p>",
        "id": 242663623,
        "sender_full_name": "bjorn3",
        "timestamp": 1623707410
    },
    {
        "content": "<p>Right, one needs to be careful not to have a safepoint when there is a value live outside of a root that has to be accessed. This is usually covered by the fact that safepoints (in ordinary VM-with-GC designs) are calls or inline expansions of primitives; in the former case one only casts ref to int to pass an arg (and after the arg is passed, the callee is responsible for it), and in the latter case, one knows what one is doing</p>",
        "id": 242666146,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1623709236
    }
]