[
    {
        "content": "<p>Happy new year everyone :)<br>\nIt would be useful to get the compiled function from a JITModule as a slice to disassemble it for debugging. Looking at the code, It seems like a straightforward addition. Would you accept a PR adding that feature? Maybe I should open an issue first?</p>",
        "id": 491823367,
        "sender_full_name": "marin",
        "timestamp": 1735945449
    },
    {
        "content": "<p>That seems like a reasonable API -- happy to look at a PR (<span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> may also have more opinions as one of the more frequent users of/contributors to that code)</p>",
        "id": 491823546,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1735945584
    },
    {
        "content": "<p>also, for what it's worth, one can look at disassemblies with either <code>clif-util compile --target ... file.clif</code> (for raw CLIF input) or <code>wasmtime compile file.wasm</code> + <code>objdump -d file.cwasm</code> (for Wasm input)</p>",
        "id": 491823600,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1735945631
    },
    {
        "content": "<p>or <code>wasmtime explore</code> for a nice html'ified view</p>",
        "id": 491823611,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1735945641
    },
    {
        "content": "<p>You can also inspect the compilation result stored in the Context after define_function. If you called the right function before define_function that will even contain the vcode of the function (which is pretty close to the final machine code) already as string.</p>",
        "id": 491823950,
        "sender_full_name": "bjorn3",
        "timestamp": 1735945905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> thanks for the tips! I'm not using cranelift in the context of wasm this time though <br>\n<span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> that sounds like what I need! So iirc, after I call <code>make_context</code>, I can set the <code>want_disas</code> flag, and then retrieve the asm from the compile code (as <code>vcode</code>)? neat I'll try that ! thanks</p>",
        "id": 491824651,
        "sender_full_name": "marin",
        "timestamp": 1735946355
    }
]