[
    {
        "content": "<p>I'm curious what algorithm ISLE uses to check patterns for coverage and compile to rust expressions. I know rust uses an extended version of <a href=\"https://dl.acm.org/doi/10.1145/1411304.1411311\">https://dl.acm.org/doi/10.1145/1411304.1411311</a> and <a href=\"http://moscova.inria.fr/~maranget/papers/warn/warn.pdf\">http://moscova.inria.fr/~maranget/papers/warn/warn.pdf</a> (extended to handle ranges and uninhabited types), but that doesn't handle non-linear pattern variables. Was there a paper you used as a guide or is it a home-grown algorithm?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://dl.acm.org/doi/10.1145/1411304.1411311\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/e8fd79e3529d8e9cf4b09845317ac973081bdde9/68747470733a2f2f646c2e61636d2e6f72672f636d732f61737365742f37303063613331392d363937382d346661302d626261332d3638353361323462643934332f313431313330342e636f7665722e6a7067&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://dl.acm.org/doi/10.1145/1411304.1411311\" title=\"Compiling pattern matching to good decision trees | Proceedings of the 2008 ACM SIGPLAN workshop on ML\">Compiling pattern matching to good decision trees | Proceedings of the 2008 ACM SIGPLAN workshop on ML</a></div><div class=\"message_embed_description\">This alert has been successfully added and will be sent to:</div></div></div>",
        "id": 463441868,
        "sender_full_name": "kmeakin",
        "timestamp": 1724082770
    },
    {
        "content": "<p>We actually don't have a \"completeness\" check; it's valid for a constructor to be partial and to fail to match (in which case it returns <code>None</code>). We do have an \"overlap\" check however that <span class=\"user-mention\" data-user-id=\"506239\">@Trevor Elliott</span> built here: <a href=\"https://github.com/bytecodealliance/wasmtime/pull/4906\">https://github.com/bytecodealliance/wasmtime/pull/4906</a>; he may be able to say more about how it corresponds to the literature/common algorithms!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/4906\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/ea1b2f223b6797538684b049b0fb22e6976deb39/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f346437653132356166666530366534656236313732393530323934653661613766356163623036656633616363363534396333623231333037316330393735312f62797465636f6465616c6c69616e63652f7761736d74696d652f70756c6c2f34393036&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/4906\" title=\"Add an overlap checker to ISLE by elliottt · Pull Request #4906 · bytecodealliance/wasmtime\">Add an overlap checker to ISLE by elliottt · Pull Request #4906 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Introduce overlap checking for ISLE as the start of addressing #4717.\nThe overlap checker detects cases where ISLE rules could fire for the same input. Consider the following example from the x64 l...</div></div></div>",
        "id": 463443481,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1724083053
    },
    {
        "content": "<p>originally it used an algorithm described in a paper from Xavier Leroy (<a href=\"https://xavierleroy.org/bibrefs/Leroy-ZINC.html\">https://xavierleroy.org/bibrefs/Leroy-ZINC.html</a>), but <span class=\"user-mention\" data-user-id=\"504918\">@Jamey Sharp</span> realized that it would be significantly less computationally expensive to check each rule in a decl group against every other rule.</p>\n<p>the check itself comes down to a pretty simple comparison of the patterns being matched: if they match the same known constructor than we recursively check each argument. if we make it all the way through the arguments without finding a pattern that differs between two rules, we raise an error. this is somewhat complicated by extractors defined in rust, as there's logic that we can't inspect in the ISLE compiler. originally i treated these as wildcards unless both rules used them, in which case the check would recurse. i believe that Jamey might have come up with some better handling for those when he worked through the changes for the trie_again ir.</p>",
        "id": 463445738,
        "sender_full_name": "Trevor Elliott",
        "timestamp": 1724083527
    },
    {
        "content": "<p>Yeah, I still basically treated external terms as wildcards unless they match syntactically. There's also complexity due to equality constraints between terms. However, the \"trie again\" representation made dealing with and-patterns much easier, if I recall correctly. And there's an additional trick where if we can prove that a higher-priority rule matches every input that a lower-priority rule does then we can report that the lower-priority rule is unreachable, which I added as an extension of the previous definition of \"overlap\".</p>\n<p>I put a lot of thought into the algorithm for building the Rust match tree as well; it is not based on any paper, but is based on my past experience with combinatorial search in general. I'd be interested in talking about it more at some point.</p>",
        "id": 463473568,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1724090778
    },
    {
        "content": "<blockquote>\n<p>We actually don't have a \"completeness\" check; it's valid for a constructor to be partial and to fail to match (in which case it returns <code>None</code>)</p>\n</blockquote>\n<p>That's concerning. Does that mean lowering could fail due to IR that is not matched by any pattern?</p>",
        "id": 463717121,
        "sender_full_name": "kmeakin",
        "timestamp": 1724163746
    },
    {
        "content": "<p>Yes, and in practice we have a bunch of them. </p>\n<p>Here's a <a href=\"https://github.com/bytecodealliance/wasmtime/blob/a2f0f2fd03c7a376ee4676f009e3cc8b8fc82e25/cranelift/fuzzgen/src/function_generator.rs#L518-L781\">list of all the instructions that the cranelift fuzzer is not allowed to generate</a>. And there are even more than that, such as vectors where the length is not 128 bits will be unimplemented by most backends. And some other instructions that the fuzzer doesen't generate.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/a2f0f2fd03c7a376ee4676f009e3cc8b8fc82e25/cranelift/fuzzgen/src/function_generator.rs#L518-L781\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/ee1aa7ed1ed8b7009f1617b99cd9d3f6443afa7c/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f653136313935356533613030383731666132363766313064323862646437336231373663373939393334326235303464643234626364623730353738616530312f62797465636f6465616c6c69616e63652f7761736d74696d65&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/a2f0f2fd03c7a376ee4676f009e3cc8b8fc82e25/cranelift/fuzzgen/src/function_generator.rs#L518-L781\" title=\"wasmtime/cranelift/fuzzgen/src/function_generator.rs at a2f0f2fd03c7a376ee4676f009e3cc8b8fc82e25 · bytecodealliance/wasmtime\">wasmtime/cranelift/fuzzgen/src/function_generator.rs at a2f0f2fd03c7a376ee4676f009e3cc8b8fc82e25 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A fast and secure runtime for WebAssembly. Contribute to bytecodealliance/wasmtime development by creating an account on GitHub.</div></div></div>",
        "id": 463718701,
        "sender_full_name": "Afonso Bordado",
        "timestamp": 1724164220
    },
    {
        "content": "<p>No more concerning than any other part of the compiler that has not been proved to be total :-)</p>\n<p>It's historically a result of the \"gradual migration\" approach that we took with ISLE's design: we wanted to be able to move over lowering patterns that override the legacy code, then eventually delete the legacy code. Now that everything is moved over (has been for two years or so) it would be a reasonable next step to add a <code>total</code> mode to decls and check coverage; but that's a large project (you or anyone else is welcome to work on it!)</p>\n<p>In the meantime because we have fuzzing (as Afonso mentions above at the CLIF level, also at the Wasm level) we tend to catch \"holes\" pretty quickly; and the failure mode is loud and obvious in any case (compiler panic rather than  a miscompile)</p>",
        "id": 463737333,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1724168140
    },
    {
        "content": "<p>There are already limited cases where we prove that an ISLE constructor is total and tweak the code we generate for it accordingly, though it's currently only when there's a catch-all low-priority rule. There might be other situations where we could generate better pattern matches if we proved that some fall-through case is unreachable. (I think I left a comment somewhere in the serialize module about that, even.) And we could do better error reporting if we synthesized a rule for each missing case and could tell the user exactly what pattern failed to match; I think Trevor tried to do that a couple years ago but it was more complicated than it seemed at first glance.</p>",
        "id": 463763252,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1724174411
    }
]