[
    {
        "content": "<p>What's the difference between the <code>#t</code>/<code>#f</code> syntax and <code>$true</code>/<code>$false</code>? The former is listed in the ISLE language specification, but the latter is used in the ISLE opt/lower rules</p>",
        "id": 463715866,
        "sender_full_name": "kmeakin",
        "timestamp": 1724163378
    },
    {
        "content": "<p><code>#t</code> and <code>#f</code> are built into the language and compile to constant <code>1</code> and <code>0</code> in Rust. I don't think we use them anywhere, they're an artifact of the early ISLE compiler prototype where we didn't really know how the language would be used in detail yet, and we can probably remove them. <code>$true</code> and <code>$false</code> are a slight abuse of the <code>$</code> syntax, which was meant to propagate through symbolic constants to the generated Rust code (and happens to work for Rust keywords like <code>true</code> and <code>false</code>); this caught on, it looks better than the Scheme-style <code>#t</code>/<code>#f</code>, and we might as well keep using it. The semantic difference I guess would be the types: integer vs. bool</p>",
        "id": 463717092,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1724163735
    },
    {
        "content": "<p>Ah so <code>$ident</code> are pattern aliases but are opaque to the ISLE compiler?</p>",
        "id": 463717963,
        "sender_full_name": "kmeakin",
        "timestamp": 1724163998
    },
    {
        "content": "<p>I'm not sure exactly what you mean by \"pattern aliases\" but yes, they're opaque tokens just passed through</p>",
        "id": 463735968,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1724167892
    },
    {
        "content": "<p>I mean like how in rust you can use <code>const FOO: usize = ...</code> in a pattern</p>",
        "id": 463736279,
        "sender_full_name": "kmeakin",
        "timestamp": 1724167935
    },
    {
        "content": "<p>ah, sure; except it's a little more general in the sense that it works in expression context (rule right-hand sides) too</p>",
        "id": 463737456,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1724168170
    }
]