[
    {
        "content": "<p>Hacking on <code>clif-util</code> is a bit annoying:</p>\n<ol>\n<li>It uses <code>String</code> for error types, which requires annoying conversions and formatting to provide context.</li>\n<li>The raw <code>clap</code> usage to build up CLI arguments and subcommands is a bit tedious.</li>\n</ol>\n<p>We can address (1) with <code>anyhow</code>, which is used extensively throughout the rest of the project and provides easy error conversions, backtraces, and addition of context.</p>\n<p>We can address (2) with <code>structopt</code>, which is also used in <code>wasmtime</code> and is a derive for creating CLI arguments from structs and enums. It is more concise and moves us towards better idioms (eg functions taking an options struct rather than fifteen parameters).</p>\n<p>I don't expect any controversy around these proposed changes, but I did want to make sure that there wasn't any hidden issues with this stuff due to the firefox+cranelift integration.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span>  <span class=\"user-mention\" data-user-id=\"254393\">@Benjamin Bouvier</span> <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> <span class=\"user-mention\" data-user-id=\"268444\">@Julian Seward</span></p>",
        "id": 210059562,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1600115748
    },
    {
        "content": "<p>+1 from me at least; it sounds like this won't affect the <code>codegen</code> or <code>wasm</code> crates at all (that's all we use in SpiderMonkey)?</p>",
        "id": 210059715,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1600115815
    },
    {
        "content": "<p>+1 from me.  <code>String</code> was once common as an error type in Cranelift, but <code>anyhow</code> is better in every way</p>",
        "id": 210060234,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1600116053
    },
    {
        "content": "<p>Great, I'll get started on this then. Thanks!</p>",
        "id": 210067323,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1600119994
    }
]