[
    {
        "content": "<p>Hello! I've been curious about using Cranelift as a codegen backend for an exotic architecture (for fun). From my understanding of the backend, the list of supported architectures is hard-coded. Are out-of-tree architecture backends intended in Cranelift? The interface is so easy I feel like there is a great opportunity for easy-to-plug-in target architectures.<br>\nIf not I will just fork Cranelift for my fun project, but I was wondering if there is a better solution to have it be more modular.</p>",
        "id": 305382991,
        "sender_full_name": "Théo Degioanni",
        "timestamp": 1666366558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"557444\">@Théo Degioanni</span> -- that's an interesting question!</p>\n<p>Right now the simple answer is \"no, not supported\", but if we were to find a way to make this work, I wouldn't be opposed to it, I think.</p>\n<p>A few considerations off the top of my head:</p>\n<ul>\n<li>Backend registration: we'd want to replace the hardcoded backend lookup that you've noted with some sort of registry. Or maybe we don't need that, and <code>cranelift_codegen::isa::lookup</code> continues to stand as a way to get a backend for one of the architectures in cranelift-codegen, and we just expose a way to provide a <code>Box&lt;dyn MachBackend&gt;</code> directly when constructing a compiler context. The latter feels a little cleaner actually.</li>\n<li>Build system: we currently have a <code>build.rs</code> that hardcodes a list of ISLE files to build; we'd probably want some sort of helper that a <code>build.rs</code> in a crate containing another backend could invoke.</li>\n<li>Versioning: we are currently free to update internal interfaces and refactor as we see the need; I don't want to lose this freedom and ossify the compiler's internals in order to provide a stability guarantee to backends (the value tradeoff still seems clearly in the direction of \"let the compiler evolve\" rather than \"hold it steady so many backends can arise\"). So an out-of-tree backend would likely need to version-pin and might need sometimes significant work to upgrade to newer versions.</li>\n</ul>\n<p>The last part seems like the most potentially questionable part. I'd want to set a norm that the cost of keeping up is solely on the out-of-tree project, and we don't consider this cost when deciding to make changes. (In our <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/docs/stability-tiers.md\">tiers</a> hierarchy, this is a kind of \"tier 4\": not only is it expected not to interfere with work on features/platforms/evolution of higher tiers, but we don't even try to keep things compiling because we don't see them.) But if that's an acceptable situation, then yeah, this could work -- it basically amounts to opening up visibility a bit (throwing some <code>pub</code>s in) and giving an interface to pass in a backend trait impl.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/main/docs/stability-tiers.md\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/d3ea3c542cebf47e488b1eae3fe26d5653f20668\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f316162666139616138303430313233313632396531636662306534346339393766383864643537643339623437643133336430313065336230326137366533322f62797465636f6465616c6c69616e63652f7761736d74696d65)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/docs/stability-tiers.md\" title=\"wasmtime/stability-tiers.md at main · bytecodealliance/wasmtime\">wasmtime/stability-tiers.md at main · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A fast and secure runtime for WebAssembly. Contribute to bytecodealliance/wasmtime development by creating an account on GitHub.</div></div></div>",
        "id": 305390992,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666368090
    },
    {
        "content": "<p>Curious what others think too -- cc <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> <span class=\"user-mention\" data-user-id=\"506239\">@Trevor Elliott</span> <span class=\"user-mention\" data-user-id=\"504918\">@Jamey Sharp</span> <span class=\"user-mention\" data-user-id=\"254110\">@Andrew Brown</span></p>",
        "id": 305391098,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666368115
    },
    {
        "content": "<p>Yeah, if someone wants to build a more flexible backend registration, I think it would be a great addition</p>",
        "id": 305391445,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1666368199
    },
    {
        "content": "<p>I feel like this is unnecessary complexity that isn't super well motivated by any project stakeholders or core use cases. If this is just a for-fun project, I don't see the harm in OP forking. If this is a more serious, long-term-supported project, then I'd prefer to have the conversation about adding it as a proper first-class supported backend for cranelift.</p>",
        "id": 305392642,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1666368508
    },
    {
        "content": "<p>It might be a nice way to show backend support and maturity. Backends that we support would be in-tree while side-projects could be separate packages that wouldn't affect our own build system.</p>",
        "id": 305392867,
        "sender_full_name": "Trevor Elliott",
        "timestamp": 1666368582
    },
    {
        "content": "<p>The main concern is ecosystem dynamics IMHO (the versioning bit above). If it becomes a defacto way to build plugin backends that many folks end up depending on, then we have a strictly worse world where we can't evolve because changes have to be coordinated across repos and teams. I think with enough care though (outlining exactly what expectations are, not accepting issues for \"broken builds\" when we update internal interfaces) it could work to foster a sense of openness and experimentation</p>",
        "id": 305393659,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666368816
    },
    {
        "content": "<p>I guess the question for us is: what really is the burden. If it's some <code>pub</code>s and an alternate constructor that takes a <code>Box&lt;dyn MachBackend&gt;</code>, that doesn't really qualify as \"unnecessary complexity\" IMHO. The social aspects are more important to consider I think</p>",
        "id": 305393827,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666368876
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"557444\">@Théo Degioanni</span> a question for you: have you experimented with what actually is needed to open up the interface? a minimum diff might help us understand better exactly how invasive this would be</p>",
        "id": 305394300,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666369022
    },
    {
        "content": "<p>Thank you for the consideration!<br>\n<span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span>  So far I have not experimented with anything, as I am evaluating what tech stack I should hook onto (my ultimate goal is to have a Rust or wasm compiler to my exotic architecture, so Cranelift is a good option).<br>\nMy understanding from reading the code though is that (assuming I pin to a specific Cranelift commit), the interface itself is already somewhat open beyond the target triple/target selection interface? The <code>TargetIsa</code> trait seems like it could be implemented by anyone. I feel like I want to go with Cranelift either way, so I can try to add my target in tree and see where I would have struggled if I had just provided a <code>Box&lt;dyn TargetIsa&gt;</code> (assuming that makes sense).</p>",
        "id": 305395349,
        "sender_full_name": "Théo Degioanni",
        "timestamp": 1666369357
    },
    {
        "content": "<p>That sounds good; an outline/summary of what we might do to eventually enable this would be a good outcome regardless. Good luck with the backend hacking and let us know if you have questions :-)</p>",
        "id": 305395553,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1666369427
    },
    {
        "content": "<p>Ideally from an user perspective I would have liked the lookup and other target-selection to be dynamic map-like lookups that would be pre-populated with the in-tree targets, and then could be expanded at runtime with targets created by the caller (so that I could for example invoke wasmtime with additionally-registered targets, or something like that).</p>",
        "id": 305395997,
        "sender_full_name": "Théo Degioanni",
        "timestamp": 1666369555
    },
    {
        "content": "<p>Thank you, though!</p>",
        "id": 305396380,
        "sender_full_name": "Théo Degioanni",
        "timestamp": 1666369667
    }
]