[
    {
        "content": "<p>So ever since I finished writing a backend I've been slowly working on documenting the process.<br>\nBut I've come to the realization that I could create much better documentation if I based it on an actually existing backend that is in the cranelift source tree. Concrete examples make learning something new like this much easier (at least in my experience), and having a fully implemented backend available for readers to study or even \"copy and modify\" will certainly lower the barrier of entry.</p>\n<p>The problem with all the existing official backends is that they are very complicated, because the architectures they target are complicated. And while I could use my own backend, it's targeting a made-up toy ISA that has no relevance.<br>\nSo I'm considering writing yet another backend specifically for this purpose. It should target an architecture that is as simple as possible (both to understand and to implement in Cranelift) as well as has at least some relevance in the real world. And since 32 bit is not _fully_ supported in Cranelift (I did get it to work but the amount of additional stuff that needs to be done would needlessly blow up the guide) it needs to be a 64 bit architecture.</p>\n<p>By making this backend part of the official repo rather than just a fork it would also be guaranteed that it is always in a working state, even if some breaking change invalidates parts of the guide (until it can be updated, I know documentation in open source projects like this tends to lag behind). But I assume there are additional standards that need to be met for a backend to make it into the official repo. So before I start to do anything I'd like to gather some input first, particularily about what architecture to target.</p>",
        "id": 328906110,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1676876813
    },
    {
        "content": "<p>Documentation for writing backends would be great! It is one of the points on the roadmap for 2023: <a href=\"https://github.com/bytecodealliance/rfcs/blob/main/accepted/cranelift-roadmap-2023.md#cranelift-porting-how-to-write-a-backend\">https://github.com/bytecodealliance/rfcs/blob/main/accepted/cranelift-roadmap-2023.md#cranelift-porting-how-to-write-a-backend</a> I don't know if anyone is already planning to do this in the short term.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/rfcs/blob/main/accepted/cranelift-roadmap-2023.md#cranelift-porting-how-to-write-a-backend\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/e18ee5b28bcafcdffe0895aabda2e535b9f3f38f\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f373435653430306266376132313236353262623262623338663636656539323938653864333366396263393832613966653333663430663538366161316161382f62797465636f6465616c6c69616e63652f72666373)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/rfcs/blob/main/accepted/cranelift-roadmap-2023.md#cranelift-porting-how-to-write-a-backend\" title=\"rfcs/cranelift-roadmap-2023.md at main · bytecodealliance/rfcs\">rfcs/cranelift-roadmap-2023.md at main · bytecodealliance/rfcs</a></div><div class=\"message_embed_description\">RFC process for Bytecode Alliance projects. Contribute to bytecodealliance/rfcs development by creating an account on GitHub.</div></div></div>",
        "id": 329037447,
        "sender_full_name": "bjorn3",
        "timestamp": 1676915305
    },
    {
        "content": "<p>Why 32 bits is not fully supported in cranelift?</p>",
        "id": 329070908,
        "sender_full_name": "Juan Bono",
        "timestamp": 1676929158
    },
    {
        "content": "<p>As i understand it this is because ValueRegs only has space for 2 regs right now, while representing 128bit ints on 32bit systems needs 4 regs. Changing this is easy I believe, but it comes at a perf cost for 64bit archs.</p>",
        "id": 329075637,
        "sender_full_name": "bjorn3",
        "timestamp": 1676932069
    },
    {
        "content": "<p>Indeed it is because of ValueRegs. In my fork I did get 32 bits to work correctly, but I specifically asked if I should PR this and the answer was no.<br>\nThe change itself is easy enough and can even be feature gated as to not incur a performance penalty as long as only 64 bit backends are enabled. But the reason was that supposedly other ways are being explored to support this differently. This is the answer I got:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/issues/5572#issuecomment-1414006204\">https://github.com/bytecodealliance/wasmtime/issues/5572#issuecomment-1414006204</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/issues/5572#issuecomment-1414006204\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/5a9bfa80d4d30e951a931b1bffd7cc3597b30c8a\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f333661386532633033353663656438363338373230373639376334656564376361306532363464626633336436383236386132366163356163643632623830622f62797465636f6465616c6c69616e63652f7761736d74696d652f6973737565732f35353732)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/issues/5572#issuecomment-1414006204\" title=\"32 bit targets in Cranelift · Issue #5572 · bytecodealliance/wasmtime\">32 bit targets in Cranelift · Issue #5572 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Hello, I am currently trying to write a Cranelift backend that targets a 32 bit architecture but am encountering some issues. Since all the existing backends are 64 bit am I not sure whether this i...</div></div></div>",
        "id": 329125994,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1676966764
    },
    {
        "content": "<p>You can also read about it in that thread, but essentially you can write 32bit backends without any modification to cranelift.<br>\nHowever you won't be able to support 128 bit integers, and without those it is impossible to compile the Rust core library, so essentially the compiler is useless.</p>",
        "id": 329126370,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1676966930
    },
    {
        "content": "<blockquote>\n<p>so essentially the compiler is useless.</p>\n</blockquote>\n<p>It still works as backend for wasmtime, which doesn't need i128.</p>",
        "id": 329232705,
        "sender_full_name": "bjorn3",
        "timestamp": 1676996299
    },
    {
        "content": "<blockquote>\n<p>I specifically asked if I should PR this and the answer was no.</p>\n<p>You can also read about it in that thread, but essentially you can write 32bit backends without any modification to cranelift.<br>\nHowever you won't be able to support 128 bit integers, and without those it is impossible to compile the Rust core library, so essentially the compiler is useless.</p>\n</blockquote>\n<p>This misrepresents things slightly, I think: the answer was \"I think it's probably best to wait until we add a new target to bring this back\" meaning yes, we can absolutely make the change (which is a fairly small tweak) as soon as it's needed, but not before because it does carry a perf penalty. Calling the compiler \"useless\" on 32-bit targets is inaccurate: we are happy to take a 32-bit backend, including with 128-bit support, as soon as someone is willing to do the work.</p>",
        "id": 329238983,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676998054
    },
    {
        "content": "<p>Well, I am willing to write any backend for the purpose of this guide as long as it is simple enough.<br>\nThe whole point of why I started this thread is to find a target architecture that is most suited for writing an example backend around.</p>",
        "id": 329239844,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1676998285
    },
    {
        "content": "<p>Hmm, reading the intro message again... I find myself actually wondering what <em>would</em> result in a simpler backend, and I'm actually not sure that ISA complexity is the top-order factor. The reason I say that is that RISC-V 64 is nominally quite simple, but we still twist things a bit to generate better code, or just to fit an abstraction onto the ISA</p>",
        "id": 329240716,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676998512
    },
    {
        "content": "<p>in other words, a too-simple ISA may result in the necessity for hacks -- witness riscv64's pervasive use of pseudoinstructions with internal control flow, for example, because it doesn't have cmoves</p>",
        "id": 329240908,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676998567
    },
    {
        "content": "<p>ARM is a nice middle ground; maybe ARM32 would be a good target? The other advantage of this is that if it's not a tier 1, widely-used architecture (as much, anymore), we can afford to not optimize it to the gills, and leave it a bit simpler</p>",
        "id": 329241202,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676998642
    },
    {
        "content": "<p>the other other advantage of that approach is that if you dig deeply enough in our git history, you'll find that we had half of an ARM32 backend once; it should still be somewhat useful at least for the instruction-encoding pieces</p>",
        "id": 329241398,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676998698
    },
    {
        "content": "<p>Good point. My first choice would have been RV32I but that has exactly the same problems obviously.<br>\nARM would certainly be the most relevant architecture to implement.<br>\nFor the sake of keeping things as easy to understand as possible I wouldn't be performing much of any optimization at all though, and ARM may still be relevant enough to warrant optimization.</p>",
        "id": 329242444,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1676998957
    },
    {
        "content": "<p>well, the good thing about the ISLE lowering rules is that we can separate out any \"advanced optimization\" rules to a separate file, such that the backend still works without them</p>",
        "id": 329242708,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676999037
    },
    {
        "content": "<p>but if this is our \"teaching backend\" I'm also comfortable with a slightly different approach to it</p>",
        "id": 329242878,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676999068
    },
    {
        "content": "<p>honestly we're so resource-strapped that I'd be surprised if anyone in the project explicitly carves out time to optimize ARM32, anyway, once it is minimally working</p>",
        "id": 329242973,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1676999101
    },
    {
        "content": "<p>ARM it is then. I've had a look at all the different versions and I believe v6 is the one to use.<br>\nThe backend is probably going to end up emitting only a subset of all possible instructions for simplicity sake.</p>",
        "id": 329249743,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1677000880
    },
    {
        "content": "<p>Sounds good! Please do let me know if I can help with any questions</p>",
        "id": 329249958,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677000948
    },
    {
        "content": "<p>I'm not up-to-speed on ARM ISA level minutiae but the only input I would offer is that we should probably assume we have FP; I know some earlier variants did not</p>",
        "id": 329250080,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677000974
    },
    {
        "content": "<p>Yes v6 has FP. It even has SIMD but I won't be implementing that.</p>",
        "id": 329250186,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1677001008
    },
    {
        "content": "<p>Implementing architectures without FP is quite complicated atm anyway.<br>\nI had to create a large number of new libcalls when I did it with my own ISA.<br>\nEventually Cranelift should probably support softfloat out of the box but I assume that is very far at the bottom of the priority list.</p>",
        "id": 329251114,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1677001233
    },
    {
        "content": "<p>Honestly I would recommend RV32I over ARM. It is a much simpler ISA. For conditional moves, many RISC-V cores will fuse a branch that skips over an arithmetic instruction into a conditional move, so you could treat that as a single unit in the code generator.</p>",
        "id": 329264204,
        "sender_full_name": "Amanieu",
        "timestamp": 1677004881
    },
    {
        "content": "<p>That's true in the abstract, but the context here is how well it fits as a Cranelift backend specifically</p>",
        "id": 329264498,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677004966
    },
    {
        "content": "<p>those internal branches in a single pseudoinstruction create extra complexity</p>",
        "id": 329264525,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677004976
    },
    {
        "content": "<p>empirically, the aarch64 backend <em>feels</em> cleaner and simpler than RV64, even though the latter is a simpler ISA from first principles</p>",
        "id": 329264591,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1677004996
    },
    {
        "content": "<p>I don't think ARM is much more complicated than RiscV if I omit Thumb.<br>\nI do know RiscV very well and ARM not at all though so there is that.</p>",
        "id": 329265316,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1677005204
    },
    {
        "content": "<p>Regarding standards for merging new backends: in short, we need confidence that the new backend won't interfere with our ability to maintain the rest of the project. But that isn't intended to be a difficult milestone to reach. For the long version, see <a href=\"https://docs.wasmtime.dev/stability-tiers.html\">https://docs.wasmtime.dev/stability-tiers.html</a></p>",
        "id": 329265997,
        "sender_full_name": "Jamey Sharp",
        "timestamp": 1677005411
    },
    {
        "content": "<p>Also I would actually need to do RV32IMF when thinking about it. Multiplication and hardware floats are necessary.</p>",
        "id": 329267051,
        "sender_full_name": "Mathis Rech",
        "timestamp": 1677005675
    }
]