[
    {
        "content": "<p>Hi all,<br>\nA few of us at UC San Diego (working with Prof Deian Stefan), were looking at some of the security characteristics of the register allocator being used in cranelift/wasmtime. <br>\nAny chance anyone here could help us with the below question? Any help is much appreciated <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n<p>Does cranelift perform register spilling/restore decisions (Eg: saving of caller save registers) based on<br>\n(1) only the current function for which is being code-genned OR<br>\n(2) would it consider if a  callee functions never use certain registers i.e. if the current function <code>foo</code> invoked a function <code>bar</code>, and <code>bar</code> never uses  a particular register, would this be considered as part of the register allocation for <code>foo</code></p>\n<p>Additionally, has this behavior changed since the last year?</p>\n<p>Thanks in advance</p>\n<p>fyi <span class=\"user-mention\" data-user-id=\"270655\">@Evan Johnson</span></p>",
        "id": 244628549,
        "sender_full_name": "Shravan Narayan",
        "timestamp": 1625174479
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"270657\">@Shravan Narayan</span>, happy to answer questions on regalloc issues! (FYI there is a new regalloc in the works, called \"regalloc2\", but not in use yet; however my answers below are applicable to both)</p>\n<p>All regalloc decisions in Cranelift (and, in fact, all compilation decisions) are function-local: there is no \"global\" register allocation. This is a key design property that lets the compiler parallelize across function compilations, and also keeps analyses tractable.</p>\n<p>(To see how the functionality you suggest in (2) could lead to complications, consider a corecursive cycle: now we have a fixpoint problem where we need to propagate registers used across all call-edges. Also, the callgraph is sometimes not known precisely, and can only be conservatively approximated, both because of indirect calls and because of external linkage.)</p>\n<p>Specifically, regalloc interacts with calls by means of the ABI code: the ABI implementation specifies which registers are \"clobbered\" by a call, and this is known according to the ABI spec for a given architecture, which is just a convention. We uphold the ABI on \"both sides\": on the caller side, we assume all maybe-clobbered regs <em>are</em> clobbered, and on the callee side, we ensure that we only clobber (at most) maybe-clobbered regs, and no more.</p>",
        "id": 244629171,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625174917
    },
    {
        "content": "<p>Re: \"has this behavior changed\", no, this is how it has always worked afaik</p>",
        "id": 244629191,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625174938
    },
    {
        "content": "<p>happy to answer further questions!</p>",
        "id": 244629194,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625174942
    },
    {
        "content": "<p>Thanks a bunch <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> ! This info definitely helps a bunch. </p>\n<p>\"new regalloc in the works\" --- Ah the upcoming regalloc was going to be my follow up question <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> On a similar note,  is the current register allocator in cranelift been the same for the last year/year and a half, or are the other register allocators that were used before the current one?</p>\n<p>For some context: We are currently tracking down some interesting reg alloc patterns which look like they are safe from this \"global allocation viewpoint\" but could be potentially worth investigating assuming we get similar patterns in other contexts, where it may not be safe. Given that the allocation decisions are function local, this does seem worth exploring more on our side. </p>\n<p>Will look into it a bit more and follow up over next few days/weeks.</p>",
        "id": 244629756,
        "sender_full_name": "Shravan Narayan",
        "timestamp": 1625175305
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"270657\">Shravan Narayan</span> <a href=\"#narrow/stream/217117-cranelift/topic/register.20allocator.20questions/near/244629756\">said</a>:</p>\n<blockquote>\n<p>Thanks a bunch <span class=\"user-mention silent\" data-user-id=\"254389\">Chris Fallin</span> ! This info definitely helps a bunch. </p>\n<p>\"new regalloc in the works\" --- Ah the upcoming regalloc was going to be my follow up question <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> On a similar note,  is the current register allocator in cranelift been the same for the last year/year and a half, or are the other register allocators that were used before the current one?</p>\n</blockquote>\n<p>The answer is a bit subtle: it depends on which Cranelift configuration you're talking about. We started developing a new compiler backend infrastructure in Jan 2020-ish, and this has always used the <a href=\"http://regalloc.rs\">regalloc.rs</a> allocator. The new framework first came into use with the aarch64 backend, merged in Apr 2020; then we developed a new x86-64 backend in the same framework, which has existed since summer 2020 but was made the <em>default</em> in Cranelift and wasmtime in Mar 2021. Prior to then, if you used default settings in wasmtime, you would have gotten the \"old\" allocator on x86-64.</p>\n<blockquote>\n<p>For some context: We are currently tracking down some interesting reg alloc patterns which look like they are safe from this \"global allocation viewpoint\" but could be potentially worth investigating assuming we get similar patterns in other contexts, where it may not be safe. Given that the allocation decisions are function local, this does seem worth exploring more on our side. </p>\n<p>Will look into it a bit more and follow up over next few days/weeks.</p>\n</blockquote>\n<p>That's surprising to me; do you have a repro case or code snippets to share?</p>",
        "id": 244630798,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625175931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> thanks for the info! We are looking at x86-64. From the description it sounds like the reg alloc would have changed in mar 2021. <br>\n\"repro\" --- yup, we are working on it. Will follow up as soon as we have something concrete. We are currently trying to confirm if the behavior we see in some cases is actually a security concern and can be reproduced/narrowed down, before we open a bugzilla thread, as the current pattern is in the middle of a huge function that we've seen just once</p>",
        "id": 244631878,
        "sender_full_name": "Shravan Narayan",
        "timestamp": 1625176664
    },
    {
        "content": "<p>s/bugzilla/github issue/ please :-) But yes, if it's a confirmed bug, I'm very curious</p>",
        "id": 244631960,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625176706
    },
    {
        "content": "<p>What symptoms are you seeing? Incorrect execution, or just bad register usage according to some other tool/checker/oracle?</p>",
        "id": 244631994,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625176732
    },
    {
        "content": "<p>This issue originally surfaced when we were testing a regalloc checker extension to veriwasm. We then manually looked at the disassembly and saw that this was happening. The exact instance of this that we saw does not appear to be exploitable, but we're looking into whether it can surface in an exploitable way.</p>",
        "id": 244632706,
        "sender_full_name": "Evan Johnson",
        "timestamp": 1625177131
    },
    {
        "content": "<p>Just to follow up on this: I got a test case from <span class=\"user-mention\" data-user-id=\"270655\">@Evan Johnson</span> and looked at it. It looks like the register (<code>edx</code>) in the particular case <em>was</em> actually defined, implicitly, by a preceding <code>imul</code>. So afaik Cranelift's output here is correct</p>",
        "id": 244767417,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1625268304
    }
]