[
    {
        "content": "<p>Hi all -- wanted to post this here too in case anyone isn't subscribed to the RFCs repository. There's a new RFC posted mapping out a possible roadmap for work on Cranelift in the next year: <a href=\"https://github.com/bytecodealliance/rfcs/pull/8\">https://github.com/bytecodealliance/rfcs/pull/8</a>. Comments over there; looking forward to good discussion :-)</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/rfcs/pull/8\" style=\"background-image: url(https://avatars0.githubusercontent.com/u/54038801?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/rfcs/pull/8\" title=\"RFC: Cranelift roadmap for 2021. by cfallin 路 Pull Request #8 路 bytecodealliance/rfcs\">RFC: Cranelift roadmap for 2021. by cfallin 路 Pull Request #8 路 bytecodealliance/rfcs</a></div><div class=\"message_embed_description\">Rendered RFC\nThis RFC describes a roadmap for work on Cranelift in 2021 (&quot;and beyond&quot;, as we are not likely to complete it all; but better to set goals aspirationally, IMHO, and there is ...</div></div></div>",
        "id": 220326281,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1608254304
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> Thanks a bunch for the detailed roadmap. I am wondering what is the best way to get involved in the efforts that are outlined in the 2021 roadmap (as a new contributor). Are the issues that are labeled as suitable for new contributors still relevant? Are there some areas of the new roadmap that are suitable for newcomers to the project to dig into? Any pointers are highly appreciated. Thanks!</p>",
        "id": 221197055,
        "sender_full_name": "Zahari Dichev",
        "timestamp": 1609315907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"369275\">@Zahari Dichev</span> greetings! Thanks for asking about this -- it's an important question for sure!</p>\n<p>IMHO, the benchmarking work is probably the easiest entry point -- <span class=\"user-mention\" data-user-id=\"254110\">@Andrew Brown</span> and <span class=\"user-mention\" data-user-id=\"257554\">@Johnnie Birch</span> are leading that effort and could possibly say more. They have a prototype benchmark-runner infra but there's still plenty more to be done.</p>\n<p>In the compiler backend itself, there's also lots of work but most of it needs more familiarity with the innards and so may be a bit more intimidating. But I'm happy to paint a more detailed picture of anything in the roadmap if you're curious or interested in a specific part :-)</p>",
        "id": 221232554,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1609351464
    },
    {
        "content": "<p>(Also, fwiw, most folks are either out or at most just monitoring email over the holidays, so responses might be slow now, but we should all be present again in a week or so :-) )</p>",
        "id": 221232614,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1609351510
    }
]