[
    {
        "content": "<p>Hello Cranelift community,</p>\n<p>I'm currently engrossed in a project utilizing Cranelift Codegen, and I'm keen on obtaining technical details regarding the development status of the unwind mechanism, specifically in the context of panic recovery. Could someone shed light on the progress, challenges, and any pertinent updates related to unwinding in Cranelift, particularly with respect to handling panics? Or what is its status?</p>\n<p>I'm specifically interested in understanding the technical intricacies and potential implications for my project. Your detailed insights will be immensely valuable in navigating the nuances of the unwind feature within Cranelift.</p>",
        "id": 421078364,
        "sender_full_name": "David flogar",
        "timestamp": 1707756006
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span> -- they were working on extending Cranelift to support this</p>",
        "id": 421131888,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1707773060
    },
    {
        "content": "<p>I've implemented this for my bachelor thesis already. I'm currently working on writing the thesis itself. Once I'm done with that, I'm going to attempt to upstream my implementation.</p>",
        "id": 421136291,
        "sender_full_name": "bjorn3",
        "timestamp": 1707774769
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"264278\">bjorn3</span> <a href=\"#narrow/stream/217117-cranelift/topic/Unwind.20Mechanism.20in.20Cranelift.20Codegen/near/421136291\">said</a>:</p>\n<blockquote>\n<p>I've implemented this for my bachelor thesis already. I'm currently working on writing the thesis itself. Once I'm done with that, I'm going to attempt to upstream my implementation.</p>\n</blockquote>\n<p>Oh haha, in fact I was looking for some way to contact you in case you had an email or something like that on your github page to contact you, since I saw that you were developing that. Can I ask how that's all going? Would the implementation of exception handling be possible? What limitations would it have?</p>",
        "id": 421140724,
        "sender_full_name": "David flogar",
        "timestamp": 1707776632
    },
    {
        "content": "<p>I'm using jit to make an interpreted language with exception handling and try/catch blocks, so if it's possible I'd like to know how much I could implement that.</p>",
        "id": 421140983,
        "sender_full_name": "David flogar",
        "timestamp": 1707776751
    },
    {
        "content": "<p>My implementation is compatible with the exception mechanism used by C++ on Unix, but it is generic enough that you can also implement a custom exception abi in case you want to avoid using the system unwinder for whatever reason (be it performance, be it security)</p>",
        "id": 421246771,
        "sender_full_name": "bjorn3",
        "timestamp": 1707832053
    },
    {
        "content": "<blockquote>\n<p>in fact I was looking for some way to contact you in case you had an email or something like that on your github page to contact you</p>\n</blockquote>\n<p>I'm most responsive on this zulip (provided you either dm me or directly ping me such that I get a notification) and on the rust lang zulip.</p>",
        "id": 421247111,
        "sender_full_name": "bjorn3",
        "timestamp": 1707832188
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"264278\">bjorn3</span> <a href=\"#narrow/stream/217117-cranelift/topic/Unwind.20Mechanism.20in.20Cranelift.20Codegen/near/421246771\">said</a>:</p>\n<blockquote>\n<p>My implementation is compatible with the exception mechanism used by C++ on Unix, but it is generic enough that you can also implement a custom exception abi in case you want to avoid using the system unwinder for whatever reason (be it performance, be it security)</p>\n</blockquote>\n<p>Oh ok, that sounds really cool, sorry for the question but, do you have an estimated date when you think it will be implemented?</p>",
        "id": 421282741,
        "sender_full_name": "David flogar",
        "timestamp": 1707842320
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>in fact I was looking for some way to contact you in case you had an email or something like that on your github page to contact you</p>\n</blockquote>\n<p>I'm most responsive on this zulip (provided you either dm me or directly ping me such that I get a notification) and on the rust lang zulip.</p>\n</blockquote>\n<p>Oh, okay, would you mind if I DM you more questions about this topic? So as not to perhaps sound too insistent labeling you.</p>",
        "id": 421282788,
        "sender_full_name": "David flogar",
        "timestamp": 1707842343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"264278\">@bjorn3</span>, exciting to hear that progress is continuing on this front! I've been meaning to reach out to you to ask about it.</p>\n<p><span class=\"user-mention\" data-user-id=\"500204\">@Daniel Hillerström</span> has also been investigating implementing the exceptions proposal for Wasmtime, and that obviously has overlap with the Cranelift bits.</p>\n<p>This is a big enough change that it should really go through the RFC process. (We can't just accept a code dump PR for a feature of this magnitude.) Would love to collaborate on designs/ideas/plans/implementation between everyone here.</p>",
        "id": 421283173,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1707842466
    },
    {
        "content": "<p>My understanding is that <span class=\"user-mention\" data-user-id=\"500204\">@Daniel Hillerström</span> is starting to draft an RFC, would love to get your input into it from the start</p>",
        "id": 421283302,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1707842517
    },
    {
        "content": "<blockquote>\n<p>I've been meaning to reach out to you to ask about it.</p>\n</blockquote>\n<p>There is no integration with Wasmtime and I don't think I will be working on it. I did keep the security requirements of Wasmtime in mind though. It is just that after fighting with the Wasmtime internals for quite a while to try adding support for exception tags, I just couldn't figure out how to thread it through all the different layers. I didn't finish the wasm-&gt;clif-ir lowering either as it depended on getting exception tags working. I believe I did get most of the way with the runtime support code to throw and catch exceptions, but couldn't test this for the aforementioned reasons either.</p>",
        "id": 421287904,
        "sender_full_name": "bjorn3",
        "timestamp": 1707843998
    },
    {
        "content": "<blockquote>\n<p>This is a big enough change that it should really go through the RFC process.</p>\n</blockquote>\n<p>I agree.</p>",
        "id": 421288493,
        "sender_full_name": "bjorn3",
        "timestamp": 1707844196
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"253990\">fitzgen (he/him)</span> <a href=\"#narrow/stream/217117-cranelift/topic/Unwind.20Mechanism.20in.20Cranelift.20Codegen/near/421283302\">said</a>:</p>\n<blockquote>\n<p>My understanding is that <span class=\"user-mention silent\" data-user-id=\"500204\">Daniel Hillerström</span> is starting to draft an RFC, would love to get your input into it from the start</p>\n</blockquote>\n<p>Yes absolutely! I welcome any insights/opinions.</p>",
        "id": 421288733,
        "sender_full_name": "Daniel Hillerström",
        "timestamp": 1707844270
    },
    {
        "content": "<p>For rustc_codegen_cranelift (cg_clif) I need compatibility with C++ exceptions due to <code>extern \"C-unwind\"</code> in rust allowing C++ exceptions to pass through Rust and vice versa. For Wasmtime depending on the system unwinder is probably not the best idea for security reasons. As such what I implemented is basically Cranelift using the standard abi for landingpads, but rather than directly emitting exception tables in the <code>.gcc_except_table</code> format like GCC and LLVM do, Cranelift would emit the exact location of every call that can unwind (or to be precise the address directly after the call instruction, as that is where the call returns) as well as the location of every landingpad which could be unwound to from that call site. Then the user of Cranelift (cg_clif or wasmtime) would assemble the exception tables in whichever format it prefers. For cg_clif this would be <code>.gcc_except_table</code>, but for wasmtime it would likely be a much simpler format tailored to wasm exceptions. Also for wasmtime once the tailcall calling convention is used (does wasmtime already use it?), the landingpad abi could be customized as preferred when using the tailcall calling convention.</p>",
        "id": 421290063,
        "sender_full_name": "bjorn3",
        "timestamp": 1707844714
    }
]