[
    {
        "content": "<p>I would like to create and then write to a global value and am wondering how to achieve this. Do I need to get a pointer to it and then use the store instruction? If so, how do I get a pointer  to it? Is there a different instruction that I need to use? I can create and read from the global value just fine but am totally lost on how to write to it so any help would be greatly appreciated!</p>",
        "id": 448334870,
        "sender_full_name": "Cregg",
        "timestamp": 1719841459
    },
    {
        "content": "<p>If you are using cranelift-module (or one of it's implementors like cranelift-jit or cranelift-object), the <code>global_value</code> instruction will return a pointer to the global variable. You can then read and write through this pointer.</p>",
        "id": 448355262,
        "sender_full_name": "bjorn3",
        "timestamp": 1719845654
    },
    {
        "content": "<p>When I try that and then print out the pointer it prints 0 and attempting to write to it segfaults</p>",
        "id": 448356642,
        "sender_full_name": "Cregg",
        "timestamp": 1719846004
    },
    {
        "content": "<p>Are you using cranelift-jit or cranelift-object? How did you get the <code>GlobalValue</code> you passed to the <code>global_value</code> instruction?</p>",
        "id": 448357134,
        "sender_full_name": "bjorn3",
        "timestamp": 1719846085
    },
    {
        "content": "<p>I'm using cranelift object and i produced the global value using the declare data method on object module</p>",
        "id": 448357283,
        "sender_full_name": "Cregg",
        "timestamp": 1719846119
    },
    {
        "content": "<p>Is the global variable something you import from another library or do you define it in the same object file?</p>",
        "id": 448357612,
        "sender_full_name": "bjorn3",
        "timestamp": 1719846191
    },
    {
        "content": "<p>And which <code>Linkage</code> did you specify when declaring?</p>",
        "id": 448357686,
        "sender_full_name": "bjorn3",
        "timestamp": 1719846210
    },
    {
        "content": "<p>I am trying to define it by writing to it and I declared it as linkage::local</p>",
        "id": 448360613,
        "sender_full_name": "Cregg",
        "timestamp": 1719846763
    },
    {
        "content": "<p>You need to define any global variable you aren't importing from another library using define_data.</p>",
        "id": 448361138,
        "sender_full_name": "bjorn3",
        "timestamp": 1719846866
    },
    {
        "content": "<p>alright thanks<br>\nill give that a try in a moment</p>",
        "id": 448361475,
        "sender_full_name": "Cregg",
        "timestamp": 1719846943
    }
]