[
    {
        "content": "<p>alexcrichton transferred <a href=\"https://github.com/bytecodealliance/cranelift/issues/627\" target=\"_blank\" title=\"https://github.com/bytecodealliance/cranelift/issues/627\">Issue #627</a>:</p>\n<blockquote>\n<p>I've done some performance analysis of cranelift that shows handling of live values, particularly the <code>partition_slice</code> function, can be hot. For example, in the <code>oryol-quad</code> benchmark the live value list frequently has over 500 values in it, and having to repeatedly partition it is slow.</p>\n<p>I have a sketch of a redesign for <code>LiveValueVec</code> that might speed things up. It's a bit complicated because <code>LiveValueVec</code> gets used in three different ways.</p>\n<p>First, in <code>LiveValueTracker::ebb_top</code>, the <code>LiveValueVec</code> is first cleared. Then we add the live_in values, followed by the args. We subsequently iterate over the live_in values, then the args. So this suggests a structure like so:</p>\n<div class=\"codehilite\"><pre><span></span>  live_ins: Vec&lt;LiveValue&gt;, args: Vec&lt;LiveValue&gt;\n</pre></div>\n\n\n<p>Second, within <code>process_inst</code>, we need to partition the <code>LiveValue</code>s by endpoint (giving <code>throughs</code> and <code>kills</code>) and then add zero, one or two <code>defs</code>. This suggests a structure like so:</p>\n<div class=\"codehilite\"><pre><span></span>  throughs: FxHashMap&lt;Inst, Vec&lt;LiveValue&gt;&gt;,\n  kills: Vec&lt;LiveValue&gt;,\n  defs: Vec&lt;LiveValue&gt;,\n</pre></div>\n\n\n<p><code>throughs</code> is pre-partitioned -- all <code>LiveValue</code>s that share the same endpoint will be in the same <code>Vec</code>. That way partitioning it to extract all the <code>LiveValue</code>s with a particular endpoint is just a hash table removal. That removed <code>Vec</code> then becomes <code>kills</code>. And we can just append the defs.</p>\n<p>Third, once <code>drop_dead</code> exits, we don't need the <code>throughs</code>/<code>kills</code>/<code>defs</code> distinction, so we would just combine those three pieces into a single piece like so:</p>\n<div class=\"codehilite\"><pre><span></span>  values: FxhashMap&lt;Inst, Vec&lt;LiveValue&gt;&gt;\n</pre></div>\n\n\n<p>This is then ready for the next call to <code>process_inst</code>.</p>\n<p>I hope this will speed things up because partitioning is an O(1) operation (a hash table lookup) rather than O(n). But there will be more allocations for the nested data structure, and there's some fiddling about to convert between the three forms as necessary. Also, it's not entirely clear to me what the best way to represent this is... maybe an enum with three variants?</p>\n</blockquote>",
        "id": 189361393,
        "sender_full_name": "GitHub",
        "timestamp": 1582932321
    }
]