[
    {
        "content": "<p>alexcrichton transferred <a href=\"https://github.com/bytecodealliance/cranelift/issues/1102\" target=\"_blank\" title=\"https://github.com/bytecodealliance/cranelift/issues/1102\">Issue #1102</a>:</p>\n<blockquote>\n<p>This is a continuation from <a href=\"https://github.com/CraneStation/cranelift/pull/921\" target=\"_blank\" title=\"https://github.com/CraneStation/cranelift/pull/921\">https://github.com/CraneStation/cranelift/pull/921</a> which was a WIP showing demo code. It's usually better to discuss scope and advantages in issues, so opening one.</p>\n<p>Currently, the best, secure way to create the Cranelift IR is to go through <code>InstBuilder</code>, a trait implemented by several structures. If you've manipulated Cranelift, there are chances you've interacted with it: <code>pos.ins()</code> or <code>pos.replace(inst)</code> returns an InstBuilder.</p>\n<p>It is doing the minimal job at the moment: creating the instruction format, filling it with data, putting it into the DFG, and returning the result SSA values.</p>\n<p>This issue proposes adding the possibility to extend the InstBuilder with more advanced behaviors.</p>\n<h2>New opportunities</h2>\n<h3>Constant folding</h3>\n<p>For instance:</p>\n<div class=\"codehilite\"><pre><span></span>let v1 = pos.ins().iconst(I32, 42);\nlet v2 = pos.ins().uextend(I64, v1);\n</pre></div>\n\n\n<p>currently results in two IR nodes, while it could just be one with <code>pos.ins().iconst(I64, 42)</code>. This would mean that the v1 value may be dead after the conversion, in which case DCE could remove it. If an InstBuilder is used after DCE happened, it also means these dead nodes can stay around forever.</p>\n<p>(You might interject that Cranelift IR is a low-level compiler and that constant propagation should have been performed by the compiler. In most cases, you'd be right, but translating from an IR to another introduces redundancies / new folding opportunities that the initial IR didn't have. I've certainly observed this when translating from wasm to CLIF IR with <code>cranelift-wasm</code>.)</p>\n<h3>Pattern-match some sequences of IR nodes into other nodes</h3>\n<p>Mostly what simple_preopt does, like converting <code>iadd(iconst(C), x)</code> into <code>iadd_imm(x, C)</code>, or folding together series of <code>iadd_imm(x, C)</code>. At the limit, we could even remove simple-preopt entirely, or move it into the <code>cranelift-preopt</code> crate. Maybe postop could also be integrated as part of these custom methods.</p>\n<p>Same caveat about dead nodes.</p>\n<h3>Fix some incorrect behaviors</h3>\n<p>Arguably, things like <a href=\"https://github.com/CraneStation/cranelift/issues/815\" target=\"_blank\" title=\"https://github.com/CraneStation/cranelift/issues/815\">https://github.com/CraneStation/cranelift/issues/815</a> could be fixed as part of a custom builder method. Would be better to fix it in the plain trait method, though.</p>\n<h2>Proposed implementation</h2>\n<ul>\n<li>See <a href=\"https://github.com/CraneStation/cranelift/pull/921\" target=\"_blank\" title=\"https://github.com/CraneStation/cranelift/pull/921\">https://github.com/CraneStation/cranelift/pull/921</a>. The idea is: put what's currently in the inst builder methods in inline <code>default_</code> prefixed trait methods or external functions, have the trait method called the default method. Thus, the user can either just not override the default trait impl, or add custom behavior and use the default method to trigger the default behavior.</li>\n<li>The above implementation does it <em>by default</em>. Another way to do it would be to propose an additional InstBuilder with custom behaviors, so users can opt-in into choosing which InstBuilder they want to use.</li>\n<li>Additionally, the custom InstBuilder would need to track which pipeline stage we're at, since otherwise it could create illegal opcodes in post-legalization phases. (Maybe a good reason to use the TypeState pattern.)</li>\n</ul>\n<h2>Drawbacks / Caveats</h2>\n<ul>\n<li>May result in creation of dead IR nodes, as shown above.</li>\n<li>Could create illegal opcodes in post-legalization phase, see above. This can already happen now, but this would be harder to debug with custom methods.</li>\n<li>Create infinite recursion under InstBuilder. This can't happen right now, but this category of issues sounds simple enough to detect.</li>\n<li>Create infinite loop during legalization. This can already happen, but could be harder to fix too with custom InstBuilders.</li>\n<li>It might slow down construction of the function's IR, because of looking up types / values of previous IR nodes. Not a strong issue if the use of the better InstBuilder is optional.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Fewer IR nodes mean fewer SSA nodes mean better register allocation, less processing time for each optimization pass, less memory used, etc. This would quite big.</li>\n<li>Almost free constant propagation / simple-preopt.</li>\n<li>We could eventually remove simple-preopt / move it entirely to the cranelift-preopt crate. Maybe the postopt phase too.</li>\n</ul>\n<p>Curious to hear people's thoughts about this!</p>\n</blockquote>",
        "id": 189361601,
        "sender_full_name": "GitHub",
        "timestamp": 1582932420
    }
]