[
    {
        "content": "<p>In wit-bindgen, a lot of the generators have a <code>wasm_type</code> function which converts <code>WasmType</code> to the destination language type, but it doesnt differentiate singed/unsigned.  Why is that, many languages differentiate between signed and unsigned integers ?  THe C  example for the numbers test produces</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"n\">int32_t</span><span class=\"w\"> </span><span class=\"n\">__wasm_import_test_numbers_test_roundtrip_u32</span><span class=\"p\">(</span><span class=\"n\">int32_t</span><span class=\"p\">);</span>\n</code></pre></div>\n<p>When I would have expected to see <code>uint32_t</code> as this is the test for an unsigned 32bit int.</p>",
        "id": 387373816,
        "sender_full_name": "Scott Waye",
        "timestamp": 1693016916
    },
    {
        "content": "<p>That's the raw untyped import, the typed import will have <code>uint32_t</code></p>",
        "id": 387374457,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1693017440
    },
    {
        "content": "<p>I see. The raw imports must have native wasm types because of something that means you can't rely on the target language wasm compiler to do that conversion?</p>",
        "id": 387403205,
        "sender_full_name": "Scott Waye",
        "timestamp": 1693038706
    },
    {
        "content": "<p>Sort of, certainly for aggregates but we could use unsigned types there in that example. Because a wrapper is always generated it's easier to always use i32 and then convert for the real function. At runtime it shouldn't matter since it all goes away anyway</p>",
        "id": 387429430,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1693058821
    },
    {
        "content": "<p>Thanks, Not tackled aggregrates yet but I see that might be more complicated depending on how the target language tackles the interop. And yes agree it would probably get inlined away during optimisation.</p>",
        "id": 387439329,
        "sender_full_name": "Scott Waye",
        "timestamp": 1693066198
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395878\">Scott Waye</span> has marked this topic as resolved.</p>",
        "id": 387439335,
        "sender_full_name": "Notification Bot",
        "timestamp": 1693066202
    }
]