[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"590366\">@Christof Petig</span> Finally had some time over the weekend to implement the ABI in C++.  This is only my first iteration and I still have most of the complex types to do (have most of the functions done, just not fully tied together) </p>\n<p><a href=\"https://github.com/GordonSmith/component-model-cpp\">https://github.com/GordonSmith/component-model-cpp</a></p>\n<p>The ABI doesn't have any dependencies on specific runtimes (as you would expect), but wiring it into Wasmtime looks like:  <a href=\"https://github.com/GordonSmith/component-model-cpp/blob/master/test/wasmtime.cpp\">https://github.com/GordonSmith/component-model-cpp/blob/master/test/wasmtime.cpp</a></p>\n<p>Be gentle it has been nearly a decade since I did any serious c++ work!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/GordonSmith/component-model-cpp\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/b14ab405cb635dfe9e2d817d6db39d0b4023fcbc\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f363464396336616634356637653464343933643432353661376138373839346634643662373264346666303432616262613062613362633862633963343764352f476f72646f6e536d6974682f636f6d706f6e656e742d6d6f64656c2d637070)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/GordonSmith/component-model-cpp\" title=\"GitHub - GordonSmith/component-model-cpp\">GitHub - GordonSmith/component-model-cpp</a></div><div class=\"message_embed_description\">Contribute to GordonSmith/component-model-cpp development by creating an account on GitHub.</div></div></div>",
        "id": 427691435,
        "sender_full_name": "Gordon Smith",
        "timestamp": 1710854133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"577690\">@Gordon Smith</span> This looks interesting, but to be honest I don't understand the purpose of the code. Is it to use the canonical ABI without WIT? If so, how would the other side look like? Would you think that bindgen should target this as a lifting and lowering library? I guess you target the host side <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> </p>\n<p>Side note: \"Be gentle it has been nearly a decade since I did any serious c++ work!\"<br>\nI think you are really doing fine (seeing the use of &lt;span&gt; which is C++20) and you might easily write better C++ code than I do (I spent too much time on pre-C++11 compilers and then jumped into Rust coding).</p>",
        "id": 427822713,
        "sender_full_name": "Christof Petig",
        "timestamp": 1710887834
    },
    {
        "content": "<p>My primary use case is to embed wasm components inside a domain specific language (a big data engine) as such we will publish a WIT interface to expose host capabilities.  <br>\nThe guest author can also expose functions to the host, but they need to be prototyped in the domain specific language, which ideally would be generated via WIT, but hand crafting them is probably more practical in the short term...</p>\n<p>My secondary goal (as you guessed) is to suggest that your WIT -&gt; C++ host generation would target this API with the following benefits:</p>\n<ol>\n<li>The code generation should be a lot simpler as the ABI supports all the data types from WIT, so should almost be a straight mapping.</li>\n<li>The generated code would not be tied to any specific web assembly runtime!!!</li>\n</ol>\n<p>Supporting specific runtimes would then be a relatively trivial exercise (getting a ref to the memory and mapping the lowered values for that runtime).</p>\n<p>My TODO list is:</p>\n<ol>\n<li>Finish support for all the data types</li>\n<li>Make the final API more C++ friendly (have top level support for sting, string&lt;WCHAR&gt; vector map etc...).</li>\n</ol>",
        "id": 427871837,
        "sender_full_name": "Gordon Smith",
        "timestamp": 1710921924
    }
]