[
    {
        "content": "<p>I'm experimenting with components and I often find myself wondering where in the source code the cause for a certain resulting WASI import is located. For example, I just tried to create a very simple component from Rust code using wit-bindgen, but it ends up importing all kinds of interfaces (wasi:io/cli/sockets/random/...), none of which I would deem necessary, even when compiling to <code>--release</code>. It is not scalable to search through all dependency sources to find the root cause for each of these. Is there some automated way of doing this? How do you usually deal with it?</p>",
        "id": 494331527,
        "sender_full_name": "Leon Thomm",
        "timestamp": 1737110513
    },
    {
        "content": "<p>This is generally a language specific thing, it depends on what the language tooling decides to make possible, but <em>in general</em> there should be a way to avoid including interfaces that aren't used (or aren't necessary).</p>\n<p>It turns out this is reported fairly often for the Rust toolchain (<code>cargo-component</code>), here are some related discussions:</p>\n<ul>\n<li><a href=\"#narrow/channel/407292-cargo-component/topic/.E2.9C.94.20component.20imports.20instance.20.60wasi.3Acli.2Fenvironment.400.2E2.2E0.60\">#cargo-component &gt; ✔ component imports instance &#96;wasi:cli/environment@0.2.0&#96;</a> </li>\n<li><a href=\"#narrow/channel/217126-wasmtime/topic/wasi.20pulled.20in.20unintentionally\"><a class=\"stream-topic\" data-stream-id=\"217126\" href=\"/#narrow/channel/217126-wasmtime/topic/wasi.20pulled.20in.20unintentionally\">#wasmtime &gt; wasi pulled in unintentionally</a> </a></li>\n</ul>\n<p>So the in general, for Rust in particular you can build to <code>wasm32-unknown-unknown</code> and remove the dependence on WASI. The normal inclusion of the WASI interfaces when building a rust component is because of the panic/unwind machinery, and there are rust-specific ways to remove that as well (that currently require nightly).</p>\n<p>As an example of other toolchains, <code>jco</code> offers a <code>--disable</code> option which can be used to remove WASI deps (for example, since <code>fetch()</code> works in JS anywhere, <code>wasi:http/outgoing-handler</code> is included by default).</p>",
        "id": 494337190,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1737112404
    }
]