[
    {
        "content": "<p>I have a use case where I could really use the ability to be able to extract wit from a wam binary as it's being uploaded to storage as a stream.  While wasmparser seems to be pretty good at working on streams, from what I can tell it seems that decoding wit parses an uses wasmparser to parse the entire binary before exposing wit information.  Might be missing something, but if not, is there openness to stream support, or would it require some heavy lifting that I'm not taking into account?</p>",
        "id": 397759913,
        "sender_full_name": "Daniel Macovei",
        "timestamp": 1697827346
    },
    {
        "content": "<p>In my experience, the component imports are generally at the beginning of the file, and the exports are at the end, so I'm not sure how you would avoid looking at the entire binary.</p>",
        "id": 397760294,
        "sender_full_name": "Joel Dice",
        "timestamp": 1697827553
    },
    {
        "content": "<p>This is technically feasible to do but is not written as such today. For example the WIT decoding process only requires a <code>wasmparser::types::Types</code> information which can be built in a streaming fashion via <code>wasmparser</code> APIs. Currently however <code>wit-component</code> does not expose an API which takes this <code>wasmparser::types::Types</code> structure, so changes would be required to <code>wit-component</code>. That being said I'd prefer to ideally avoid adding such an API because it makes <code>wasmparser</code> a public dependency which is something I'd rather avoid due to the rapid version bumps that <code>wasmparser</code> requires.</p>\n<p>I think adding something to <code>wit-component</code> though that looks like you incrementally feed in a binary and get out WIT would work well, but that'd be new support to add to <code>wit-component</code></p>",
        "id": 397760397,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697827603
    },
    {
        "content": "<p>oh and I'm assuming that you're basically asking if you can change <a href=\"https://docs.rs/wit-component/latest/wit_component/fn.decode.html\">this parameter</a> to something like <code>impl Read</code>. If you're asking for something else then I'm answering the wrong question</p>",
        "id": 397760451,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697827643
    },
    {
        "content": "<p>Oh, sounds like you don't mind waiting until the whole binary has arrived -- you just want to avoid buffering the whole thing, which is reasonable.</p>",
        "id": 397760796,
        "sender_full_name": "Joel Dice",
        "timestamp": 1697827809
    },
    {
        "content": "<p>oh that was just my interpretation, which may also be wrong</p>",
        "id": 397761231,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697828085
    },
    {
        "content": "<p>yeah i don't mind waiting for the whole thing, just avoiding buffering all of it</p>",
        "id": 397761556,
        "sender_full_name": "Daniel Macovei",
        "timestamp": 1697828256
    },
    {
        "content": "<p><code>wasmparser</code> can already do incremental parsing, can't it?  Could you use that to grab the parts you need, skip past the parts you don't, and then somehow construct an \"abbreviated\" version of the component to give to <code>wit-component</code>?  I'm handwaving a lot, so maybe that's not feasible.</p>",
        "id": 397762218,
        "sender_full_name": "Joel Dice",
        "timestamp": 1697828573
    },
    {
        "content": "<p>no yeah that's what I meant by it's definitely feasible, it's just not exposed from wit-component</p>",
        "id": 397763056,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697829019
    },
    {
        "content": "<p>so I think it'd be best to add a struct to wit-component where you feed it bytes and tell it when you're done and it pops out a <code>Resolve</code>/<code>Package</code>/etc</p>",
        "id": 397763090,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697829037
    },
    {
        "content": "<p>could probably just <code>impl Read</code> this struct? <a href=\"https://github.com/bytecodealliance/wasm-tools/blob/main/crates/wit-component/src/decoding.rs#L15\">https://github.com/bytecodealliance/wasm-tools/blob/main/crates/wit-component/src/decoding.rs#L15</a></p>",
        "id": 397763916,
        "sender_full_name": "Daniel Macovei",
        "timestamp": 1697829496
    },
    {
        "content": "<p>something along those lines would work yeah</p>",
        "id": 397764024,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1697829560
    }
]