[
    {
        "content": "<p>Hello! I am working with wasmtime 13.0.0. I have used the wasi command adapter to migrate a core module to a component, and I'm able to load it using the component loader. However, I'm not able to, using the Rust API, retrieve the stdout from the component. Do you know if there's an example of the sorts? I am able to inherit stdout from the host and let the component print to it, but I'd like to retrieve the result on the rust side. Thanks!</p>",
        "id": 393530231,
        "sender_full_name": "Rafael Fernández López",
        "timestamp": 1695832254
    },
    {
        "content": "<p><code>wasmtime_wasi::preview2::pipe::MemoryOutputPipe</code> is a trivial implementation for capturing all writes to an output stream to a buffer</p>",
        "id": 393531046,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1695832571
    },
    {
        "content": "<p>if you need to consume the stream as the program runs, you can use AsyncWriteStream to wrap your own type that impls AsyncWrite.</p>",
        "id": 393531201,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1695832634
    },
    {
        "content": "<p>and you can use things like <code>tokio::io::duplex</code> if you need to redirect that into a buffered channel you can AsyncRead from</p>",
        "id": 393531334,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1695832690
    },
    {
        "content": "<p>Thanks for the answer! I just figured out that I was using the wrong WasiCtxBuilder when trying this, so it was expecting a dyn WasiFile, instead of the snapshot2 one that expects a impl HostOutputStream :)</p>",
        "id": 393532506,
        "sender_full_name": "Rafael Fernández López",
        "timestamp": 1695833141
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"427074\">Rafael Fernández López</span> has marked this topic as resolved.</p>",
        "id": 393533242,
        "sender_full_name": "Notification Bot",
        "timestamp": 1695833422
    }
]