[
    {
        "content": "<p>hello o/ has anyone investigated using IPv6 transition technologies over WASI (and handle them in the libc/language implementation), instead of developing IPv4-specific WASI APIs?</p>",
        "id": 429071442,
        "sender_full_name": "Soni L.",
        "timestamp": 1711191979
    },
    {
        "content": "<p>like why not remove this and everything related to it from wasi-socket <a href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/network.wit#L108\">https://github.com/WebAssembly/wasi-sockets/blob/main/wit/network.wit#L108</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/network.wit#L108\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/33883f571c91d421d3f58ac2d17fb90b66415990\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f323539306332326365353439303930663238626563636536636339303362363433633266363434393766396166613333343032663034333661313134306630652f576562417373656d626c792f776173692d736f636b657473)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/network.wit#L108\" title=\"wasi-sockets/wit/network.wit at main · WebAssembly/wasi-sockets\">wasi-sockets/wit/network.wit at main · WebAssembly/wasi-sockets</a></div><div class=\"message_embed_description\">WASI API proposal for managing sockets. Contribute to WebAssembly/wasi-sockets development by creating an account on GitHub.</div></div></div>",
        "id": 429432000,
        "sender_full_name": "Soni L.",
        "timestamp": 1711379204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"703786\">@Soni L.</span> I can't speak for the actual designers of wasi-sockets but I would imagine the reason here is probably that \"compatible with the existing world\" takes precedence over \"innovate and choose the future-looking position\" in this case. Also the required complexity in the runtime: a standard is less successful the more it forces an implementer to build in a ton of complexity just to meet the minimum bar (in this case: 464XLAT would require... a user-space networking stack I think? not super-reasonable)</p>",
        "id": 429447160,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1711382016
    },
    {
        "content": "<p>I'm personally sympathetic (playing with ipv6 personally since 2002! I even ran my home network ipv6-only for a week once) but... this isn't the place to do that innovation. wit-based WASI is innovating with sandboxing/security and capabilities, it doesn't also need to be \"weird\" in the way it does network addresses :-)</p>",
        "id": 429447558,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1711382086
    },
    {
        "content": "<p>it doesn't require an entire user-space networking stack, it's mostly just API call translation. we can point to <a href=\"https://website.peterjin.org/wiki/Universal_Relay\">https://website.peterjin.org/wiki/Universal_Relay</a> and RFC 6535 as prior art, tho it would certainly require some tweaks before it could be done in wasi.</p>",
        "id": 429464306,
        "sender_full_name": "Soni L.",
        "timestamp": 1711385527
    },
    {
        "content": "<p>we thought the whole point of WASI 0.2 and the component model was to innovate and choose the future-looking position? it's explicitly no longer coupled to POSIX, at least.</p>",
        "id": 429464576,
        "sender_full_name": "Soni L.",
        "timestamp": 1711385604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"703786\">@Soni L.</span> I can offer that it would be good to try to avoid tacit assumptions and absolutisms -- innovation and forward-looking design doesn't have to mean taking stances that would create serious speedbumps and confusion with everyday adopters, and doesn't have to mean that every identifiable axis of design maximizes the innovation knob. It's not very helpful to question any pragmatic choice with \"we thought the whole point was to innovate\" -- deep, careful thought goes into these APIs. <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> might be able to say more about IPv4 and design philosophy here?</p>",
        "id": 429482470,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1711390768
    },
    {
        "content": "<blockquote>\n<p>instead of developing IPv4-specific WASI APIs?</p>\n</blockquote>\n<p>Which API's are IPv4 specific?</p>",
        "id": 429485140,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1711391782
    },
    {
        "content": "<p>And if those exist, why would that be a problem?</p>",
        "id": 429485340,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1711391867
    },
    {
        "content": "<p>ppl already don't bother to implement ipv6 as it is, because they think they don't/won't need it. removing the option to not implement ipv6 makes things easier.</p>",
        "id": 429485794,
        "sender_full_name": "Soni L.",
        "timestamp": 1711392053
    },
    {
        "content": "<p>As it stands today, wasi-sockets is already agnostic to IP versions. This can be observed by e.g. the absence of distinct IP_* and IPV6_* socket options. So, in that aspect, IPv6 support already comes along \"for free\".</p>\n<p>However, regardless of what API WASI exposes, the first thing libc is going to do is translate it back into a POSIX interface. Every additional layer of abstraction we introduce is going to be an uphill battle from both ways; once for the host, and once for the guest.</p>\n<p>In general, I think \"the problem\" with IPv6 is <em>the real world</em>, not so much how WASI exposes it.</p>",
        "id": 429489030,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1711393276
    },
    {
        "content": "<p>there is actually a lot of incentive for ipv6 in the real world nowadays, especially since aws started charging for ipv4</p>\n<p>but for wasi, the best you can do is make it easy for the guest to use ipv6, and hard for the host to refuse ipv6</p>",
        "id": 429491244,
        "sender_full_name": "Soni L.",
        "timestamp": 1711394098
    },
    {
        "content": "<blockquote>\n<p>for wasi, the best you can do is make it easy for the guest to use ipv6</p>\n</blockquote>\n<p>Agree :)</p>",
        "id": 429492271,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1711394509
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"378155\">Dave Bakker (badeend)</span> <a href=\"#narrow/stream/219900-wasi/topic/ipv6-only.20.28464XLAT.2FSIIT-DC.29/near/429492271\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>for wasi, the best you can do is make it easy for the guest to use ipv6</p>\n</blockquote>\n<p>Agree :)</p>\n</blockquote>\n<p>Agree too :)</p>",
        "id": 429507947,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1711399975
    },
    {
        "content": "<p>uh. currently the guest has to support ipv4 and ipv6 separately.</p>",
        "id": 429517694,
        "sender_full_name": "Soni L.",
        "timestamp": 1711403689
    },
    {
        "content": "<p>WASI isn't an advantageous place to push back on guest sockets code, because a lot of guest sockets code will be written to use source languages' standard library APIs rather than wasi-sockets directly. If WASI did anything that made v4 harder to use, we'd just be creating barriers to languages supporting WASI, not motivating applications to switch from v4 to v6.</p>",
        "id": 429531977,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1711411762
    },
    {
        "content": "<p>yes, most standard libraries would just patch it over, and that's not necessarily a bad thing. we are still trying to push for ipv6-only OSes/kernels, and if you already have the ipv6-only OS support in your stdlib due to wasi, porting to these becomes trivial. (assuming you're not using the OS libc for some reason.)</p>",
        "id": 429532568,
        "sender_full_name": "Soni L.",
        "timestamp": 1711412148
    }
]