[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> <span class=\"user-mention\" data-user-id=\"477605\">@Kyle Brown</span> <span class=\"user-mention\" data-user-id=\"253998\">@Luke Wagner</span> <span class=\"user-mention\" data-user-id=\"269506\">@Brian</span> <span class=\"user-mention\" data-user-id=\"484032\">@Romans Volosatovs</span> <span class=\"user-mention\" data-user-id=\"421591\">@Bailey Hayes</span> <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> As several of us have discussed, I have been preparing a theoretical <code>wasi-snapshot-preview2</code> interface based on the state of <code>wit-bindgen</code> today. The only outstanding feature needed for this is <code>use</code>; which <span class=\"user-mention\" data-user-id=\"269506\">@Brian</span> is working on. In the spirit of release early, release often, you can find my work here: <a href=\"https://github.com/npmccallum/wasi-snapshot-preview2\">https://github.com/npmccallum/wasi-snapshot-preview2</a></p>\n<p>This effort attempts to do two things:</p>\n<ol>\n<li>get a version of wasi based on wit as it exists today</li>\n<li>add some of the most painful missing features (particularly, outgoing TCP and DNS)</li>\n</ol>\n<p>This work is based heavily on existing proposals and all the credit goes to the original authors. I have mostly tried to adapt to the current situation in wit and consolidate the effort.</p>\n<p>I would appreciate your reviews.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/npmccallum/wasi-snapshot-preview2\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/372a78235c819fe75a38edcf41d229572a8d5626\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f303463383439323036373062393064616138626239346631336635376531343531643163343531343136393836633165626666623435386566623333373632302f6e706d6363616c6c756d2f776173692d736e617073686f742d7072657669657732)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/npmccallum/wasi-snapshot-preview2\" title=\"GitHub - npmccallum/wasi-snapshot-preview2\">GitHub - npmccallum/wasi-snapshot-preview2</a></div><div class=\"message_embed_description\">Contribute to npmccallum/wasi-snapshot-preview2 development by creating an account on GitHub.</div></div></div>",
        "id": 313379125,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669929445
    },
    {
        "content": "<p>For comparison, there's also <a href=\"https://github.com/bytecodealliance/preview2-prototyping/blob/main/wit/wasi.wit\">https://github.com/bytecodealliance/preview2-prototyping/blob/main/wit/wasi.wit</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/preview2-prototyping/blob/main/wit/wasi.wit\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/9dd544f96fba89189546b2650beabd3ab3b4ed1c\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f353032363431643766363930363937656636303738653234306164303031653634643465656162316535396365356564663230303364666431313565633462372f62797465636f6465616c6c69616e63652f70726576696577322d70726f746f747970696e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/preview2-prototyping/blob/main/wit/wasi.wit\" title=\"preview2-prototyping/wasi.wit at main · bytecodealliance/preview2-prototyping\">preview2-prototyping/wasi.wit at main · bytecodealliance/preview2-prototyping</a></div><div class=\"message_embed_description\">Polyfill adapter for preview1-using wasm modules to call preview2 functions. - preview2-prototyping/wasi.wit at main · bytecodealliance/preview2-prototyping</div></div></div>",
        "id": 313380149,
        "sender_full_name": "Joel Dice",
        "timestamp": 1669929821
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> Thanks! I hadn't seen that particular iteration (but I saw others that are very similar).</p>",
        "id": 313386118,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669931962
    },
    {
        "content": "<p>I'm happy to merge with anyone.</p>",
        "id": 313386162,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669931987
    },
    {
        "content": "<p>Is your dns, ip, and tcp stuff based on wasi-sockets, or is it different?</p>",
        "id": 313386661,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932127
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> Based on it, but modified for today's wit.</p>",
        "id": 313386753,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932173
    },
    {
        "content": "<p>The preview2-prototyping repo is the same as the old sunfishcode/preview1.wasm repo; it just recently renamed and move.</p>",
        "id": 313386791,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> I excluded UDP and rewrote the wasi-dns proposal to keep asynchronous DNS with descriptors rather than futures, etc.</p>",
        "id": 313386866,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> Most of my proposal borrowed from your old repo which I didn't see any action on. So now that the work has shifted elsewhere, I'm happy to merge.</p>",
        "id": 313387099,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932303
    },
    {
        "content": "<p>There seems to be a lot of interest from various people in helping move the design and implementation of Preview 2 forward.  I've been working on the host implementation in the <code>preview2-prototyping</code> repo referenced above, and Alex, Dan, and Pat (and others?) have been contributing to the polyfill on a daily basis.  Perhaps we should all get together and sync up so we're all pushing in the same direction.</p>",
        "id": 313387130,
        "sender_full_name": "Joel Dice",
        "timestamp": 1669932311
    },
    {
        "content": "<p><span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 313387167,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932330
    },
    {
        "content": "<p>Sounds good to me.</p>",
        "id": 313387175,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932335
    },
    {
        "content": "<p>I'm around right now if anyone else wants a quick chat</p>",
        "id": 313387195,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932344
    },
    {
        "content": "<p>There's a Component Model meeting tomorrow; would that be a good venue?  I can chat now, too.</p>",
        "id": 313387235,
        "sender_full_name": "Joel Dice",
        "timestamp": 1669932355
    },
    {
        "content": "<p>I could give you 15 minutes now.</p>",
        "id": 313387257,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932361
    },
    {
        "content": "<p>Maybe more if I check with my wife.</p>",
        "id": 313387331,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932375
    },
    {
        "content": "<p><a href=\"https://meet.jit.si/OrangePurpleLittleMountains\">https://meet.jit.si/OrangePurpleLittleMountains</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://meet.jit.si/OrangePurpleLittleMountains\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/050c7e43c0fc5dfcc5ba4105d6e634252586c236\\/68747470733a2f2f6d6565742e6a69742e73692f696d616765732f6a697473696c6f676f2e706e673f763d31)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://meet.jit.si/OrangePurpleLittleMountains\" title=\"Jitsi Meet\">Jitsi Meet</a></div><div class=\"message_embed_description\">Join a WebRTC video conference powered by the Jitsi Videobridge</div></div></div>",
        "id": 313387382,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932393
    },
    {
        "content": "<p>Alex, would you have time to join us?  You seem to have been working on this lately?</p>",
        "id": 313387392,
        "sender_full_name": "Joel Dice",
        "timestamp": 1669932398
    },
    {
        "content": "<p>sure yeah, I can join</p>",
        "id": 313387437,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1669932415
    },
    {
        "content": "<p>Also, the meeting tomorrow is also good.</p>",
        "id": 313387452,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1669932419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> <a href=\"mailto:nathaniel@profian.com\">nathaniel@profian.com</a></p>",
        "id": 313388382,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1669932761
    },
    {
        "content": "<p>Hi, what's the conclusion? I'm quite interested in next steps.</p>",
        "id": 313457778,
        "sender_full_name": "Marcin Kolny",
        "timestamp": 1669973354
    },
    {
        "content": "<p>yup, here as well. How do things fall out? :-)</p>",
        "id": 313498183,
        "sender_full_name": "Ralph",
        "timestamp": 1669987332
    },
    {
        "content": "<p>I was only there for the first part of the meeting, but it was mainly Dan and Nathaniel syncing up their respective Preview 2 WIT files and getting on the same page about how and why Preview 2 points the way to Component Model Values, Resources, Streams, and Futures without actually using any of those things (since they aren't baked yet).  Other themes:</p>\n<ul>\n<li>Moving away from implicit preopens and untyped ambient authorities towards a typed main entrypoint for commands</li>\n<li>Replace \"everything is a file descriptor\" and \"errno for all errors\" with more narrowly-scoped handles and error enums, respectively</li>\n<li>Nathaniel is especially interested in better socket support, so he's been focusing on that, with particular attention to edge cases, UDP/DTLS transparency, etc.</li>\n</ul>\n<p>More concretely, Nathaniel is going to merge his changes into the preview2-prototyping project linked to above, and that's where we'll collaborate going forward.<br>\nFurther discussion to follow in today's component model meeting.<br>\n<span class=\"user-mention\" data-user-id=\"260875\">@Nathaniel McCallum</span> <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> feel free to chime in if any of this is inaccurate or incomplete.</p>",
        "id": 313518919,
        "sender_full_name": "Joel Dice",
        "timestamp": 1669993546
    },
    {
        "content": "<p>thanks, Joel!</p>",
        "id": 313519600,
        "sender_full_name": "Ralph",
        "timestamp": 1669993744
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 313546897,
        "sender_full_name": "Marcin Kolny",
        "timestamp": 1670001238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> provided a very good summary. Let me add a few things that I take as even more important conclusions than the particular technical details:</p>\n<ol>\n<li>\n<p>We need to break compatibility with preview1 ASAP. There is significant risk of it becoming a de-facto standard. The longer we wait, the harder this becomes.</p>\n</li>\n<li>\n<p>The highest priority is getting preview2 to a place where it, and all future versions, can be polyfilled easily. This means we can break compatibility more regularly with a clear upgrade story.</p>\n</li>\n<li>\n<p>We also need to focus on the APIs that enable standard libraries to work. This is because they take the longest to integrate and have the most painful development cycle and the widest ranging impact. This particularly means networking.</p>\n</li>\n<li>\n<p>The more we discussed networking the more we came to agree that the corner cases are both real and substantial and that we should hem towards closeness to the Berkely API. Attempts to consolidate these APIs into very high level APIs may cause race conditions in <code>wasi-libc</code>. So, for example, we cannot combine <code>bind()</code> and <code>listen()</code>.</p>\n</li>\n</ol>",
        "id": 313549260,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1670001893
    },
    {
        "content": "<p>While I don't disagree about focusing on standard library APIs first I think there's still a long road to actually updating standard libraries to use these APIs. The component model itself is not really stable enough for that use case. This is why the <code>wasi_snapshot_preview1.wasm</code> is being developed, though, since that provides an easy means to define preview1 in terms of whatever preview2 currently is, which means there's no immediate pressure to update standard libraries</p>",
        "id": 313557608,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1670004223
    },
    {
        "content": "<p>I'm grateful for all the hard work going on here.</p>",
        "id": 313604694,
        "sender_full_name": "Ralph",
        "timestamp": 1670022191
    },
    {
        "content": "<p>Dan and I met today and discussed Preview 2 host implementation strategy, which helped clarify a few things for me.  Here are some notes both to aid my memory and in case anyone else is curious or has comments.</p>\n<ul>\n<li>The overall goal is to ship something quickly, so some of the original ambitions for Preview 2 are no longer in scope, and some things are being carried over from Preview 1 (e.g. the <code>WasiFile</code> trait) where there is no mature alternative yet available.</li>\n<li>As with the Preview 1 implementation, we're going to keep using the <code>cap-std</code> and <code>system-interface</code> where appropriate (mainly for <code>wasi-filesystem</code>) since the former provides valuable directory sandboxing and latter provides useful, well-tested OS abstractions.  If those abstractions cause pain as we implement Preview 2, we'll either fix them so they don't or come up with something better.</li>\n<li>We're going to pull a slimmed-down version of <code>wasi-common</code> into the <code>preview2-prototyping</code> repo, removing <code>wiggle</code>, the rights system, the poll_oneoff scheduler, and anything else that's no longer relevant, but keeping the <code>WasiFile</code> and <code>WasiDir</code> traits and impls to ease migration for embedders.  We will probably add/remove/modify methods in those traits as appropriate, but the basic shapes will be the same.</li>\n<li>Each interface that has functions which can return errors will have its own error enum covering only relevant cases.</li>\n<li>We will have separate handle types for each pseudo-resource (e.g. clocks, files, sockets), and each of these will have its own set of monomorphic functions (akin to resource methods).  In other words, the function for reading from a file will be different than the function for reading from a socket, etc.  In general, there will not be any polymorphic functions (e.g. a single function which can take multiple kinds of handles) unless those handles are wrapped in an enum type with a case for each possible handle type.</li>\n<li>As with the Preview 1 implementation, we'll use async everywhere even though the underlying <code>cap-std</code> functions are blocking, using a pseudo-executor for the blocking \"futures\" and the runtime's real executor (e.g. Tokio) for non-blocking <code>wasi-poll</code> futures.  The idea is to use something like Tokio for executing <code>poll-oneoff</code> futures instead of the existing, buggy <code>wasi-common</code> schedulers.  I'm handwaving a bit here -- happy to discuss it further.</li>\n<li>We're going to aim to make the core of the implementation runtime-agnostic, but the main priority is to ship something quickly, so we might need to compromise on that a bit if it slows things down.</li>\n</ul>",
        "id": 313607986,
        "sender_full_name": "Joel Dice",
        "timestamp": 1670023931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> Two requests:</p>\n<ol>\n<li>Let's pick an error return type for the default function implementations and use it everywhere. This is currently inconsistent.</li>\n<li>Let's use interior mutability everywhere. This will help with existing threading work. I know of only one blocker for this.</li>\n</ol>",
        "id": 313691186,
        "sender_full_name": "Nathaniel McCallum",
        "timestamp": 1670076089
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260875\">@Nathaniel McCallum</span> Can you give an example of the error return type inconsistency?  I'm only seeing <code>wasi_common::Error</code> everywhere at the moment, but I may be missing something.  Also, note that the plan is for each Preview 2 interface to have its own error enum type, so I expect that will be reflected in the implementations as well.  I'd actually like to get away from wrapping everything in an <code>anyhow::Error</code> and then downcasting later, since that's proven to be a source of bugs in the past (e.g. errors turned into traps when they shouldn't have been).</p>\n<p>Regarding interior mutability, I imagine we could remove <code>wasi_common::Table::get_mut</code> and let the compiler tell us what else needs to be changed.</p>",
        "id": 313992311,
        "sender_full_name": "Joel Dice",
        "timestamp": 1670252115
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"509936\">Joel Dice</span> <a href=\"#narrow/stream/219900-wasi/topic/preview2/near/313518919\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Replace \"everything is a file descriptor\" and \"errno for all errors\" with more narrowly-scoped handles and error enums, respectively</li>\n</ul>\n</blockquote>\n<p>why?</p>",
        "id": 318203565,
        "sender_full_name": "YAMAMOTO Takashi",
        "timestamp": 1672211008
    },
    {
        "content": "<p>To be sure, we'll continue to support POSIX APIs at the libc level. But at the WASI level, there are advantages to leveraging Wasm's static type system. In POSIX, and in fact in preview1, there are so many error codes, and in a lot of situations it's ambiguous which errno code is the right one to use. There are open issues about this in wasi-testsuite. And as WASI grows more features and more APIs, trying to maintain a single unified error code space will only get harder. And for file descriptors, at the WASI level, using distinct static types will let us use interface-type handles.</p>",
        "id": 318254537,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672233735
    },
    {
        "content": "<p>Instead of saying \"file descriptors are dynamically typed, you can pass anything to <code>read</code> and it'll work if the underlying resource can model itself as a stream of bytes\", the idea is to move to a model of \"there's a stream type, and any resource which can model itself as a stream can give you a stream view of itself\", at the WASI level. This will let us do things like connect distinct trust domains with streams without having to worry about whether one side might take advantage of dynamic typing to do non-stream things too. And it'll give us more flexibility when async and type-parameterized streams arrive.</p>",
        "id": 318256047,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672234368
    },
    {
        "content": "<p>Fun fact: a Unix program with stdout and stderr redirected can still print to the console:</p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>$ cat t.c\nint main<span class=\"o\">()</span> <span class=\"o\">{</span>\n    write<span class=\"o\">(</span><span class=\"m\">0</span>, <span class=\"s2\">\"Hello, World!\\n\"</span>, <span class=\"m\">14</span><span class=\"o\">)</span><span class=\"p\">;</span>\n<span class=\"o\">}</span>\n$ gcc -w t.c\n$ ./a.out &gt; /dev/null <span class=\"m\">2</span>&gt; /dev/null\nHello, World!\n$\n</code></pre></div>\n<p>This is possible on Unix because of the dynamic-typing nature of file descriptors.</p>",
        "id": 318256170,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672234431
    },
    {
        "content": "<p>does it mean a rather big switch statement in eg. libc read(), which can ends up with importing things which the app doesn't actually use?</p>",
        "id": 318418288,
        "sender_full_name": "YAMAMOTO Takashi",
        "timestamp": 1672320494
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"254083\">Dan Gohman</span> <a href=\"#narrow/stream/219900-wasi/topic/preview2/near/318256170\">said</a>:</p>\n<blockquote>\n<p>Fun fact: a Unix program with stdout and stderr redirected can still print to the console:</p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>$ cat t.c\nint main<span class=\"o\">()</span> <span class=\"o\">{</span>\n    write<span class=\"o\">(</span><span class=\"m\">0</span>, <span class=\"s2\">\"Hello, World!\\n\"</span>, <span class=\"m\">14</span><span class=\"o\">)</span><span class=\"p\">;</span>\n<span class=\"o\">}</span>\n$ gcc -w t.c\n$ ./a.out &gt; /dev/null <span class=\"m\">2</span>&gt; /dev/null\nHello, World!\n$\n</code></pre></div>\n<p>This is possible on Unix because of the dynamic-typing nature of file descriptors.</p>\n</blockquote>\n<p>i even have a hack to pass a listening socket as fd 0 to a wasm instance. <a href=\"https://github.com/yamt/garbage/blob/3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9/wasm/httpd/test.sh#L3\">https://github.com/yamt/garbage/blob/3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9/wasm/httpd/test.sh#L3</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/yamt/garbage/blob/3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9/wasm/httpd/test.sh#L3\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/628cbedbe7050666b5e085e7d65898b245a7f40a\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f323039613865353733613331353065336335343063356436363232366337363965333337363162633465316630633137333036313364616435343538633964332f79616d742f67617262616765)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/yamt/garbage/blob/3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9/wasm/httpd/test.sh#L3\" title=\"garbage/test.sh at 3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9 · yamt/garbage\">garbage/test.sh at 3618fbf5f5c9a6bdd28e950f4d240eadd52ef7c9 · yamt/garbage</a></div><div class=\"message_embed_description\">My random garbage. Contribute to yamt/garbage development by creating an account on GitHub.</div></div></div>",
        "id": 318418907,
        "sender_full_name": "YAMAMOTO Takashi",
        "timestamp": 1672320698
    },
    {
        "content": "<p>Switch statement yes, but if we structure it right, with strategic use of weak symbols, we can avoid pulling in imports the app doesn't need.</p>",
        "id": 318449121,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672331363
    },
    {
        "content": "<p>i can't think of \"strategic use of weak symbols\" which can solve it. can you explain a bit?<br>\nmy concern is that, with a naive implementation like the following, all <code>wasi_type_?_op_a</code> will be imported if an app uses <code>libc_op_a</code>.</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"n\">libc_op_a</span><span class=\"p\">(</span><span class=\"n\">int</span><span class=\"w\"> </span><span class=\"n\">fd</span><span class=\"p\">)</span><span class=\"w\"></span>\n<span class=\"p\">{</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"n\">switch</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"n\">get_type</span><span class=\"p\">(</span><span class=\"n\">fd</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"n\">case</span><span class=\"w\"> </span><span class=\"n\">x</span>: <span class=\"nc\">wasi_type_x_op_a</span><span class=\"p\">(</span><span class=\"o\">..</span><span class=\"p\">.);</span><span class=\"w\"> </span><span class=\"k\">break</span><span class=\"p\">;</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"n\">case</span><span class=\"w\"> </span><span class=\"n\">y</span>: <span class=\"nc\">wasi_type_y_op_a</span><span class=\"p\">(</span><span class=\"o\">..</span><span class=\"p\">.);</span><span class=\"w\"> </span><span class=\"k\">break</span><span class=\"p\">;</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"n\">case</span><span class=\"w\"> </span><span class=\"n\">z</span>: <span class=\"nc\">wasi_type_z_op_a</span><span class=\"p\">(</span><span class=\"o\">..</span><span class=\"p\">.);</span><span class=\"w\"> </span><span class=\"k\">break</span><span class=\"p\">;</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"p\">}</span><span class=\"w\"></span>\n<span class=\"p\">}</span><span class=\"w\"></span>\n</code></pre></div>",
        "id": 318510299,
        "sender_full_name": "YAMAMOTO Takashi",
        "timestamp": 1672364345
    },
    {
        "content": "<p>do you mean to apply what we do for <code>chdir</code> and <code>__wasilibc_find_relpath_alloc</code> to <code>libc_open_type_x</code> and <code>wasi_type_x_op_???</code>?</p>",
        "id": 318510842,
        "sender_full_name": "YAMAMOTO Takashi",
        "timestamp": 1672364847
    },
    {
        "content": "<p>One part of it is that ops like read and write operate on streams, so there won't be a separate read/write for each resource type. Resources that want to support read and write will just produce a stream rather than having their own read and write functions.</p>",
        "id": 318721899,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672486375
    },
    {
        "content": "<p>Another part of it is the actual weak symbol trick. Eg. for sockets, any program that needs sockets support (and not just operating on a stream) will have a call to accept, connect, listen, or similar, and then we can functions defined in the same .o files which override weak symbols in libc to add sockets support.</p>",
        "id": 318722571,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1672486717
    }
]