[
    {
        "content": "<p>The recommended way (<a href=\"https://github.com/WebAssembly/WASI/blob/main/docs/WitInWasi.md#streams\">https://github.com/WebAssembly/WASI/blob/main/docs/WitInWasi.md#streams</a>) to pass data from one component to an other is by a combination of io:poll and read.<br>\nSadly this means that the interface is asymmetric, as the sender has to create a non-standard \"futex like\" pollable with the host and pass it to the reader - and there is significant communication overhead (reader component calls poll, writer calls \"wake\", reader awakes and invokes the read of the writer component) per transmitted date.</p>\n<p>So I sat down and designed a consumer-side resource which the reader passes to the subscribe function and the writer calls the \"ready(data)\" method on whenever there is new data available. This looks neat on paper, but you introduce a cyclic component dependency as the callback interface is imported by the sender from the reader and the data-source interface is imported by the reader from the sender.<br>\nThis cyclic dependency isn't supported by the current component tooling. But even if it were, the Rust bindgen will additionally expect an imported resource type when passing arguments to an imported function.</p>\n<p>I know this is trying to introduce optimizations from the preview3 async proposal into preview2, but can you think of a way to realize a similar symmetric inter-component callback mechanism with preview2?</p>",
        "id": 404945584,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701290200
    },
    {
        "content": "<p>first off, that WitInWasi doc is sufficiently out of date that i think we should just remove it and maybe someone can take on the project of rewriting it</p>",
        "id": 404945911,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290339
    },
    {
        "content": "<p>its unfortunate that streams arent very nice to use between components in preview 2, but its just the restrictions of the component model type system</p>",
        "id": 404945948,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290358
    },
    {
        "content": "<p>elsewhere i discussed \"onion composition\" between components that need to export io, or interfaces depending on io... let me find the link</p>",
        "id": 404945997,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290380
    },
    {
        "content": "<p><a href=\"#narrow/stream/219900-wasi/topic/.60wasi-http.60.20middleware.20is.20infeasible.3F/near/402083142\">https://bytecodealliance.zulipchat.com/#narrow/stream/219900-wasi/topic/.60wasi-http.60.20middleware.20is.20infeasible.3F/near/402083142</a></p>",
        "id": 404946110,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290427
    },
    {
        "content": "<p>Oh, I feared that the \"middleware\" thread discussed this problem, I was hoping  for a nice solution with bidirectional resource method calls and no extensive glue code between the components.</p>",
        "id": 404946631,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701290664
    },
    {
        "content": "<p>unfortunately, for anything that involves transferring control flow between components (i.e. anything that needs to measure readiness using pollables) theres just not a good way to do it in preview 2</p>",
        "id": 404946742,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290713
    },
    {
        "content": "<p>By the way, did I miss this component-to-component-activation pollable in the current WASI propsals, or did simply no-one run into this situation before.</p>",
        "id": 404947153,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701290891
    },
    {
        "content": "<p>when i say pollable i mean <code>wasi/io.poll.{pollable}</code></p>",
        "id": 404947329,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701290982
    },
    {
        "content": "<p>we've been aware of this situation for a while (i remember we had a long discussion about it in may of this year) but we're just sorta stuck getting something that doesnt solve it shipped before we can go into solving it</p>",
        "id": 404947472,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291030
    },
    {
        "content": "<p>E.g.    <code>resource { constructor(); get-pollable: func() -&gt; pollable; wake: func(); }</code>to create an io compatible pollable to pass to from the writer the reader</p>",
        "id": 404947547,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701291064
    },
    {
        "content": "<p>so basically, in preview 2, component composition needs to either be entirely synchronous stuff (e.g. the classic example we use that is a markdown renderer with <code>render: func(string) -&gt; string</code></p>",
        "id": 404947570,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291072
    },
    {
        "content": "<p>or it needs to be onion</p>",
        "id": 404947599,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291087
    },
    {
        "content": "<p>right, so you cant export a <code>pollable</code> from that function without exporting the wasi:io package entirely</p>",
        "id": 404947634,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291103
    },
    {
        "content": "<p>a <code>pollable</code> needs to come from the exact same place that implements <code>wasi:io/poll.poll</code></p>",
        "id": 404947673,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291120
    },
    {
        "content": "<p>and thats basically the \"magic\" function that takes control flow away until progress is made</p>",
        "id": 404947739,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291134
    },
    {
        "content": "<p>so that function must be the \"parent\" of your component, basically.</p>",
        "id": 404947786,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291160
    },
    {
        "content": "<p>in the sense that it provides all the exports of <code>io</code> and every other package that depends on <code>io</code> to your component.</p>",
        "id": 404947973,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1701291233
    },
    {
        "content": "<p>(Thinking about an onion way to express communication middleware for publisher/subscriber, including wrapping io)</p>",
        "id": 404948387,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701291373
    },
    {
        "content": "<p>Thank you for the clarification, I can't wait to see future and stream support in preview3 ...</p>",
        "id": 404948586,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701291461
    },
    {
        "content": "<p>Creating a pollable/waker pair could be added to io/poll with small additional effort, couldn't it?</p>",
        "id": 404949251,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701291692
    },
    {
        "content": "<p>How would such a thing be used?  If a component is blocked waiting for the pollable, there's no way the waker could be triggered since there's currently no notion of threads or reentrancy in the component model.</p>",
        "id": 404953996,
        "sender_full_name": "Joel Dice",
        "timestamp": 1701293809
    },
    {
        "content": "<p>Good point, I now realize that I was modeling the components running in separate (cooperative) stacks, which strangely is what my applications require. This can only work if poll switches between contexts, which I took for granted.</p>",
        "id": 404955340,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701294459
    },
    {
        "content": "<p>Yes, and that's essentially what the service chaining approach I described earlier requires:</p>\n<blockquote>\n<p>Second, you can always do service chaining the old-fashioned way by having the middleware component do an outbound HTTP request to the service component (which the host might optimize if it notices the service can be invoked without using the network at all). I.e. you don't need component composition to do service chaining, and you probably won't want to use it for that until Preview 3.</p>\n</blockquote>\n<p>When you have two components running in separate fibers, it's easy enough to connect their concurrent I/O operations using e.g. a buffered, in-memory channel.</p>",
        "id": 404956038,
        "sender_full_name": "Joel Dice",
        "timestamp": 1701294832
    },
    {
        "content": "<p>Ok, I see, these are the preview3 fibers. I guess I aim far beyond preview2.</p>",
        "id": 404956103,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701294850
    },
    {
        "content": "<p>Yeah, I think a lot of us are going to rig up a poor man's version of component model async before the real thing arrives :)</p>",
        "id": 404956216,
        "sender_full_name": "Joel Dice",
        "timestamp": 1701294911
    },
    {
        "content": "<p>Update: I undid the callback optimizations (very similar to slide 11 of the CM async proposal) which require criss-cross linking and went back to exchanging a pollable. A prototype app worked well.</p>\n<p>Thank you for the explanations and support!</p>\n<p>PS: I genuinely need multiple stacks because the communicating C++|Rust SOA Applications each bring their own main loop.</p>",
        "id": 405197845,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701376860
    },
    {
        "content": "<p>PPS: I guess I will be an early adopter of preview3 prototypes.</p>",
        "id": 405198018,
        "sender_full_name": "Christof Petig",
        "timestamp": 1701376925
    },
    {
        "content": "<p>You may be interested in <a href=\"#narrow/stream/219900-wasi/topic/.60wasi-http.60.20middleware.20is.20infeasible.3F/near/405409409\">the prototype I posted in the middleware topic</a> which uses the runtime to do a bit of async cooperation between two components.</p>",
        "id": 405409791,
        "sender_full_name": "Ryan Levick (rylev)",
        "timestamp": 1701452268
    }
]