[
    {
        "content": "<p>how would you implement systemd socket activation with wasi, both as a host and as a guest? as far as we can tell, wasi and systemd socket activation are mutually exclusive/incompatible. is this something that could be resolved in a future wasi version?</p>",
        "id": 430478046,
        "sender_full_name": "Soni L.",
        "timestamp": 1711892836
    },
    {
        "content": "<p>wasi is not virtualizing a linux system, you will never be able to \"run a systemd instance inside the virtualized container\", I don't think this can directly be supported</p>",
        "id": 430484234,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1711898163
    },
    {
        "content": "<p>I think the idea of OP is to have a socket activated systemd service which runs the wasm module using wasmtime and then have this wasm module get access to the socket on which it can listen for (web) requests.</p>",
        "id": 430489738,
        "sender_full_name": "bjorn3",
        "timestamp": 1711902840
    },
    {
        "content": "<p>that's almost purely a host thing then, but everything I found about systemd socket activation says the protocol is based on a systemd running on the host and in the guest, so I was wondering if that aspect was important</p>",
        "id": 430490315,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1711903297
    },
    {
        "content": "<p>uh? wasmtime (or some embedder or whatever) is the wasi host, the wasm program is the wasi guest</p>",
        "id": 430490684,
        "sender_full_name": "Soni L.",
        "timestamp": 1711903602
    },
    {
        "content": "<p>With Socket activation systemd itself creates a socket, and polls it for incoming requests. When an incoming request happens it will start the associated service and pass it the socket as fd using the listenfd protocol (which is basically having the child inherit the fd and setting an env var to tell the child about it.) Listenfd support already exists in Wasmtime. As I understand there is a conflict between the fd assignments required by listenfd and by wasi though. Listenfd expects the first fd to be passed as fd 3, but wasi starts preopened directories from fd 3, so you can't easily have both preopened directories and listenfd support.</p>",
        "id": 430490846,
        "sender_full_name": "bjorn3",
        "timestamp": 1711903757
    },
    {
        "content": "<p>Wasip2 uses resource handles rather than integer fd's. For getting handles to all preopens there is now <code>preopens.get-directories</code>. For getting handles to the listenfd fds I think there will need to be a separate interface defined.</p>",
        "id": 430491078,
        "sender_full_name": "bjorn3",
        "timestamp": 1711903949
    },
    {
        "content": "<p>ahh</p>",
        "id": 430491363,
        "sender_full_name": "Soni L.",
        "timestamp": 1711904203
    },
    {
        "content": "<p>(yeah we're not particularly familiar with p2 yet... we can't even wrap our head around wasm components .-.)</p>",
        "id": 430491414,
        "sender_full_name": "Soni L.",
        "timestamp": 1711904258
    },
    {
        "content": "<p>we've never heard of \"listenfd protocol\" tho, that seems to be a rust-specific thing (a crate that implements the systemd socket activation protocol)</p>",
        "id": 430491583,
        "sender_full_name": "Soni L.",
        "timestamp": 1711904408
    },
    {
        "content": "<p>With \"the listenfd protocol\" I mean the protocol used by <a href=\"https://www.freedesktop.org/software/systemd/man/latest/sd_listen_fds.html\">https://www.freedesktop.org/software/systemd/man/latest/sd_listen_fds.html</a></p>",
        "id": 430491650,
        "sender_full_name": "bjorn3",
        "timestamp": 1711904475
    },
    {
        "content": "<p><a href=\"https://docs.rs/listenfd/latest/listenfd/\">https://docs.rs/listenfd/latest/listenfd/</a> as you assumed it's the Rust library that handles working with external sockets</p>",
        "id": 430491656,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1711904476
    },
    {
        "content": "<p>(I'll stop spreading half-knowledge)</p>",
        "id": 430491672,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1711904499
    },
    {
        "content": "<p>The <code>listenfd</code> rust crate indeed implements this protocol though.</p>",
        "id": 430491673,
        "sender_full_name": "bjorn3",
        "timestamp": 1711904501
    },
    {
        "content": "<p>we discussed this briefly with sunfish and it seems like it would be best to keep it consistent with dir preopens (in wasip2), so you'd probably have an interface you'd call to get the socket handles. (as opposed to passing them into run.) thanks btw</p>",
        "id": 430882218,
        "sender_full_name": "Soni L.",
        "timestamp": 1712095413
    }
]