[
    {
        "content": "<p>Hi, seems like there's been quite a lot of movement on the wasi-sockets standard. Is there any public facing work done on implementing this in wasmtime? I'm interested in understanding how it's being implemented and /or contributing towards this.</p>",
        "id": 349408125,
        "sender_full_name": "Daniel Blignaut",
        "timestamp": 1681484127
    },
    {
        "content": "<p><a href=\"https://github.com/bytecodealliance/preview2-prototyping\">https://github.com/bytecodealliance/preview2-prototyping</a> is where we're working on a host implementation for wasi-sockets. It's early, but it's complete enough to accept and connect and send and receive</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/preview2-prototyping\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/86106e02861ec52ee7428546eee0491c0b84eee3\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f656366333931616163383534373833663363663236326535336661386639653964666264663965376661323031663239613636373066643039616538373334662f62797465636f6465616c6c69616e63652f70726576696577322d70726f746f747970696e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/preview2-prototyping\" title=\"GitHub - bytecodealliance/preview2-prototyping: Polyfill adapter for preview1-using wasm modules to call preview2 functions.\">GitHub - bytecodealliance/preview2-prototyping: Polyfill adapter for preview1-using wasm modules to call preview2 functions.</a></div><div class=\"message_embed_description\">Polyfill adapter for preview1-using wasm modules to call preview2 functions. - GitHub - bytecodealliance/preview2-prototyping: Polyfill adapter for preview1-using wasm modules to call preview2 func...</div></div></div>",
        "id": 349866098,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681485462
    },
    {
        "content": "<p>In particular, the full socket+bind+listen+accept sequence works.</p>",
        "id": 349866715,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681485604
    },
    {
        "content": "<p>thank you. I'll start reading through and getting to grips with it. I haven't read through the full spec but given that there's deviations from \"native\" socket libs (e.g. getaddrinfo not implemented)... do you see a path where rust libraries like tokio, h2, etc. can be ported to wasm32-wasi targets or do you think there'll need to be major changes to add wasm target support?</p>",
        "id": 349996750,
        "sender_full_name": "Daniel Blignaut",
        "timestamp": 1681489942
    },
    {
        "content": "<p>Yes, the vision is that wasi-sockets should be able to look like \"normal\" sockets to Rust and other languages. Polling/async will need some special considerations, but that's already the case for all platforms out there.</p>",
        "id": 349997684,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681490206
    },
    {
        "content": "<p>And while wasi-sockets doesn't have a full <code>getaddrinfo</code>, it does have <a href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/ip-name-lookup.wit\">name resolution</a>, which should support an implementation of <code>getaddrinfo</code> which should look pretty normal to applications.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/ip-name-lookup.wit\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/5da1739c6f34e4626c56909edce7663dea732717\\/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f663935633237643361633735393131316539316661353034663635633536383264643232643963346162393165383866353965653339643563633934613832372f576562417373656d626c792f776173692d736f636b657473)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/wasi-sockets/blob/main/wit/ip-name-lookup.wit\" title=\"wasi-sockets/ip-name-lookup.wit at main · WebAssembly/wasi-sockets\">wasi-sockets/ip-name-lookup.wit at main · WebAssembly/wasi-sockets</a></div><div class=\"message_embed_description\">WASI API proposal for managing sockets. Contribute to WebAssembly/wasi-sockets development by creating an account on GitHub.</div></div></div>",
        "id": 349998723,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681490512
    },
    {
        "content": "<p>yes, I did read and watch your last youtube video talking through the spec so that makes sense to me just wasn't sure how hard the \"adapter\" layer would be to implement to support popular crates currently used</p>",
        "id": 349999051,
        "sender_full_name": "Daniel Blignaut",
        "timestamp": 1681490598
    },
    {
        "content": "<p>I'm working on getting a preview2-enabled libc up and running, and then I plan to add sockets support there, which will mean implementing the actual POSIX APIs on top of wasi-sockets. Once we have that, I expect a lot of stuff will Just Work.</p>",
        "id": 349999510,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681490743
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"206238\" href=\"/#narrow/stream/206238-general/topic/wasi-sockets\">#general &gt; wasi-sockets</a> by <span class=\"user-mention silent\" data-user-id=\"253990\">fitzgen (he/him)</span>.</p>",
        "id": 350000352,
        "sender_full_name": "Notification Bot",
        "timestamp": 1681490946
    },
    {
        "content": "<p>I noticed that APIs such as sock-bind and sock-listen are imported in the preview-2. I thought that the reason why wasmtime use the pre-open sockets is to decrease the Nondeterminism. How is Nondeterminism considered in these APIs?</p>\n<p>I'm also curious about the Nondeterminism in the sock-accept API. Is it handled by the wasm runtime or it is unavoidable and we just allow it?</p>",
        "id": 350944659,
        "sender_full_name": "Hongyu Li",
        "timestamp": 1681883128
    },
    {
        "content": "<p>Historically, it turns out that the lack of bind/connect in WASI is more a result of non-technical circumstances than technical constraints. Some host environments don't need or want bind/connect, but others do, so it's desirable to have them as an option for those that do.</p>",
        "id": 351018401,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681904313
    },
    {
        "content": "<p>The \"just accept\" API does have less nondeterminism than full bind/connect, though in use cases that want just accept, I'd say it's more about giving the host more control over the listening socket than about nondeterminism per se.</p>",
        "id": 351018606,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1681904373
    },
    {
        "content": "<p>Thanks for the explanation! BTW, I want to add some RDMA APIs to the wasi, they will bring some nondeterminism. Is there a way to verify that the nondeterminism brought by my APIs is unavoidable or acceptable?</p>",
        "id": 352572199,
        "sender_full_name": "Hongyu Li",
        "timestamp": 1682436675
    },
    {
        "content": "<p>The nondeterminism brought by my APIs can be divided into two parts:</p>\n<ol>\n<li>Some of the wasi-rdma APIs are also network related. If the wasi-sock APIs which bring nondeterminism are accepted by the community, does it means I don't need to worry about the nondeterminism brought by the wasi-rdma APIs?</li>\n<li>Meanwhile, the wasi-rdma will also bring nondeterminism due to the shared-memory model and the client-server model. Is this acceptable for the wasi?</li>\n</ol>",
        "id": 352574795,
        "sender_full_name": "Hongyu Li",
        "timestamp": 1682437242
    },
    {
        "content": "<p>For WASI, I think it works best to think about nondeterminism from the perspective of specific use cases.</p>",
        "id": 352584331,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1682439494
    },
    {
        "content": "<p>wasi-sockets has a lot of well-understood use cases which are ok with the nondeterminism inherent to sockets. They can fail, they can take variable amounts of time, they can have varying metadata, and so on, and sockets applications are prepared to accept this.</p>",
        "id": 352584691,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1682439603
    },
    {
        "content": "<p>WASI as a whole has other use cases which are not ok with that kind of nondeterminism, but what we say is, those use cases should avoid using wasi-sockets. The Worlds mechanism lets people define their own virtual environments with just the APIs they need, and exclude those that don't make sense for their use cases.</p>",
        "id": 352585103,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1682439722
    },
    {
        "content": "<p>So if you have a new API, instead of asking \"is this level of nondeterminism ok with everyone?\", we can ask \"do you have enough use cases that are ok with this level of nondeterminism?\".</p>",
        "id": 352586040,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1682439969
    },
    {
        "content": "<p>Now, all that said, with any kind of shared memory, the concern I expect WASI as a whole will have is <em>virtualizability</em>, rather than determinism. Shared memory means that messages can be sent via loads and stores which can't be intercepted by an intermediary, so it's not possible to virtualize/wrap/interpose/polyfill/etc. an API that includes exposed shared memory.</p>",
        "id": 352587310,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1682440284
    }
]