[
    {
        "content": "<p>I would like to make some changes to the error handling code in wasmtime's wasi-sockets implementation. Mainly to simplify mapping back-and-forth between the BSD error codes. As part of this change I would also like to change some error codes defined in the wasi-sockets proposal (which I'm the champion of).</p>\n<p>I've noticed with other WASI proposals, that sometimes changes are first made in the wasmtime repo with updates to both the implementation _and_ their copy of the spec (<code>/crates/wasi/wit/...</code>) within the same PR. And then later the proposal repo is updated, retroactively.</p>\n<p>With the changes I have in mind, this seems the most pragmatic approach because they're implementation driven.<br>\nAre there any guidelines on this practice for me to follow?</p>",
        "id": 391472792,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694940459
    },
    {
        "content": "<p>for a while we let the wit in wasmtime and the spec diverge pretty far, because we were in a \"prototype\" stage, but since we are now getting close to shipping p2, ive been trying to make a PR to wasmtime with local spec + implementation changes, and simultaneously make a PR to the spec repos upstream with whatever changes, and I leave links between the two issues</p>",
        "id": 391566621,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694981378
    },
    {
        "content": "<p>imo, specs that haven't yet had implementation-driven changes are not yet mature specs. its only by implementing and testing the specs, and iterating based on what we learn there, that specs become mature. so, be glad we are at this stage!</p>",
        "id": 391566829,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694981494
    },
    {
        "content": "<p>Alright, thanks! The past few days I've been working on a test suite for the TCP socket implementation, along with some associated tweaks to the implementation. I hope have a PR ready somewhere the coming week.</p>",
        "id": 391568490,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694982519
    },
    {
        "content": "<p>oh, wrt errors, i have mentioned this noodling to dan and others but i dont think to you</p>",
        "id": 391568563,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982569
    },
    {
        "content": "<p>so, first off, we redesigned output-streams to have <code>last-operation-failed</code> and <code>closed</code> as distinct errors</p>",
        "id": 391568590,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982590
    },
    {
        "content": "<p>i want to do the same thing to input-stream, especially this is informed by implementing http stuff</p>",
        "id": 391568626,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982603
    },
    {
        "content": "<p>the other thing i want to do, after we switch over to resources, is to make <code>last-operation-failed</code> have a payload <code>stream-error-cause</code> resource</p>",
        "id": 391568694,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982635
    },
    {
        "content": "<p>and that has a method <code>describe() -&gt; option&lt;string&gt;</code> that gives debug info, and the docs say you have to promise to not use that for control flow, just for displaying debug info, so that we dont get into the bad game of strings needing to be identical across engines/implementations</p>",
        "id": 391568768,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982689
    },
    {
        "content": "<p>and then we can also have sockets be able to elaborate it into some more particular error</p>",
        "id": 391568782,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982701
    },
    {
        "content": "<p>e.g. a <code>resource tcp { elaborate(stream-error-cause) -&gt; option&lt;more-specific-error-enum&gt; }</code></p>",
        "id": 391568868,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982727
    },
    {
        "content": "<p>Good to know! The changes I have so far don't impact streams, but rather the methods on the socket resource themselves (bind, accept, listen, connect, etc...)</p>",
        "id": 391568909,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694982770
    },
    {
        "content": "<p>returning the option because its ok for the tcp to say \"i dont know anything about that error\" because perhaps it came from some other place</p>",
        "id": 391568926,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982787
    },
    {
        "content": "<p>ok! good to know</p>",
        "id": 391568953,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982805
    },
    {
        "content": "<p>i think for http we want this to be able to elaborate on what sort of protocol errors happened</p>",
        "id": 391568973,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982815
    },
    {
        "content": "<p>we havent worked out all the details yet</p>",
        "id": 391568998,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982827
    },
    {
        "content": "<p>it seems more useful when you have some sort of more complex protocol that is being used via a stream, vs files and sockets which are low level enough where theres really not many reasons a stream can go wrong</p>",
        "id": 391569083,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982862
    },
    {
        "content": "<p>Just for my information, is this an inbetween solution until proper Preview3 <code>stream</code>s are a thing?</p>",
        "id": 391569158,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694982949
    },
    {
        "content": "<p>i think so, yeah</p>",
        "id": 391569165,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982958
    },
    {
        "content": "<p>the way i see preview3 streams right now is that theyre something we need one day, but we cant really design them until we see how the preview 2 streams end up getting used in implementations</p>",
        "id": 391569238,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694982998
    },
    {
        "content": "<p>so rather than anticipate what theyre going to look like, we're going to try to make preview 2 streams work as nicely as we can with all the things we need to implement right now, and then figure out the path to preview 3 when the time comes.</p>",
        "id": 391569279,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694983034
    },
    {
        "content": "<p>make sense</p>",
        "id": 391569309,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694983065
    },
    {
        "content": "<p>same basic attitude as i said above, that a spec is only mature as you iterate on it with the things that come up in implementation.</p>",
        "id": 391569323,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694983078
    },
    {
        "content": "<p>Can there be multiple <code>last-operation-failed</code>s on a single stream without having to terminate the stream?</p>",
        "id": 391569895,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694983347
    },
    {
        "content": "<p>nope - we're defining streams that, once theres any failure, theyre closed forever</p>",
        "id": 391569946,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694983364
    },
    {
        "content": "<p>we havent found any cases where that didnt work</p>",
        "id": 391569981,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694983372
    },
    {
        "content": "<p>I have two :P</p>",
        "id": 391570024,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694983382
    },
    {
        "content": "<p>Instead of having an <code>accept</code> method you'd need to continuously poll, I'd love to have a way to (somehow) have <code>listen</code> return a stream of newly accepted client socket resources. The problem is that <code>accept</code> can return transient errors like ECONNABORTED. This can be an indicator to the application that the listen queue is filling up. At the moment the spec dictates that these temporary error must be skipped over, precisely because of the envisioned fail-once/closed-forever semantics.</p>",
        "id": 391571153,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694983943
    },
    {
        "content": "<p>An other is UDP send&amp;receive. Those are currently methods sending individual datagrams, but \"ideally\" I would like to have a stream of datagrams in the future</p>",
        "id": 391571287,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694984022
    },
    {
        "content": "<p>I understand that those use cases are not relevant at the moment, because we're only dealing with byte streams. But they might become relevant in the future?</p>",
        "id": 391571799,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694984286
    },
    {
        "content": "<p>Alternative for the <code>accept</code> stream specifically could be to explicitly model errors as messages in the stream. Eg. <code>listen() -&gt; stream&lt;variant { temp-error(code), new-client(sock-resource) }&gt;</code></p>",
        "id": 391572199,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694984480
    },
    {
        "content": "<p>But I don't know if that alternative generalizes well for cases where the error may occur while writing/pushing items to a stream. (The UDP Send stream example)</p>",
        "id": 391572662,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1694984658
    },
    {
        "content": "<p>ah, yes, i see what you mean now. i think as we generalize streams to arbitrary datatypes we'll be able to support what you describe</p>",
        "id": 391596751,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1694999992
    },
    {
        "content": "<p>we definitely have places where that sort of semantics is required, e.g. readdir's pseudo-stream</p>",
        "id": 391596884,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1695000056
    },
    {
        "content": "<p>but for bytestreams, we havent found that yet.</p>",
        "id": 391596962,
        "sender_full_name": "Pat Hickey",
        "timestamp": 1695000105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"378155\">@Badeend</span> With Preview 3's typed streams, we can have the stream element type be a <code>result</code>, which would be a way to report <code>accept</code> errors without having the stream as a whole fail.</p>",
        "id": 391729772,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1695052319
    },
    {
        "content": "<p>The same applies to modelling UDP datagrams as streams.</p>",
        "id": 391729908,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1695052354
    },
    {
        "content": "<p>Yeah, that's more or less what I thought too (above)</p>",
        "id": 391757844,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1695063212
    },
    {
        "content": "<p>I'll change the implementation &amp; spec to allow for these errors</p>",
        "id": 391758014,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1695063295
    }
]