[
    {
        "content": "<p>I would like to discus few failure scenarios around futures and streams. </p>\n<p>let's assume function <code>add: func(a: u8, b: u8) -&gt; u8</code>;</p>\n<p>I think that when you consume p3 method as async, the future/promise/Task you get could be rejected/failed by producer side and the caller will receive <code>error-context</code> which they could handle, right ? This is nice.</p>\n<p>A) I would like to understand what happens when producer component exports it as async, therefore fallible and consuming component <strong>imports it as synchronous</strong>, therefore un-fallible. What happens to consumer when the producer rejects the promise ? Is the consumer instance going to trap/abort ?</p>\n<p>B) It could also happen that the implementation would be virtualized by wRPC, which would introduce failures (of networking) into this contract.</p>\n<p>Easy answer would be to proclaim that we should always consume imports as async, when we know that it could be remote. This forces async \"color\" to your functions. It also introduces unexpected latency.</p>\n<p>But that's not an answer for sync components that get dependencies remote-virtualized unknowingly. </p>\n<p>I'm worried that in this way wRPC is introducing impedance mismatch in DCOM way.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"253998\">@Luke Wagner</span> <span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span> <span class=\"user-mention\" data-user-id=\"484032\">@Roman Volosatovs</span></p>",
        "id": 483295160,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1732031329
    },
    {
        "content": "<p>My understanding is that <code>error-context</code> is used with streams/futures but not tasks. Tasks <em>themselves</em> can only fail by returning an explicit error <code>result</code> or trapping.</p>",
        "id": 483304743,
        "sender_full_name": "Lann Martin",
        "timestamp": 1732033890
    },
    {
        "content": "<p>I was thinking C# <code>Task</code> in text above as marshaled from <code>future</code>. Sorry for confusion.</p>",
        "id": 483314439,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1732036488
    },
    {
        "content": "<p>In context of wRPC, the bindgen generates a fallible signature (e.g. your <code>add</code> function import would return <code>anyhow::Result&lt;u8&gt;</code>)</p>\n<p>If any async value is used in import in either parameter or result tuple, the bindgen will return an additional value - an I/O driver - a future, which must be polled - that future may fail (IIRC with <code>std::io::Error</code> directly)</p>",
        "id": 483334208,
        "sender_full_name": "Roman Volosatovs",
        "timestamp": 1732043036
    },
    {
        "content": "<p>So, wRPC is not usable as virtualization of existing WIT ?</p>",
        "id": 483335093,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1732043367
    },
    {
        "content": "<p>wRPC is a general-purpose RPC framework, it's not anyhow specific to WebAssembly. It is built on WIT though, so being able to use existing WIT is precisely the use case.</p>\n<p>Not sure exactly what you're asking.</p>\n<p>If we're talking about \"polyfilling\" Wasm component imports, then RPC protocol choice here seems pretty arbitrary and hiding fallible network I/O underneath it is a bad idea regardless of the RPC protocol chosen</p>",
        "id": 483335604,
        "sender_full_name": "Roman Volosatovs",
        "timestamp": 1732043550
    },
    {
        "content": "<p>Generally, you would want a local entity exporting an interface (a host plugin) and converting the transport layer errors into application layer ones</p>",
        "id": 483335832,
        "sender_full_name": "Roman Volosatovs",
        "timestamp": 1732043643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"484032\">Roman Volosatovs</span> <a href=\"#narrow/channel/219900-wasi/topic/WASIp3.20async.20fallibility.20.26.20wRPC/near/483335604\">said</a>:</p>\n<blockquote>\n<p>If we're talking about \"polyfilling\" Wasm component imports, then RPC protocol choice here seems pretty arbitrary and hiding fallible network I/O underneath it is a bad idea regardless of the RPC protocol chosen</p>\n</blockquote>\n<p>Thank you for clarifying, I was not clear if this is/was the design intent. That solves my worry about B).</p>\n<p>Is there separate wit-bindgen mode/version that is doing the wrapping as <code>anyhow::Result&lt;u8&gt;</code> ?</p>",
        "id": 483336605,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1732043955
    },
    {
        "content": "<p>wRPC has a custom bindgen. There are also some optimizations in place for remote use cases </p>\n<p>wRPC bindgen tries hard to match the API of <code>wit-bindgen</code>, which is why wRPC repo merges from <code>wit-bindgen</code> tree</p>",
        "id": 483336963,
        "sender_full_name": "Roman Volosatovs",
        "timestamp": 1732044095
    },
    {
        "content": "<p>I'm thinking that in languages which support exceptions, fallibility could be solved without changing the signature. </p>\n<p>In rust, generating <code>anyhow::Result&lt;u8&gt;</code> is also solution for problem A) ? Is that what it does in WASIp3 wit-bindgen ?</p>",
        "id": 483342855,
        "sender_full_name": "Pavel Šavara",
        "timestamp": 1732046354
    }
]