[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> and I were just discussing where to land the implementation of wasi-nn: in the Wasmtime repo temporarily or in its own separate repository? My impression from our last Wasmtime meeting was that, even though it wasn't optimal, <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> agreed with me that placing it in the Wasmtime repository temporarily was ok.</p>",
        "id": 215342079,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604334436
    },
    {
        "content": "<p>My reasons went something like: having multiple Wasmtime binaries floating around, one for each combination of WASI modules a user may want, is confusing for users and a pain for those of us who would have to maintain it. Until we have a plugin system, stuffing wasi-nn into Wasmtime as an optional feature and adding CI testing to keep it working would prevent it from getting out of date as Wasmtime changes (e.g. it depends on wiggle, <span class=\"user-mention\" data-user-id=\"253992\">@Pat Hickey</span>, and having it  in-tree would mean that we could immediately see if changes in wiggle break wasi-nn)</p>",
        "id": 215342556,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604334620
    },
    {
        "content": "<p>Yeah, I think my earlier instinct was to look for ways to have it in a separate repo, but I can see the logic in having it in the main repo too</p>",
        "id": 215342796,
        "sender_full_name": "Dan Gohman",
        "timestamp": 1604334705
    },
    {
        "content": "<p>I personally feel that this is best done by moving it into a separate repository until the wasi-nn proposal has progressed further. My thinking is that if we try to prototype all wasi proposals in-tree it could make the tree pretty unwieldy (things like slow CI time, maybe large clones, lots of flags/configuration to wade through, etc)</p>",
        "id": 215344066,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604335173
    },
    {
        "content": "<p>I would prefer to land in-progress proposals out-of-tree and tackle the problems that brings up (like <span class=\"user-mention\" data-user-id=\"254110\">@Andrew Brown</span> is mentioning)</p>",
        "id": 215344109,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604335191
    },
    {
        "content": "<p>e.g. we should library-ify the CLI interface, make it super easy to plug in your own wasi proposal into the CLI, focus on stabilizing interfaces like witx, etc.</p>",
        "id": 215344287,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604335242
    },
    {
        "content": "<p>I have a different intuition on this, fwiw: I think there'd be a lot of value in making even experimental features available for easy testing in Wasmtime, meaning we build them by default, so they can be used with runtime flags. They wouldn't be runtime-enabled by default, of course, but there's a huge accessibility cliff between features that're included in the default build, and those that aren't</p>",
        "id": 215344540,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604335342
    },
    {
        "content": "<p>however, I very much appreciate that there are meaningful tradeoffs to this, so I wonder if we should have a more in-depth conversation on the policies around this more generally, not just for wasi-nn</p>",
        "id": 215344619,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604335386
    },
    {
        "content": "<p>We could go both ways on minimizing costs really, so perhaps we could game out both scenarios for a bit and evaluate based on the end state?</p>",
        "id": 215345461,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604335731
    },
    {
        "content": "<p>e.g. if adding it to the repo is incredibly cheap then it's fine, but if the cheapest we can get it is still pretty pricy that may swing the other way</p>",
        "id": 215345515,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604335761
    },
    {
        "content": "<p>yeah, that's a good point. Though I'd be surprised if find that it'd be very pricey to add something to the repo, but at the same time it's somehow very easy to use the feature from outside the repo. And no matter what, there's just a huge difference between \"you can just use the feature in the default build\" and \"you have to build things yourself</p>",
        "id": 215345999,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604335961
    },
    {
        "content": "<p>one of my main worries about adding it in-repo is the CI cost</p>",
        "id": 215346825,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604336308
    },
    {
        "content": "<p>each proposal would be a new builder (presumably) with presumably only one maintainer to ping when things go wrong</p>",
        "id": 215346854,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604336326
    },
    {
        "content": "<p>for something as valuable as CI that's a small bus factor for halting things</p>",
        "id": 215346892,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604336341
    },
    {
        "content": "<p>I think we would also want it such that if you don't enable the feature the clone/build cost is as close as possible to what it is today</p>",
        "id": 215346938,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604336368
    },
    {
        "content": "<blockquote>\n<p>each proposal would be a new builder </p>\n</blockquote>\n<p>can you say more about this part? ISTM if the feature is enabled by default, it'd not require an extra builder?</p>",
        "id": 215349875,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604337554
    },
    {
        "content": "<blockquote>\n<p>with presumably only one maintainer to ping when things go wrong</p>\n</blockquote>\n<p>this is an excellent point, and something I very much agree we should avoid. So perhaps to be enabled by default, a proposal has to have a commitment by a stakeholder group — i.e. a team — to actively maintain it and address issues in a timely manner</p>",
        "id": 215350076,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604337645
    },
    {
        "content": "<blockquote>\n<p>I think we would also want it such that if you don't enable the feature the clone/build cost is as close as possible to what it is today</p>\n</blockquote>\n<p>I think my <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2208\">PR</a> to merge wasi-nn in-tree meets that criteria: if the Cargo feature isn't enabled, the Wasmtime build time would not be impacted</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/2208\" style=\"background-image: url(https://avatars0.githubusercontent.com/u/54038801?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/2208\" title=\"Add an initial wasi-nn implementation for Wasmtime by abrown · Pull Request #2208 · bytecodealliance/wasmtime\">Add an initial wasi-nn implementation for Wasmtime by abrown · Pull Request #2208 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">This change adds a crate, wasmtime-wasi-nn, that uses wiggle to expose the current state of the wasi-nn API and openvino to implement the exposed functions. It includes an end-to-end test demonstra...</div></div></div>",
        "id": 215350084,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604337650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span>, not sure if enabling wasi-nn by default is currently desirable (though I agree with making things super-easy to run): enabling it requires you to have OpenVINO installed on the system (which is... unlikely) or tries to build OpenVINO from source (which takes forever)</p>",
        "id": 215350351,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604337767
    },
    {
        "content": "<p>I think eventually we need some form of \"plugin\" system to add capabilities to Wasmtime closer to runtime (along the lines of what you meant, <span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span>, but perhaps not all the way to \"runtime flags\"). Having wasi-nn in-tree would motivate the creation of such a system, if only to get wasi-nn out of tree.</p>",
        "id": 215350817,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604337979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254110\">@Andrew Brown</span> ah yeah, that does sound like enabling it by default wouldn't be desirable right now. It's not possible to dynamically link to OpenVINO by any chance, thereby turning it into a runtime dependency?</p>",
        "id": 215351234,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604338179
    },
    {
        "content": "<p>Well, OpenVINO does rely on shared libraries... maybe I'm being too careful, but I assumed that we wouldn't want to build the <code>openvino</code> crate unless the OpenVINO shared libraries are present on the system (either through binary installation or by building from source). Are you proposing we could just depend on the <code>openvino</code> crate and then the user will see a dynamic linking failure when they try to use it if they do not have the right libraries on their system?</p>",
        "id": 215351619,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604338357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span> oh I'm assuming wasi-nn is off-by-default but we still want to test wherever it lives</p>",
        "id": 215351913,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338504
    },
    {
        "content": "<p>so we'll need a CI builder running all the wasi-nn tests, and if that breaks it blocks everyone else from landing code until it's fixed</p>",
        "id": 215351935,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338520
    },
    {
        "content": "<p>My general thinking is that experimental wasi proposals shouldn't cause a burden on other developers, and the ways I  can envision a burden are: CI time and flakiness,  build time, and clone size</p>",
        "id": 215352129,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338590
    },
    {
        "content": "<p>Not to say the current PR doesn't handle build time and/or clone size, I think it does, just want to list things out!</p>",
        "id": 215352171,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338606
    },
    {
        "content": "<blockquote>\n<p>My general thinking is that experimental wasi proposals shouldn't cause a burden on other developers, and the ways I can envision a burden are: CI time and flakiness, build time, and clone size</p>\n</blockquote>\n<p>I agree... and we should list the inverse side as well: experimental wasi proposals shouldn't be a burden for the developers who write them <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 215352364,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604338686
    },
    {
        "content": "<blockquote>\n<p>so we'll need a CI builder running all the wasi-nn tests, and if that breaks it blocks everyone else from landing code until it's fixed</p>\n</blockquote>\n<p>That is partly good, though? If wiggle changes enough to break wasi-nn in CI, at least we can see that and fix it, right?</p>",
        "id": 215352532,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604338766
    },
    {
        "content": "<p>I'm less worried about things like wiggle refactorings causing breakage, where the wiggle refactor would ideally take into account the impact on consumers where if they're in-repo they can be evaluated</p>",
        "id": 215352892,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338927
    },
    {
        "content": "<p>(although that can also be problematic because it may be hard to build an extension like wasi-nn);</p>",
        "id": 215352925,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338947
    },
    {
        "content": "<p>I'm more worried about wasi-nn CI breaking</p>",
        "id": 215352934,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338954
    },
    {
        "content": "<p>like it's just flaky for some wasi-nn-specific reason, like OpenVINO downloads go offline or something like that</p>",
        "id": 215352960,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338970
    },
    {
        "content": "<p>or OpenVINO takes forever to build on CI (things like that, these are just examples)</p>",
        "id": 215352984,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604338985
    },
    {
        "content": "<p>so part of my thinking here is informed by how JS runtimes do make experimental features available with very low overhead, and how that's really useful for the ecosystem. I.e., you can enable most experimental JS features and tons of in-progress bundled modules and APIs in Node.js by just using runtime flags, instead of having to do custom builds. That means it becomes really easy to play around with them and validate their usefulness to content authors.</p>\n<p>We might well simply not be there in terms of maturity of WASI, the ecosystem, or Wasmtime, but I do think it's something worth striving for</p>",
        "id": 215353005,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604338999
    },
    {
        "content": "<p>I mean, I had not considered the runtime flag idea much before, but I now think it would be possible if we are ok exposing the user to \"library not found\" errors (though we could provide some helpful error messages there); that approach would then imply a CI step like the one Alex doesn't want to depend on, though. I do agree that the wasi-nn CI step I added is just one more thing that can go wrong</p>",
        "id": 215353816,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604339342
    },
    {
        "content": "<p>(even though I would commit to fixing it if it breaks)</p>",
        "id": 215353918,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604339379
    },
    {
        "content": "<p>sorry to be clear I'm just trying to be clear about the costs of putting it in-repo</p>",
        "id": 215354290,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604339541
    },
    {
        "content": "<p>I don't mean to pass judgement on whether it's worth it or not</p>",
        "id": 215354309,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604339549
    },
    {
        "content": "<p>I agree with you and Till that in-repo is the best for development of the proposal itself</p>",
        "id": 215354391,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604339585
    },
    {
        "content": "<p>entirely understood, and I'm glad you're raising these concerns. We should absolutely not enable experimental features lightly and without feeling confident that the results won't be painful</p>",
        "id": 215354410,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1604339595
    },
    {
        "content": "<blockquote>\n<p>I agree with you and Till that in-repo is the best for development of the proposal itself</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span>, so how should we conclude this conversation? Do you want to discuss more?</p>",
        "id": 215390403,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604357667
    },
    {
        "content": "<p>I think we need more input, my point about CI is something I don't think we can avoid and I don't want to speak for everyone else</p>",
        "id": 215390835,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604358014
    },
    {
        "content": "<p>if we want to move forward with this I think there needs to be more buy-in and consensus about what to do about CI</p>",
        "id": 215390862,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1604358035
    },
    {
        "content": "<p>To give some input / my own perspective on the CI issue -- I do find that it is somewhat productivity-draining to wait for the long tail of CI builds, and I'd be worried about anything involving a large build of a dependency. Is there a way we could cache it, or download a prebuilt image/release of OpenVINO, or...?</p>",
        "id": 215391455,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1604358456
    },
    {
        "content": "<p>As a general point: would it make sense to think about \"tiers\" in the CI at some point? E.g. in the SpiderMonkey/mozilla world, we had tests that would be run nightly but wouldn't block a checkin. (IIRC that Rust does something similar?)</p>",
        "id": 215391718,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1604358637
    },
    {
        "content": "<p>(Perhaps that's a separate/tangential conversation, but seems to overlap at least here w.r.t. the notion of add-on / experimental pieces)</p>",
        "id": 215391763,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1604358674
    },
    {
        "content": "<p>The wasi-nn CI step I added in the PR takes <a href=\"https://github.com/bytecodealliance/wasmtime/pull/2208/checks?check_run_id=1343759743\">~5 minutes</a>--this is significantly shorter than other steps, like the x64 backend (~11 minutes), building the API documentation (~18 minutes), test (~17 minutes), or build (~30 minutes). That is mainly because it uses a prebuilt OpenVINO binary that it installs as a GitHub action.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/pull/2208/checks?check_run_id=1343759743\" style=\"background-image: url(https://avatars0.githubusercontent.com/u/541880?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/pull/2208/checks?check_run_id=1343759743\" title=\"Add an initial wasi-nn implementation for Wasmtime by abrown · Pull Request #2208 · bytecodealliance/wasmtime\">Add an initial wasi-nn implementation for Wasmtime by abrown · Pull Request #2208 · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">This change adds a crate, wasmtime-wasi-nn, that uses wiggle to expose the current state of the wasi-nn API and openvino to implement the exposed functions. It includes an end-to-end test demonstra...</div></div></div>",
        "id": 215393812,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604360196
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span>, I like the tiered idea: it would be nice to see that certain things fail (e.g. peephole optimizer stuff, <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span>) but they shouldn't absolutely block merging.</p>",
        "id": 215394123,
        "sender_full_name": "Andrew Brown",
        "timestamp": 1604360438
    }
]